<% do_hpagehead("filter.titl"); %>
	<body>
		<div id="header">
			<div class="logo"> </div>
			<div class="navig"><a href="index.asp">Index</a> | <a href="javascript:self.close();"><% tran("sbutton.clos"); %></a></div>
		</div>
		<div id="content">
			<h2><% tran("filter.h2"); %></h2>
			<dl>
				<dd>この画面では、Internetの利用を許可もしくは制限するためのルールを定義することができます。ルールは特定のPC、もしくは特定のポート番号を指定することができます。</dd>

				<dt><% tran("filter.legend"); %></dt>

				<dd>ここではFilterを適用するPCを指定するためのポリシーを定義できます。これらのポリシーはIPアドレスもしくはMACアドレスで10個まで指定することができます。それぞれのポリシーに対し、適用する日時を指定することができます。<br /><br />
					ポリシーの作成・編集を行うには、次のように操作します：
					<ol class="wide">
						<li>ドロップダウンメニューから、編集を行うポリシー番号(1-10)を指定します。</li>
						<li>ポリシー名を入力します</li>
						<li>「クライアントの指定」ボタンをクリックします</li>
						<li>クライアントリストを編集し、IPアドレスもしくはMACアドレスを、それぞれのフィールドに入力します。IPアドレスとMACアドレスは1台につき、どちらかのみで構いません。</li>
						<li>「設定」ボタンをクリックし、設定を反映させます。設定を破棄する場合は「キャンセル」ボタンをクリックしてください。「閉じる」ボタンをクリックすると、設定を反映せずに元のページへ戻ります</li>
						<li>特定の日時にポリシーに合致する通信をブロックしたい場合は、ポリシーを「拒否」にします。特定の日時にのみ通信を許可したい場合は、ポリシーを「許可」にします。</li>
						<li>次に、フィルタを適用する曜日を選択します。「毎日」か、もしくはフィルタを適用する曜日にチェックをつけます。</li>
						<li>フィルタを適用する時間を選択します。「終日」もしくは時刻範囲を指定することができます。</li>
						<li>「設定」ボタンをクリックしてポリシーを反映します。</li>
						<li>続けて他のポリシーを編集する場合は、上記の手順を繰り返してください</li>
					</ol><br />
					ポリシーを削除する場合は、ポリシー番号を選択してから「削除」ボタンをクリックします。
				</dd>
				<dt><% tran("sbutton.summary"); %></dt>
				<dd>各ポリシーの設定一覧を確認するためには、「一覧」ボタンをクリックしてください。ポリシー一覧ではポリシー名・曜日・時間を確認することができます。また、複数のポリシーを同時に削除することもできます。</dd>
			</dl>
		</div>
	</body>
</html>
