<% do_hpagehead("qos.titl"); %>
	<body>
		<div id="header">
			<div class="logo"> </div>
			<div class="navig"><a href="index.asp">Index</a> | <a href="javascript:self.close();"><% tran("sbutton.clos"); %></a></div>
		</div>
		<div id="content">
			<h2><% tran("qos.h2"); %></h2>
			<dl>
				<dd>このページでは、ルーティング時におけるトラフィックに対し、帯域制御を行うための設定を行うことができます。即時性の高いトラフィックは限りなく遅延の無い状態でパケットの処理を行い、大量のデータ転送等に対しては低い帯域を割り当てるといったような制御を行うことができます。この機能は性質の異なるストリームを同時に処理するためにおこなわれるものです。パケットの処理に関するほとんどの制御は自動的に行われます。<br /><br />
					QoSの制御はサービス・MACアドレス・LANポート毎に対象を設定することができます。本製品のQoSは、その優先レベルを、「Premium」「Express」「Standard」「Bulk」の4つのカテゴリに分類しています。カテゴリをしていなかった通信は「Standard」として扱います。</dd>
				
				<dt><% tran("share.port"); %></dt>
				<dd>QoS処理を行う対象を、「WAN」「LAN&amp;WLAN」から選択することができます。それぞれインターネット側からの入力、LAN側および無線LANデバイスからの入力パケットの帯域を制御します。</dd>
				
				<dt><% tran("qos.type"); %></dt>
				<dd>
					<ul class="wide">
						<li>HFSC - Hierarchical Fair Service Curveの略です。Queueはインターフェース毎に割り当てられるため、一つのQueueは複数の子Queueを持ちます。それぞれのQueueに対し、優先度と帯域が割り当てられています。それぞれのQueueは通信の許可された帯域の範囲内で、時間単位でそれぞれの通信を制御します。

						<li>HTB - Hierarchical Token Bucketの略です。これはLinuxのCBQ qdiscにとって代わる高速な手法です。HTBはそれぞれのインターフェースに対し、出力パケットの制御を行います。HTBは一つの物理ポートを複数の仮想ポートに分割し、異なる帯域と優先順位を割り当てます。ユーザは予めどのように仮想ポートに分割するか、どのような順番で仮想ポートのパケットを転送するかを指定します。言い替えれば、HTBは利用可能な帯域を独占的に使用させないように、Upload/Download時のRateを制御します。</li>
					</ul>
				</dd>
				
				<dt><% tran("qos.uplink"); %> / <% tran("qos.dnlink"); %></dt>
				<dd>QoSの割当が行われる帯域(スループット)を、UpstreamおよびDownstreamに対してそれぞれ割り当てます。80～90%を割り当てるのが一般的に推奨されます。</dd>
				
				<dt><% tran("share.priority"); %></td>

				<dd>QoSの帯域を決定する手順は、は始めにLANポートに対して評価され、次にMACアドレス、その次にネットマスクが評価され、最後にサービス毎の評価を行います。例えば、MACアドレスに対して評価を行う場合はネットマスク・サービスに関する評価条件は無視されます。但し、LANポートベースの帯域制御は他の条件の評価と同時に行われます。 
					<ul class="wide">
						<li>Exempt - 可能な限り帯域を保持しペナルティの伴う制御を一切行いません。</li>
						<li>Premium - 高い帯域優先度を持ちます。デフォルトでは、ICMPパケットがこの優先度を持ちます。VoIPなどがこの帯域に割り当てられるべきです。また、高い帯域制限効果を得るため、あまり多くのアプリケーションを割り当てないようお勧めします。</li>
						<li>Express - この帯域は双方向性のあるアプリケーションなどに利用されます。</li>
						<li>Standard - 分類されなかったアプリケーションは全てこのプライオリティが割り当てられます。</li>
						<li>Bulk - 上記のクラスの転送が行われない場合に限って転送されます。P2PアプリケーションやFTPを利用する場合に割り当てます。</li>
					</ul>
				</dd>
				<dd>設定値を保存する場合は「設定」ボタンをクリックしてください。設定内容を破棄する場合は「キャンセル」ボタンをクリックしてください。<br /><br />
					<div class="note">
						<h4>メモ</h4>
						<div>QoSルールを変更した場合は、必ず「設定」をクリックして保存を行うようにしてください。</div>
					</div>
				</dd>
			</dl>
		</div>
	</body>
</html>



