<% do_hpagehead("wanmac.titl"); %>
	<body>
		<div id="header">
			<div class="logo"> </div>
			<div class="navig"><a href="index.asp">Index</a> | <a href="javascript:self.close();"><% tran("sbutton.clos"); %></a></div>
		</div>
		<div id="content">
			<h2><% tran("wanmac.h2"); %></h2>
			<dl>
				<dd>MAC¥¢¥É¥ì¥¹¤Ï12·å¤Î16¿Ê¿ô¤Ç¡¢¥Í¥Ã¥È¥ï¡¼¥¯µ¡´ï¤òÍ£°ì¤Ë¼¨¤¹¤â¤Î¤Ç¤¹¡£ISP¤ÎÃæ¤Ë¤Ï¥æ¡¼¥¶¤¬ÀÜÂ³¤¹¤ëµ¡´ï¤ÎMAC¥¢¥É¥ì¥¹¤òÅÐÏ¿¤¹¤ë¤³¤È¤òÍ×µá¤¹¤ë¤È¤³¤í¤â¤¢¤ê¤Þ¤¹¡£¤¤¤Þ¤Þ¤ÇÂ¾¤Îµ¡´ï¤òDSL¤ä¥â¥Ç¥à¤ËÀÜÂ³¤·¤Æ¤¤¤¿¾ì¹ç¤Ï¡¢ISP¤ËÅÐÏ¿¤·¤Ê¤ª¤¹¤«¡¢¤³¤Î¥Ú¡¼¥¸¤ÇËÜµ¡¤¬ÅÐÏ¿ºÑMAC¥¢¥É¥ì¥¹¤ò»ÈÍÑ¤Ç¤­¤ë¤è¤¦¤ËÀßÄê¤ò¹Ô¤¦É¬Í×¤¬¤¢¤ê¤Þ¤¹¡£</dd>
				
				<dt><% tran("wanmac.legend"); %></dt>
					<dd>MAC¥¢¥É¥ì¥¹¤ò¼êÆ°ÀßÄê¤¹¤ë¤¿¤á¤Ë¤Ï¡¢¡ÖMAC¥¢¥É¥ì¥¹ÀßÄê¡×¤Ë¤ª¤¤¤Æ¡ÖMAC¥¢¥É¥ì¥¹¡×¤òÍ­¸ú¤Ë¤·¡¢¥¤¥ó¥¿¡¼¥Í¥Ã¥ÈÂ¦¤ÎMAC¥¢¥É¥ì¥¹¤òÊÑ¹¹¤¹¤ëÉ¬Í×¤¬¤¢¤ê¤Þ¤¹¡£ÀßÄê¤·¤¿¤¢¤È¡¢¡ÖÀßÄê¡×¥Ü¥¿¥ó¤ò¥¯¥ê¥Ã¥¯¤·¤Þ¤¹¡£
					<br/><br/>
					MAC¥¢¥É¥ì¥¹¤òËÜÍè¤Î¤â¤Î¤ËÌá¤¹¤¿¤á¤Ë¤Ï¡¢¡ÖÌµ¸ú¡×¤òÁªÂò¤·¤Þ¤¹¡£
					</dd>
					<dd>»ÈÍÑ¤·¤Æ¤¤¤ë¥¯¥é¥¤¥¢¥ó¥ÈPC¤ÎMAC¥¢¥É¥ì¥¹¤ò¼èÆÀ¤¹¤ë¤¿¤á¤Ë¤Ï¡¢¡Ö¸½ºßÀÜÂ³Ãæ¤Îµ¡´ï¤«¤éMAC¥¢¥É¥ì¥¹¤ò¼èÆÀ¤¹¤ë¡×¤ò¥¯¥ê¥Ã¥¯¤·¤Þ¤¹¡£
					</dd>
					<dd>ÀßÄêÃÍ¤òÊÝÂ¸¤¹¤ë¾ì¹ç¤Ï¡ÖÀßÄê¡×¥Ü¥¿¥ó¤ò¥¯¥ê¥Ã¥¯¤·¤Æ¤¯¤À¤µ¤¤¡£ÀßÄêÆâÍÆ¤òÇË´þ¤¹¤ë¾ì¹ç¤Ï¡Ö¥­¥ã¥ó¥»¥ë¡×¥Ü¥¿¥ó¤ò¥¯¥ê¥Ã¥¯¤·¤Æ¤¯¤À¤µ¤¤¡£</dd>
			</dl>
		</div>
		<div class="also">
			<h4><% tran("share.seealso"); %></h4>
			<ul>
				<li><a href="HSetup.asp"><% tran("bmenu.setupbasic"); %></a></li>
				<li><a href="HStatus.asp"><% tran("bmenu.statuRouter"); %></a></li>
			</ul>
		</div>
	</body>
</html>
