<% do_hpagehead("wl_basic.titl"); %>
	<body>
		<div id="header">
			<div class="logo"> </div>
			<div class="navig"><a href="index.asp">Index</a> | <a href="javascript:self.close();"><% tran("sbutton.clos"); %></a></div>
		</div>
		<div id="content">
			<h2>´ðËÜ(ÌµÀþLAN)</h2>
			<dl>
				<dt>ÌµÀþLAN MACÆ°ºî¥â¡¼¥É</dt>
				<dd>¤³¤ÎÀ½ÉÊ¤ÎÌµÀþLAN¤Ï¡¢¼¡¤Î¤è¤¦¤Ê¥â¡¼¥É¤ÇÆ°ºî¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡§
					<ul class="wide">
						<li>AP &ndash; Infrastructure¥â¡¼¥É¤È¸À¤ï¤ì¤ë¡¢ÌµÀþLAN¤Ë¤ª¤±¤ë°ìÈÌÅª¤Ê¥â¡¼¥É¤Ç¤¹¡£ÄÌ¾ï¤ÎÌµÀþLAN¥¯¥é¥¤¥¢¥ó¥È¤òÀÜÂ³¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£</li>
						<li>Client &ndash; ¥¢¥¯¥»¥¹¥Ý¥¤¥ó¥È¤ËÀÜÂ³¤¹¤ë¥¯¥é¥¤¥¢¥ó¥È¤È¤·¤ÆÆ°ºî¤·¤Þ¤¹¡£¥¤¥ó¥¿¡¼¥Í¥Ã¥ÈÂ¦¤ÎÀÜÂ³¥Ý¡¼¥È¤È¤·¤Æ¡¢¾åÎ®¤Î¥¢¥¯¥»¥¹¥Ý¥¤¥ó¥È¤Ê¤É¤ËÀÜÂ³¤¹¤ë¾ì¹ç¤Ê¤É¤Ë»ÈÍÑ¤µ¤ì¤Þ¤¹¡£LANÂ¦¥Í¥Ã¥È¥ï¡¼¥¯¤È¤ÏNAPT¤µ¤ì¤¿¥Í¥Ã¥È¥ï¡¼¥¯¤È¤·¤ÆÆ°ºî¤·¤Þ¤¹¡£</li>
						<li>Client Bridged &ndash; ¥¢¥¯¥»¥¹¥Ý¥¤¥ó¥È¤ËÀÜÂ³¤¹¤ë¥¯¥é¥¤¥¢¥ó¥È¤È¤·¤ÆÆ°ºî¤·¤Þ¤¹¡£LANÂ¦¤È¤Î¥Ö¥ê¥Ã¥¸¥Ý¡¼¥È¤È¤·¤ÆÀÜÂ³¤µ¤ì¤Þ¤¹¡£Bridged¥â¡¼¥É¤È¤·¤Æ»ØÄê¤·¤¿¾ì¹ç¤Ï¡¢¥¤¥ó¥¿¡¼¥Í¥Ã¥ÈÂ¦¥Ý¡¼¥È¤Ï»ÈÍÑ¤·¤Þ¤»¤ó(Ìµ¸ú¤Ë¤·¤Æ¤¯¤À¤µ¤¤)¡£¤³¤Î¥â¡¼¥É¤Ï"WLAN Adapter"(ÀÜÂ³Àè¥¢¥¯¥»¥¹¥Ý¥¤¥ó¥È¤ÎLAN¥Ý¡¼¥È³ÈÄ¥)¤È¤·¤Æ»ÈÍÑ¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£</li>
						<li>Ad-Hoc &ndash; Ad-HocÀÜÂ³¤Ï¡¢¥¯¥é¥¤¥¢¥ó¥ÈÆ±»Î¤ÇÄÌ¿®¤ò¹Ô¤¦¾ì¹ç¤Ë»ÈÍÑ¤µ¤ì¤Þ¤¹¡£</li>
					</ul><br /><br />
					<div class="note">
						<h4>¥á¥â</h4>
						<div><a href="HWDS.asp">WDS</a>µ¡Ç½¤Ï¡¢AP¥â¡¼¥É¤Î¾ì¹ç¤Î¤ßÆ°ºî¤·¤Þ¤¹¡£</div>
					</div>
				</dd>
				<dt>ÌµÀþLAN MACÆ°ºî¥â¡¼¥É</dt>
				<dd>11g¤È11b¥Ç¥Ð¥¤¥¹¤òÆ±»þ¤Ë»ÈÍÑ¤¹¤ë¾ì¹ç¤Ï¡¢¡ÖMixed¡×¤Î¤Þ¤Þ»ÈÍÑ¤·¤Æ¤¯¤À¤µ¤¤¡£11g¤ËÂÐ±þ¤·¤¿¥Ç¥Ð¥¤¥¹¤Î¤ß»ÈÍÑ¤¹¤ë¾ì¹ç¤Ï¡ÖG-Only¡×¡¢11b¤ËÂÐ±þ¤·¤¿¥Ç¥Ð¥¤¥¹¤Î¤ß»ÈÍÑ¤¹¤ë¾ì¹ç¤Ë¤Ï¡ÖB-Only¡×¤òÁªÂò¤·¤Þ¤¹¡£¡ÖÌµ¸ú¡×¤òÁªÂò¤·¤¿¾ì¹ç¤Ï¡¢Á´¤Æ¤ÎÌµÀþµ¡Ç½¤¬Ìµ¸ú¤Ë¤Ê¤ê¤Þ¤¹¡£WDS¥â¡¼¥É¤ò»ÈÍÑ¤¹¤ë¾ì¹ç¤Ë¤Ï¡¢¡ÖB-Only¡×¥â¡¼¥É¤ò»ÈÍÑ¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤»¤ó¡£</dd>
				<dt>¥Í¥Ã¥È¥ï¡¼¥¯Ì¾(SSID)</dt>
				<dd>ÌµÀþLAN¥Í¥Ã¥È¥ï¡¼¥¯¤Î¼±ÊÌÌ¾¤òÀßÄê¤·¤Þ¤¹¡£SSID¤ÏÂ¾¤Î¥Í¥Ã¥È¥ï¡¼¥¯¤È¶èÊÌ¤·¤Ê¤±¤ì¤Ð¤Ê¤ê¤Þ¤»¤ó¡£ÂçÊ¸»ú¡¦¾®Ê¸»ú¤¬¶èÊÌ¤µ¤ì¤¿32Ê¸»ú¤Þ¤Ç¤ÎÊ¸»úÎó¤òÀßÄê¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£¥Í¥Ã¥È¥ï¡¼¥¯Æâ¤ÎÌµÀþLAN¥Ç¥Ð¥¤¥¹¤ËÂÐ¤·¤Æ¤Ï¡¢Á´¤ÆÆ±¤¸SSID¤òÀßÄê¤¹¤ëÉ¬Í×¤¬¤¢¤ê¤Þ¤¹¡£<br /><br />
					<div class="note">
						<h4>¥á¥â</h4>
						<div>¥»¥­¥å¥ê¥Æ¥£¾å¡¢¤Þ¤¿¤Ï¼±ÊÌ¾å¤ÎÍýÍ³¤«¤é¡¢SSID¤ÏÉ¬¤ºÆÈ¼«¤Î¤â¤Î¤ËÊÑ¹¹¤¹¤ë¤è¤¦¤Ë¤·¤Æ¤¯¤À¤µ¤¤</div>
					</div>
				</dd>
				<dt>ÌµÀþ¥Á¥ã¥ó¥Í¥ë</dt>
				<dd>Å¬ÀÚ¤Ê¥Á¥ã¥ó¥Í¥ë¤òÀßÄê¤·¤Þ¤¹(FCCÃÏ°è¤Ç¤Ï1¡Á11ch¡¢EUÃÏ°è¤Ç¤Ï1¡Á13ch¡¢ÆüËÜ¤Ç¤Ï1¡Á14ch)¡£¥Í¥Ã¥È¥ï¡¼¥¯Æâ¤ÎÁ´¤Æ¤ÎÌµÀþLANµ¡´ï¤ÏÆ±¤¸¥Á¥ã¥ó¥Í¥ë¤Ç¤¢¤ëÉ¬Í×¤¬¤¢¤ê¤Þ¤¹¡£¶áÎÙ¤ËÌµÀþLAN¤¬ºÇ¤â¾¯¤Ê¤¤¥Á¥ã¥ó¥Í¥ë¤ò»ÈÍÑ¤¹¤ë¤³¤È¤ò¤ª´«¤á¤·¤Þ¤¹¡£</dd>
				<dt>SSID¤Î¸ø³«</dt>
				<dd>ÌµÀþLAN¥¯¥é¥¤¥¢¥ó¥È¤¬ÀÜÂ³¤¹¤ë¤¿¤á¤Ë¸ø³«¤¹¤ëSSID¤Ë¤Ä¤¤¤Æ¡¢¸ø³«¤·¤Ê¤¤ÀßÄê¤ò¹Ô¤¦¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£¡ÖÌµ¸ú¡×¤ËÀßÄê¤¹¤ë¤³¤È¤Ë¤è¤Ã¤Æ¡¢SSID¤òÃÎ¤ëÌµÀþLAN¥¯¥é¥¤¥¢¥ó¥È¤Î¤ßÀÜÂ³¤¹¤ë¤³¤È¤¬¤Ç¤­¤ë¤è¤¦¤Ë¤Ê¤ê¤Þ¤¹¡£</dd>
<% ifndef("ACK", "<!--"); %>
				<dt>ÄÌ¿®µ÷Î¥¤ÎÍ­¸úÈÏ°Ï (ACK Timing)</dt>
				<dd>ÄÌ¿®¤ò¹Ô¤¦ºÇÂçµ÷Î¥¤òÀßÄê¤¹¤ë¤³¤È¤Ë¤è¤Ã¤Æ¡¢ÌµÂÌ¤ÊºÆÁ÷¤òËÉ¤°¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£
					<div class="note">
						<h4>¥á¥â</h4>
						<div>AtherosÀ½ÌµÀþLAN¥¯¥é¥¤¥¢¥ó¥È¤òÅëºÜ¤·¤¿À½ÉÊ¤Ç¤Ï¡¢0¤òÀßÄê¤¹¤ë¤³¤È¤Ë¤è¤Ã¤Æ¡¢ÄÌ¾ï»þ¤ÈÆ±ÍÍ¤ÎAck Timeout¤ò»ÈÍÑ¤·¤Þ¤¹</div>
					</div>
					<ul class="wide">
						<li> 0 Ack TimingÀßÄê¤òÌµ¸ú¤Ë¤·¤Þ¤¹¡£</li>
						<li> 1 - 999999 Ack Timing¤òÀßÄêÃÍ¤ËÊÑ¹¹¤·¤Þ¤¹¡£</li>
					</ul>
				</dd>
<% ifndef("ACK", "-->"); %>
				<dd>ÀßÄêÃÍ¤òÊÝÂ¸¤¹¤ë¾ì¹ç¤Ï¡ÖÀßÄê¡×¥Ü¥¿¥ó¤ò¥¯¥ê¥Ã¥¯¤·¤Æ¤¯¤À¤µ¤¤¡£ÀßÄêÆâÍÆ¤òÇË´þ¤¹¤ë¾ì¹ç¤Ï¡Ö¥­¥ã¥ó¥»¥ë¡×¥Ü¥¿¥ó¤ò¥¯¥ê¥Ã¥¯¤·¤Æ¤¯¤À¤µ¤¤¡£</dd>
			</dl>
		</div>
		<div class="also">
			<h4><% tran("share.seealso"); %></h4>
			<ul>
				<li><a href="HWPA.asp">ÌµÀþLAN¥»¥­¥å¥ê¥Æ¥£</a></li>
				<li><a href="HWirelessAdvanced.asp">¾ÜºÙ(ÌµÀþLAN)</a></li>
			</ul>
		</div>
	</body>
</html>