<% do_hpagehead("wl_adv.titl"); %>
	<body>
		<div id="header">
			<div class="logo"> </div>
			<div class="navig"><a href="index.asp">Index</a> | <a href="javascript:self.close();"><% tran("sbutton.clos"); %></a></div>
		</div>
		<div id="content">
			<h2>¾ÜºÙ(ÌµÀþLAN)</h2>
			<dl>
				<dd>¤³¤Î¥Ú¡¼¥¸¤Ç¤Ï¡¢ÌµÀþLAN¤ÇÄÌ¿®¤ò¹Ô¤¦¤¿¤á¤Î¾ÜºÙ¥Ñ¥é¥á¡¼¥¿¤òÀßÄê¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£Â¿¤¯¤Î¥Ñ¥é¥á¡¼¥¿¤Ï¹©¾ì½Ð²ÙÃÍ¤Î¤Þ¤Þ»ÈÍÑ¤¹¤ë¤³¤È¤ò¤ª´«¤á¤·¤Þ¤¹¡£</dd>
				<dt>802.11Ç§¾Ú¥â¡¼¥É</dt>
				<dd>¥Ç¥Õ¥©¥ë¥ÈÃÍ¤Ï¡Ö¼«Æ°¡×¤Ç¤¹¡£802.11¤Ç¤Ï¡¢¡ÖOpen¡×¡ÖShared¡×¤Î³ÆÇ§¾ÚÊý¼°¤¬¤¢¤ê¡¢¤³¤ÎÀ½ÉÊ¤Ï¤³¤ì¤é¤ò¼«Æ°Åª¤ËÇ§¼±¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£Shared¥­¡¼¤ò»ÈÍÑ¤·¤¿Ç§¾Ú¤ò»ÈÍÑ¤¹¤ë¾ì¹ç¤Î¤ß¡¢¡Ö¶¦Í­¥­¡¼¡×¤ËÀßÄê¤·¤Æ¤¯¤À¤µ¤¤¡£</dd>
				<dt>Basic Rate</dt>
				<dd>¥Ç¥Õ¥©¥ë¥ÈÃÍ¤Ï"Default"¤Ç¤¹¡£¤³¤ÎÀßÄê¤Ç¤Ï¡¢¤Û¤È¤ó¤É¤ÎÌµÀþLAN¥¯¥é¥¤¥¢¥ó¥È¤¬Å¬ÀÚ¤ÊÁ÷¿®Rate¤ÇManagement/ControlÄÌ¿®¤ò¹Ô¤¦¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£Á´¤Æ¤Î»ÈÍÑ²ÄÇ½¤ÊÁ÷¿®Rate¤ò»ÈÍÑ¤¹¤ë¤Ë¤Ï¡¢¡ÖALL¡×¤òÁªÂò¤·¤Þ¤¹¡£11b¥Ç¥Ð¥¤¥¹¤È¤Î¸ß´¹À­¤òºÇÂç¤Ë¤¹¤ë¾ì¹ç¤Ï¡¢¡Ö1-2Mbps¡×¤òÁªÂò¤·¤Þ¤¹¡£</dd>
				<dt>Á÷¿®Rate</dt>
				<dd>¥Ç¥Õ¥©¥ë¥ÈÃÍ¤Ï¡ÖAuto¡×¤Ç¤¹¡£1¡Á54Mbps¤Þ¤Ç¤ÎÂ®ÅÙ¤ò»ØÄê¤·¤¿¾ì¹ç¡¢¥¢¥¯¥»¥¹¥Ý¥¤¥ó¥È¤«¤é¤ÎÁ´¤Æ¤ÎÄÌ¿®¤Ë¤Ä¤¤¤Æ¡¢Äê¤á¤é¤ì¤¿Á÷¿®Rate¤òÍÑ¤¤¤Æ¹Ô¤¦¤è¤¦¤Ë¤Ê¤ê¤Þ¤¹¡£¡ÖAuto¡×¤Î¾ì¹ç¤Ï¡¢Äê¤á¤é¤ì¤¿Â®ÅÙ(11g¤Î¾ì¹ç¤Ï1¡Á54Mbps, 11b¤Î¾ì¹ç¤Ï1¡Á11Mbps)¤ÎÈÏ°ÏÆâ¤Ç¡¢Å¬ÀÚ¤ÊÁ÷¿®Â®ÅÙ¤òÁªÂò¤¹¤ë¤è¤¦¤Ë¤Ê¤ê¤Þ¤¹¡£</dd>
				<dt>IEEE802.11g ¥×¥í¥Æ¥¯¥·¥ç¥ó</dt>
				<dd>¥Ç¥Õ¥©¥ë¥ÈÃÍ¤Ï¡ÖÌµ¸ú¡×¤Ç¤¹¡£¡Ö¼«Æ°¡×¤òÁªÂò¤·¤¿¾ì¹ç¡¢11gÂÐ±þ¥¯¥é¥¤¥¢¥ó¥È¤¬ÀÜÂ³Ãæ¤Ë11b¤Î¤ßÂÐ±þ¤ÎÌµÀþLAN¥¯¥é¥¤¥¢¥ó¥È¤¬¥¢¥¯¥»¥¹¥Ý¥¤¥ó¥È¤ËÀÜÂ³¤µ¤ì¤¿¤È¤­¡¢ÄÌ¿®¤òÊÝ¸î¤¹¤ë¤¿¤á¤Î¼ê½ç(self CTS)¤ò»ÈÍÑ¤¹¤ë¤è¤¦¤Ë¤Ê¤ê¤Þ¤¹¡£</dd>
				<dt>¥Õ¥ì¡¼¥à¥Ð¡¼¥¹¥È</dt>
				<dd>¥Ç¥Õ¥©¥ë¥ÈÃÍ¤Ï¡ÖÌµ¸ú¡×¤Ç¤¹¡£¥Õ¥ì¡¼¥à¥Ð¡¼¥¹¥È¤òÍ­¸ú¤Ë¤¹¤ë¤È¡¢ÌµÀþLAN¤ÎÁ÷¿®Ç½ÎÏ¤ò¸þ¾å¤µ¤»¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£¤¿¤À¤·¡¢Âæ¿ô¤¬Â¿¤¤¾ì¹ç(¤ª¤è¤½4Âæ°Ê¾å)¤Ï¡¢°ìÈÌ¤Ë¸ú²Ì¤¬¾¯¤Ê¤¯¤Ê¤ê¤Þ¤¹¡£</dd>
				<dt>BeaconÁ÷¿®´Ö³Ö</dt>
				<dd>¥Ç¥Õ¥©¥ë¥ÈÃÍ¤Ï100¤Ç¤¹¡£1¡Á65,535¤Þ¤Ç¤Î¿ôÃÍ¤òÀßÄê¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£Beacon¤ÏÌµÀþLAN¥¯¥é¥¤¥¢¥ó¥È¤È¥¢¥¯¥»¥¹¥Ý¥¤¥ó¥È¤¬ÄÌ¿®¥¿¥¤¥ß¥ó¥°¤òÆ±´ü¤¹¤ë¤¿¤á¤Ë»ÈÍÑ¤µ¤ì¤Þ¤¹¡£50°Ê¾å¤Î¿ôÃÍ¤ò¤ª´«¤á¤·¤Þ¤¹¡£</dd>
				<dt>DTIM Á÷¿®´Ö³Ö</dt>
				<dd>¥Ç¥Õ¥©¥ë¥ÈÃÍ¤Ï1¤Ç¤¹¡£1¡Á255¤Þ¤Ç¤Î¿ôÃÍ¤òÀßÄê¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£DTIM¤ÏPowerSaveÃæ¤ÎÌµÀþLAN¥¯¥é¥¤¥¢¥ó¥È¤ËÂÐ¤·¡¢TIM¤òÄÌÃÎ¤¹¤ë´Ö³Ö¤ò¼¨¤·¤Þ¤¹¡£¥Þ¥ë¥Á¥­¥ã¥¹¥È¡¦¥Ö¥í¡¼¥É¥­¥ã¥¹¥È¥Õ¥ì¡¼¥à¤Ï°ìÈÌ¤ËDTIM¤Î´Ö³Ö¤Ç¤·¤«Á÷¿®¤µ¤ì¤Þ¤»¤ó¡£¥¯¥é¥¤¥¢¥ó¥È¤ÏDTIM´Ö³Ö¤Î¤ß¥Ç¡¼¥¿¤ò¼õ¿®¤¹¤ë¤è¤¦¤Ë¤Ê¤ë¤Î¤Ç¡¢¥¯¥é¥¤¥¢¥ó¥È¤Î¥Ð¥Ã¥Æ¥ê¡¼¼÷Ì¿¤ò±äÄ¹¤µ¤»¤ë¸Ä¤È¤¬¤Ç¤­¤Þ¤¹¡£</dd>
				<dt>Fragmentation Threshold</dt>
				<dd>¥Ç¥Õ¥©¥ë¥ÈÃÍ(2346)¤Î¤Þ¤Þ¤Ç»ÈÍÑ¤¹¤ë¤³¤È¤ò¤ª´«¤á¤·¤Þ¤¹¡£¤³¤Î¥Ñ¥é¥á¡¼¥¿¤ÏÁ÷¿®¥Õ¥ì¡¼¥àÄ¹¤ÎºÇÂçÃÍ¤ò¼¨¤·¤Æ¤ª¤ê¡¢256¡Á2346¤Þ¤Ç¤ÎÃÍ¤òÀßÄê¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹(»Ä¤ê¤Î¥Ç¡¼¥¿¤ÏÊ¬³ä¤·¤ÆÁ÷¿®¤µ¤ì¤Þ¤¹)¡£¥Î¥¤¥º¤ÎÂ¿¤¤´Ä¶­¤Ê¤É¤ÇÁ÷¿®¥Ç¡¼¥¿¤Î¥¨¥é¡¼¤¬Â¿¤¤¾ì¹ç¤Ï¡¢¤³¤ÎÃÍ¤ò¾®¤µ¤¯¤¹¤ë¤³¤È¤Ë¤è¤Ã¤Æ¤½¤Î±Æ¶Á¤ò·Ú¸º¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£</dd>
				<dt>RTS Threshold</dt>
				<dd>¥Ç¥Õ¥©¥ë¥ÈÃÍ(2347)¤Î¤Þ¤Þ¤Ç»ÈÍÑ¤¹¤ë¤³¤È¤ò¶¯¤¯¤ª´«¤á¤·¤Þ¤¹¡£¥Î¥¤¥º¤ä°ÌÃÖ¤¬¸¶°ø¤ÇÄÌ¿®¤¬ÉÔ°ÂÄê¤Ë¤Ê¤Ã¤Æ¤¤¤ë¾ì¹ç¤Ï¡¢¤³¤Î¥Ñ¥é¥á¡¼¥¿¤òÄ´À°¤¹¤ë¤³¤È¤ò¤ª´«¤á¤·¤Þ¤¹¡£Á÷¿®¤¹¤ë¥Ç¡¼¥¿¤Î¥µ¥¤¥º¤¬RTS Threshold¤è¤ê¤â¾®¤µ¤¤¾ì¹ç¡¢RTS/CTS¼ê½ç¤òÍÑ¤¤¤ÆÄÌ¿®¤ò¹Ô¤¦¸Ä¤È¤¬¤Ç¤­¤ë¤è¤¦¤Ë¤Ê¤ê¤Þ¤¹¡£¥¢¥¯¥»¥¹¥Ý¥¤¥ó¥È¤ÏRTS¥Õ¥ì¡¼¥à¤òÁ÷¿®¤·¡¢¤½¤ì¤ËÂÐ¤·¤Æ¼õ¿®Â¦¤¬CTS¤òÊÖ¿®¤·¡¢¥¢¥¯¥»¥¹¥Ý¥¤¥ó¥ÈÂ¦¤¬¼õ¿®¤·¤¿¸å¤Ç¥Ç¡¼¥¿¤ÎÁ÷¿®¤ò³«»Ï¤·¤Þ¤¹¡£</dd>
				<dt>¥×¥é¥¤¥Ð¥·¡¼¥»¥Ñ¥ì¡¼¥¿</dt>
				<dd>¥Ç¥Õ¥©¥ë¥ÈÃÍ¤Ï¡ÖÌµ¸ú¡×¤Ç¤¹¡£¡ÖÍ­¸ú¡×¤Ë¤¹¤ë¤³¤È¤Ë¤è¤Ã¤ÆÌµÀþLAN¥¯¥é¥¤¥¢¥ó¥ÈÆ±»Î¤ÎÄÌ¿®¤¬¤Ç¤­¤Ê¤¯¤Ê¤ê¤Þ¤¹¡£</dd>
				<dt>Á÷¿®¥¢¥ó¥Æ¥Ê / ¼õ¿®¥¢¥ó¥Æ¥Ê</dt>
				<dd>¡Ö±¦¡×¡Öº¸¡×¡Ö¼«Æ°¡×¤Î¤¦¤Á¤«¤éÁªÂò¤Ç¤­¤Þ¤¹¡£¥¢¥ó¥Æ¥Ê¤ÎÁ÷¼õ¿®¤ò¸ÇÄê¤¹¤ë¤³¤È¤Ë¤è¤Ã¤ÆÄÌ¿®¤ÎºÇÅ¬²½¤ò¹Ô¤¦¤³¤È¤¬¤Ç¤­¤ë¤è¤¦¤Ë¤Ê¤ê¤Þ¤¹¡£AS-A100¤Ç¤Ï¡¢¡Ö±¦¡×¤¬¾åÉô¥á¥¤¥ó¥¢¥ó¥Æ¥Ê¤ò¡¢¡Öº¸¡×¤¬ÆâÂ¢¥¢¥ó¥Æ¥Ê¤ò¼¨¤·¤Þ¤¹¡£</dd>
				<dt>PLCP¥Ø¥Ã¥À</dt>
				<dd>¡ÖLong¡×¡ÖShort¡×¡Ö¼«Æ°¡×¤Î¤¤¤º¤ì¤«¤ò»ØÄê¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£11g¤È11b¥Ç¥Ð¥¤¥¹¤òº®ÍÑ¤·¤Æ¤ª¤ê¡¢ÄÌ¿®¤¬ÉÔ°ÂÄê¤Ç¤¢¤ë¾ì¹ç¡¢¡ÖLong¡×¤òÀßÄê¤¹¤ë¤³¤È¤Ç¡¢¾É¾õ¤¬²þÁ±¤µ¤ì¤ë¤³¤È¤¬¤¢¤ê¤Þ¤¹¡£</dd>
<!--
				<dt>Á÷¿®½ÐÎÏ</dt>
				<dd>1¡Á251mw¤ÎÈÏ°ÏÆâ¤ÇÀßÄê¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£¤Û¤È¤ó¤É¤Î¾ì¹ç¡¢70mwÄøÅÙ¤Î½ÐÎÏ¤¬ºÇÅ¬ÃÍ¤Ë¤Ê¤ê¤Þ¤¹¡£¤è¤êÂ¿¤¯¤ÎPowerÃÍ¤ÎÀßÄê¤Ï¡¢µ¡´ï¤òÇË²õ¤¹¤ë¤³¤È¤Ë¤Ä¤Ê¤¬¤ê¤Þ¤¹¤Î¤Ç¤ª´«¤á¤Ç¤­¤Þ¤»¤ó¡£</dd>
				<dt>Afterburner</dt>
				<dd>¥Ç¥Õ¥©¥ë¥ÈÃÍ¤Ï¡ÖÌµ¸ú¡×¤Ç¤¹¡£WRT54GS¤Î¤ß»ØÄê¤¹¤ë¤³¤È¤¬¤Ç¤­¡¢¡ÖSpeedbooster¡×¤ò¥µ¥Ý¡¼¥È¤·¤¿Linksys¤Î¡ÖGS¡×¤ÎÉÕ¤¤¤¿¥¯¥é¥¤¥¢¥ó¥È¤È¤ÎÀÜÂ³»þ¤Î¤ßÍ­¸ú¤Ë¤Ê¤ê¤Þ¤¹¡£</dd>
-->
				<dt>ÌµÀþLAN¤«¤é¤ÎÀßÄê²èÌÌ¤Î¥¢¥¯¥»¥¹</dt>
				<dd>¥Ç¥Õ¥©¥ë¥ÈÃÍ¤Ï¡ÖÍ­¸ú¡×¤Ç¤¹¡£ÌµÀþ¥¯¥é¥¤¥¢¥ó¥È¤«¤é¤ÎÀßÄêWeb²èÌÌ¤ÎÀÜÂ³¤òµö²Ä¤Ç¤­¤ë¤è¤¦¤Ë¤Ê¤ê¤Þ¤¹¡£ÌµÀþLAN¥Ý¡¼¥È¤«¤é¤ÎÀÜÂ³¤òÀ©¸Â¤·¤¿¤¤¾ì¹ç¤Ï¡ÖÌµ¸ú¡×¤òÀßÄê¤·¤Æ¤¯¤À¤µ¤¤¡£</dd>
				<dt>ÌµÀþLAN¥¿¥¤¥Þ</dt>
				<dd>ÌµÀþLAN¥¿¥¤¥Þ¤Ï¡¢ÌµÀþLAN¤Ë¤è¤ëÀÜÂ³¤òÄó¶¡¤¹¤ë»þ´ÖÂÓ¤òÀßÄê¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£¥Ç¥Õ¥©¥ë¥ÈÃÍ¤Ï¡ÖÌµ¸ú¡×(¾ï¤ËÌµÀþµ¡Ç½¤¬Í­¸ú)¤Ç¤¹¡£»þ´ÖÂÓ¤Ë¤è¤Ã¤ÆÌµÀþµ¡Ç½¤òÌµ¸ú¤Ë¤·¤¿¤¤¾ì¹ç¤Ï¡ÖÍ­¸ú¡×¤òÁªÂò¤·¡¢Ìµ¸ú¤Ë¤¹¤ë»þ´ÖÂÓ¤¬ÀÖ¿§¤Ë¤Ê¤ë¤è¤¦¤Ë¡¢¥¿¥¤¥à¥Ð¡¼¤ò¥¯¥ê¥Ã¥¯¤·¤Þ¤¹¡£¤Þ¤¿¡¢Á´»þ´ÖÂÓ¤òÍ­¸ú¤â¤·¤¯¤ÏÌµ¸ú¤Ë¤¹¤ë¾ì¹ç¤Ï¡¢¡Ö¾ï»þÍ­¸ú¡×¡Ö¾ï»þÌµ¸ú¡×¤ò¥¯¥ê¥Ã¥¯¤·¤Þ¤¹¡£</dd>
				<dt>Wi-Fi WMM</dt>
				<dd>WMMµ¡Ç½¤Ë´Ø¤¹¤ëÀßÄê¤ò¹Ô¤¤¤Þ¤¹¡£WMM¤òÍ­¸ú¤ËÀßÄê¤¹¤ë¤³¤È¤Ë¤è¤Ã¤Æ¡¢Á÷¿®¤µ¤ì¤ë¥Õ¥ì¡¼¥à¤Ï¡ÖAC_BK¡×¡ÖAC_BE¡×¡ÖAC_VI¡×¡ÖAC_VO¡×¤Î³ÆQueue¤´¤È¤ËÀßÄê¤µ¤ì¤¿°Û¤Ê¤ëÍ¥Àè³ÎÎ¨¤Ç½ÐÎÏ¤µ¤ì¤Þ¤¹¡£Queue¤Î·èÄê¤Ë¤ÏDSCP¥Õ¥£¡¼¥ë¥É¤¬»ÈÍÑ¤µ¤ì¤Þ¤¹¡£<br /><br />
					<div class="note">
						<h4>¥á¥â</h4>
						<div>°ìÎã¤È¤·¤Æ¡¢Voice, Video¤Î¤è¤¦¤Ê»þ´Ö¾ò·ï¤Î¸·¤·¤¤¥Õ¥ì¡¼¥à¤Ë¤Ï¹â¤¤Í¥ÀèÅÙ¤ò³ä¤êÅö¤Æ¡¢¤½¤ÎÂ¾¤Î¥Õ¥ì¡¼¥à¤ËÂÐ¤·¤Æ¤ÏÄã¤¤Í¥ÀèÅÙ¤ò³ä¤êÅö¤Æ¤ë¤³¤È¤ò¿ä¾©¤·¤Þ¤¹¡£</div>
					</div>
				</dd>
				<dt>No-Acknowledgement</dt>
				<dd>ÄÌ¿®»þ¡¢Á÷¿®³ÎÇ§(Ack)¤òÊÖ¤µ¤Ê¤¤¤è¤¦¤Ë¤Ê¤ê¤Þ¤¹¡£¥Ñ¥Õ¥©¡¼¥Þ¥ó¥¹¤Ë¤ª¤¤¤ÆÍ­Íý¤Ç¤¢¤ëÂå¤ï¤ê¤Ë¡¢¥Î¥¤¥º¤ÎÂ¿¤¤´Ä¶­¤Ç¤ÏError¤ËÂÐ¤·¤ÆÀÈ¼å¤Ë¤Ê¤ê¤Þ¤¹¡£</dd>
				<dt>EDCA AP Parameters (AP ¢ª ¥¯¥é¥¤¥¢¥ó¥È)</dt>
				<dd>¥¢¥¯¥»¥¹¥Ý¥¤¥ó¥È¤«¤é¥¯¥é¥¤¥¢¥ó¥È¤Ø¤ÎÄÌ¿®¤Ë»ÈÍÑ¤µ¤ì¤ë¥Ñ¥é¥á¡¼¥¿¤òÀßÄê¤·¤Þ¤¹¡£</dd>
				<dt>EDCA STA Parameters (¥¯¥é¥¤¥¢¥ó¥È ¢ª AP)</dt>
				<dd>¥¯¥é¥¤¥¢¥ó¥È¤«¤é¥¢¥¯¥»¥¹¥Ý¥¤¥ó¥È¤Ø¤ÎÄÌ¿®¤Ë»ÈÍÑ¤µ¤ì¤ë¥Ñ¥é¥á¡¼¥¿¤òÀßÄê¤·¤Þ¤¹¡£</dd>
				<dt>AC_BK(Äã¤¤)</dt>
				<dd>ºÇ¤âÄã¤¤¥×¥é¥¤¥ª¥ê¥Æ¥£¤Ç¤¹¡£<BR />
					FTP¤Ê¤É¡¢Throughput¤Ï¹â¤¤¤¬»þ´ÖÀ©Ìó¤Î¾¯¤Ê¤¤Stream¤Ï¤³¤ÎQueue¤ò»ÈÍÑ¤·¤Þ¤¹¡£</dd>
				<dt>AC_BE(ÄÌ¾ï)</dt>
				<dd>ÄÌ¾ï¤Î¥×¥é¥¤¥ª¥ê¥Æ¥£¤Ç¤¹¡£<BR />
					¤Û¤È¤ó¤É¤Î¥¢¥×¥ê¥±¡¼¥·¥ç¥ó¤Ï¤³¤ÎQueue¤ò»ÈÍÑ¤·¤Þ¤¹¡£</dd>
				<dt>AC_VI(Í¥Àè)</dt>
				<dd>¹â¤¤¥×¥é¥¤¥ª¥ê¥Æ¥£¤ò»ý¤Á¤Þ¤¹¡£<BR />
					¥Ó¥Ç¥ª¥¹¥È¥ê¡¼¥à¤Ê¤É¡¢¹â¤¤¥×¥é¥¤¥ª¥ê¥Æ¥£¤Î¥¹¥È¥ê¡¼¥à¤ËÂÐ±þ¤·¤Þ¤¹¡£</dd>
				<dt>AC_VO(ºÇÍ¥Àè)</dt>
				<dd>ºÇ¤â¹â¤¤¥×¥é¥¤¥ª¥ê¥Æ¥£¤ò»ý¤Á¤Þ¤¹¡£<BR />
					VoIP¤Ê¤É¡¢¥¯¥ê¥Æ¥£¥«¥ë¤Ê»þ´Ö¾ò·ï¤ò»ý¤Ä¥¢¥×¥ê¥±¡¼¥·¥ç¥ó¤Ê¤É¤Ë»ÈÍÑ¤·¤Þ¤¹¡£</dd>
				<dt>CWmin</dt>
				<dd>ºÇ¾®¥³¥ó¥Æ¥ó¥·¥ç¥ó¡¦¥¦¥£¥ó¥É¥¦¥µ¥¤¥º¤ò»ØÄê¤·¤Þ¤¹¡£¥³¥ó¥Æ¥ó¥·¥ç¥ó¡¦¥¦¥£¥ó¥É¥¦¤ÏIEEE802.11¤Ç¹Ô¤¦¥Õ¥ì¡¼¥à¾×ÆÍ²óÈòµ¡¹½¤Ç»ÈÍÑ¤µ¤ì¡¢°ìÈÌ¤Ë¥¦¥£¥ó¥É¥¦Æâ¤ÎÃÍ¤¬¾®¤µ¤¯¤Ê¤ë¤Û¤É¡¢¤½¤Î¥­¥å¡¼¤¬Á÷¿®¸¢¤òÆÀ¤ë³ÎÎ¨¤¬¹â¤¯¤Ê¤ê¤Þ¤¹¡£</dd>
				<dt>CWmax</dt>
				<dd>ºÇÂç¥³¥ó¥Æ¥ó¥·¥ç¥ó¡¦¥¦¥£¥ó¥É¥¦¥µ¥¤¥º¤ò»ØÄê¤·¤Þ¤¹¡£¥³¥ó¥Æ¥ó¥·¥ç¥ó¡¦¥¦¥£¥ó¥É¥¦¤ÏIEEE802.11¤Ç¹Ô¤¦¥Õ¥ì¡¼¥à¾×ÆÍ²óÈòµ¡¹½¤Ç»ÈÍÑ¤µ¤ì¡¢°ìÈÌ¤Ë¥¦¥£¥ó¥É¥¦Æâ¤ÎÃÍ¤¬¾®¤µ¤¯¤Ê¤ë¤Û¤É¡¢¤½¤Î¥­¥å¡¼¤¬Á÷¿®¸¢¤òÆÀ¤ë³ÎÎ¨¤¬¹â¤¯¤Ê¤ê¤Þ¤¹¡£</dd>
				<dt>AIFSN</dt>
				<dd>¥Õ¥ì¡¼¥àÁ÷¿®´Ö³Ö¤òÀßÄê¤·¤Þ¤¹¡£Ã±°Ì¤Ï¥¹¥í¥Ã¥È(CWmin, CWmax¤ÇÄêµÁ¤µ¤ì¤ë¥¦¥£¥ó¥É¥¦ÃÍ¤ÈÆ±ÍÍ)¤Ç¤¹¡£¥Õ¥ì¡¼¥àÁ÷¿®´Ö³Ö¤¬¾®¤µ¤¤¤Û¤É¡¢¥Ð¥Ã¥¯¥ª¥Õ¥¢¥ë¥´¥ê¥º¥à¤Î³«»Ï»þ´Ö¤¬Áá¤Þ¤ë¤¿¤á¡¢·ë²Ì¤È¤·¤Æ¥­¥å¡¼¤ÎÍ¥ÀèÅÙ¤¬¹â¤¯¤Ê¤ê¤Þ¤¹¡£</dd>
				<dt>TXOP(b) and TXOP (a/g)</dt>
				<dd>¥­¥å¡¼¤¬Á÷¿®¸¢¤òÆÀ¤¿¾ì¹ç¤ËÀêÍ­¤Ç¤­¤ë»þ´Ö¤ò¼¨¤·¤Þ¤¹¡£1Ã±°Ì¤Ï32ms¤Ç¤¹¡£¤³¤Î»þ´Ö¤¬Â¿¤¤¤Û¤É°ìÅÙÆÀ¤¿Á÷¿®¸¢¤Ç¤è¤êÂ¿¤¯¤Î¥Õ¥ì¡¼¥à¤òÅ¾Á÷¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¤¬¡¢È¿ÌÌ¥­¥å¡¼¤Î¥ê¥¢¥ë¥¿¥¤¥àÀ­¤òÂ»¤Ê¤¦¤³¤È¤Ë¤Ê¤ê¤Þ¤¹¡£<br>
				11b¥Õ¥ì¡¼¥à¤ÎÅ¾Á÷¤Ë¤ÏTXOP(b)¡¢11g¥Õ¥ì¡¼¥à¤ÎÅ¾Á÷¤Ë¤ÏTXOP(g)¤¬»ÈÍÑ¤µ¤ì¤Þ¤¹¡£</dd>
				<dd>ÀßÄêÃÍ¤òÊÝÂ¸¤¹¤ë¾ì¹ç¤Ï¡ÖÀßÄê¡×¥Ü¥¿¥ó¤ò¥¯¥ê¥Ã¥¯¤·¤Æ¤¯¤À¤µ¤¤¡£ÀßÄêÆâÍÆ¤òÇË´þ¤¹¤ë¾ì¹ç¤Ï¡Ö¥­¥ã¥ó¥»¥ë¡×¥Ü¥¿¥ó¤ò¥¯¥ê¥Ã¥¯¤·¤Æ¤¯¤À¤µ¤¤¡£</dd>

			</dl>
		</div>
		<div class="also">
			<h4>See also:</h4>
			<ul>
				<li><a href="HWireless.asp">´ðËÜ(ÌµÀþLAN)</a></li>
				<li><a href="HWPA.asp">ÌµÀþLAN¥»¥­¥å¥ê¥Æ¥£</a></li>
			</ul>
		</div>
	</body>
</html>