<% do_hpagehead("wl_mac.titl"); %>
	<body>
		<div id="header">
			<div class="logo"> </div>
			<div class="navig"><a href="index.asp">Index</a> | <a href="javascript:self.close();"><% tran("sbutton.clos"); %></a></div>
		</div>
		<div id="content">
			<h2>MAC¥¢¥É¥ì¥¹¥Õ¥£¥ë¥¿</h2>
			<dl>
				<dd>MAC¥¢¥É¥ì¥¹¥Õ¥£¥ë¥¿¤Ï¡¢Í½¤áµö²Ä¤òÍ¿¤¨¤¿MAC¥¢¥É¥ì¥¹¤ò»ý¤Ä¥¯¥é¥¤¥¢¥ó¥È¤Î¤ß¤¬ÀÜÂ³¡¦ÄÌ¿®¤ò¹Ô¤¦¤³¤È¤¬¤Ç¤­¤ë¤è¤¦¤Ë¤¹¤ëµ¡Ç½¤Ç¤¹¡£Windows¤Ë¤ª¤±¤ëÌµÀþLAN¥¯¥é¥¤¥¢¥ó¥È¤ÎMAC¥¢¥É¥ì¥¹¤Ë¤Ä¤¤¤Æ¤Ï¡¢<a href="HWanMAC.asp">¤³¤Á¤é</a>¤ò»²¾È¤¯¤À¤µ¤¤¡£</dd>
				<dd>MAC¥¢¥É¥ì¥¹¥Õ¥£¥ë¥¿µ¡Ç½¤ò»ÈÍÑ¤¹¤ë¤¿¤á¤Ë¤Ï¡¢¡ÖMAC¥¢¥É¥ì¥¹¥Õ¥£¥ë¥¿¡×¤ò¡ÖÍ­¸ú¡×¤ËÀßÄê¤·¡¢¼¡¤ÎÀßÄê¤ò¹Ô¤¤¤Þ¤¹¡§
					<ol class="wide">
						<li>ÆÃÄê¤ÎÌµÀþLAN¥¯¥é¥¤¥¢¥ó¥È¤òÇÓ½ü¤·¤¿¤¤¾ì¹ç¤Ï¡¢¡Ö¥ê¥¹¥È¤ËÅÐÏ¿¤µ¤ì¤Æ¤¤¤ë¥¯¥é¥¤¥¢¥ó¥È¤ÎÄÌ¿®¤òµñÈÝ¤¹¤ë¡×¤òÁªÂò¤·¤Þ¤¹¡£ÆÃÄê¤ÎÌµÀþLAN¥¯¥é¥¤¥¢¥ó¥È¤Î¤ßÄÌ¿®¤ò¤µ¤»¤¿¤¤¾ì¹ç¤Ï¡¢¡Ö¥ê¥¹¥È¤ËÅÐÏ¿¤µ¤ì¤Æ¤¤¤ë¥¯¥é¥¤¥¢¥ó¥È¤ÎÄÌ¿®¤òµö²Ä¤¹¤ë¡×¤òÁªÂò¤·¤Þ¤¹¡£</li>
						<li>¡ÖMAC¥¢¥É¥ì¥¹¤ÎÊÔ½¸¡×¤ò¥¯¥ê¥Ã¥¯¤·¡¢µñÈÝ(µö²Ä)¤·¤¿¤¤¥¯¥é¥¤¥¢¥ó¥È¤ÎMAC¥¢¥É¥ì¥¹¤òÅÐÏ¿¤·¤Þ¤¹¡£<br /><br />
							<div class="note">
								<b>¥á¥â</b><br />
								MAC¥¢¥É¥ì¥¹¤Ï¡¢¼¡¤Î¤è¤¦¤Ê¥Õ¥©¡¼¥Þ¥Ã¥È¤ÇÆþÎÏ¤¹¤ëÉ¬Í×¤¬¤¢¤ê¤Þ¤¹¡§"001601xxxxxx" (MAC¥¢¥É¥ì¥¹¤¬00:16:01:xx:xx:xx¤Î¾ì¹ç)
							</div>
						</li>
						<li>ÀßÄêÃÍ¤òÊÝÂ¸¤¹¤ë¾ì¹ç¤Ï¡ÖÀßÄê¡×¥Ü¥¿¥ó¤ò¥¯¥ê¥Ã¥¯¤·¤Æ¤¯¤À¤µ¤¤¡£ÀßÄêÆâÍÆ¤òÇË´þ¤¹¤ë¾ì¹ç¤Ï¡Ö¥­¥ã¥ó¥»¥ë¡×¥Ü¥¿¥ó¤ò¥¯¥ê¥Ã¥¯¤·¤Æ¤¯¤À¤µ¤¤¡£</li>
					</ol><br />
					MAC¥¢¥É¥ì¥¹¥Õ¥£¥ë¥¿¤ò»ÈÍÑ¤·¤Ê¤¤¾ì¹ç¤Ï¡¢MAC¥¢¥É¥ì¥¹¥Õ¥£¥ë¥¿¤ò¡ÖÌµ¸ú¡×¤ËÀßÄê¤·¤Æ¤¯¤À¤µ¤¤¡£
				</dd>
			</dl>
		</div>
		<div class="also">
			<h4><% tran("share.seealso"); %></h4>
			<ul>
				<li><a href="HWireless.asp">´ðËÜ(ÌµÀþLAN)</a></li>
				<li><a href="HWPA.asp">ÌµÀþLAN¥»¥­¥å¥ê¥Æ¥£</a></li>
			</ul>
		</div>
	</body>
</html>