<% do_hpagehead("wpa.titl"); %>
	<body>
		<div id="header">
			<div class="logo"> </div>
			<div class="navig"><a href="index.asp">Index</a> | <a href="javascript:self.close();"><% tran("sbutton.clos"); %></a></div>
		</div>
		<div id="content">
			<h2>ÌµÀþLAN¥»¥­¥å¥ê¥Æ¥£</h2>
			<dl>
				<dd>¤³¤Îµ¡´ï¤ÏWPA Personal, WPA RADIUS, RADIUS, WEP¤Ê¤É¡¢Â¿¤¯¤ÎÌµÀþLANÇ§¾ÚÊý¼°¤ÎÃæ¤«¤é¤òÁªÂò¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£Ç§¾Ú¡¦°Å¹æ²½¤ò¹Ô¤ï¤Ê¤¤¾ì¹ç¤Ï¡¢¡ÖÌµ¸ú¡×¤òÁªÂò¤·¤Þ¤¹¡£</dd>


				<dt>WPA Personal</dt>
				<dd>WPA(Wi-Fi Protected Access)¤Ë½àµò¤·¤¿ÌµÀþLANµ¡´ï¤ÎÇ§¾Ú¤ò¤ª¤³¤Ê¤¤¤Þ¤¹¡£¥¨¥¢¥¹¥Æ¡¼¥·¥ç¥ó¤ËÀßÄê¤·¤¿¶¦Í­¥­¡¼(Pre Shared Key)¤ÈÆ±¤¸¶¦Í­¥­¡¼¤ËÀßÄê¤µ¤ì¤¿ÌµÀþLAN¥Ñ¥½¥³¥ó¤Î¤ß¤¬ÄÌ¿®¤Ç¤­¤Þ¤¹¡£¤Þ¤¿¡¢°Å¹æ²½Êý¼°¤ò¡ÖTKIP¡×¡ÖAES¡×¤ÎÃæ¤«¤éÁªÂò¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£TKIP¤Ï¡¢WEPÊý¼°¤ò¥Ù¡¼¥¹¤Ë¡¢ÂÑ¥»¥­¥å¥ê¥Æ¥£À­Ç½¤ò¶¯²½¤·¤¿°Å¹æÄÌ¿®Êý¼°¤Ç¤¹¡£AES¤Ï¡¢°Å¹æ²½¤Ë¶¯ÎÏ¤Ê¥¢¥ë¥´¥ê¥º¥à¤òÍøÍÑ¤·¤¿°Å¹æÄÌ¿®Êý¼°¤Ç¤¹¡£<br /><br />
					WPA Personal¤òÁªÂò¤¹¤ë¾ì¹ç¤Ï¡¢<i>WPA¶¦Í­¥­¡¼</i>¤òÆþÎÏ¤¹¤ëÉ¬Í×¤¬¤¢¤ê¤Þ¤¹¡£¶¦Í­¥­¡¼¤Ï8¡Á63Ê¸»ú¤ÎÇ¤°Õ¤Îµ­¹æ(&#035;, &#058;¤Ê¤É¤ò½ü¤¯)¤òÀßÄê¤¹¤ëÉ¬Í×¤¬¤¢¤ê¤Þ¤¹¡£Key¹¹¿·´Ö³Ö¤Ï¡¢0¡Á99,999(ÉÃ)¤ÎÈÏ°ÏÆâ¤ÇÀßÄê¤·¤Æ¤¯¤À¤µ¤¤¡£</dd>
				<dt>WPA Enterprise</dt>
				<dd>WPA Enterprise¤Ï¡¢¥æ¡¼¥¶Ç§¾Ú¤ËRADIUS¥µ¡¼¥Ð¤òÍÑ¤¤¤¿ÌµÀþLANÇ§¾Ú¤Ç¤¹¡£¡ÖRADIUSÇ§¾Ú¥µ¡¼¥Ð¡×¤Ë¤Ï¥µ¡¼¥Ð¤ÎIP¥¢¥É¥ì¥¹¤ò¡¢¡ÖRADIUS Shared secret¡×¤Ë¤Ï¡¢¥µ¡¼¥Ð¤ËÀßÄê¤¹¤ë¤â¤Î¤ÈÆ±¤¸¶¦Í­¸°¤òÀßÄê¤¹¤ëÉ¬Í×¤¬¤¢¤ê¤Þ¤¹¡£¡ÖRADIUSÇ§¾Ú¥µ¡¼¥Ð¥Ý¡¼¥È¡×¤Ë¤Ä¤¤¤Æ¤Ï¡¢¤Û¤È¤ó¤É¤Î¾ì¹ç½é´üÃÍ(1812)¤ÇÌäÂê¤¢¤ê¤Þ¤»¤ó¡£</dd>
				<dt>WPA2 Only</dt>
				<dd>WPA2¤Ï¡¢WPA½àµò¤ÎÇ§¾ÚÊý¼°¤Ë²Ã¤¨¡¢IEEE802.11i¤Ë´ð¤Å¤¯ÄÉ²Ã¥ª¥×¥·¥ç¥ó¤ò²Ã¤¨¤¿¼Ô¤Ç¤¹¡£¤³¤ÎÊý¼°¤ò»ÈÍÑ¤¹¤ë¤¿¤á¤Ë¤Ï¡¢WPA2Ç§¾ÚÊý¼°¤ËÂÐ±þ¤·¤¿¥¯¥é¥¤¥¢¥ó¥È¤¬É¬Í×¤Ç¤¹¡£Ã¢¤·¡¢WPA2¤ÈTKIP¤ÎÁÈ¤ß¹ç¤ï¤»¤Ï¥µ¥Ý¡¼¥È¤µ¤ì¤Æ¤¤¤Þ¤»¤ó¡£¤Þ¤¿¡¢WDS¤ÈÆ±»þ¤Ë»ÈÍÑ¤¹¤ë¤³¤È¤Ï¤Ç¤­¤Þ¤»¤ó¡£</dd>
				<dt>WPA2 Mixed</dt>
				<dd>WPA2ÂÐ±þ¤Î¥¯¥é¥¤¥¢¥ó¥È¡¢WPAÂÐ±þ¤Î¥¯¥é¥¤¥¢¥ó¥È¤òÆ±»þ¤Ë±¿ÍÑ¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£¡ÖWPA¥¢¥ë¥´¥ê¥º¥à¡×¤Ë¡ÖTKIP+AES¡×¤òÁªÂò¤¹¤ë¤³¤È¤Ë¤è¤Ã¤Æ¡¢¤è¤êÂ¿¤¯¤ÎWPA/WPA2¥¯¥é¥¤¥¢¥ó¥È¤òÆ±»þ¤Ë¥µ¥Ý¡¼¥È¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£</dd>
				<dt>RADIUS</dt>
				<dd>¤³¤ÎÇ§¾ÚÊý¼°¤Ï¥æ¡¼¥¶Ç§¾Ú¤ËIEEE802.1X/EAP¤ò¡¢°Å¹æ²½¤Ë¤ÏWEP¤òÍøÍÑ¤¹¤ëÇ§¾ÚÊý¼°¤Ç¤¹¡£¤³¤ÎÇ§¾ÚÊý¼°¤ò»ÈÍÑ¤¹¤ë¤¿¤á¤Ë¤Ï¡¢RADIUSÇ§¾Ú¥µ¡¼¥Ð¤ÎIP¥¢¥É¥ì¥¹¤ÈUDP¥Ý¡¼¥È¡¢Shared Secret¤ÎÆþÎÏ¤¬É¬Í×¤È¤Ê¤ê¤Þ¤¹¡£</dd>
				<dt>WEP</dt>


				<dd>WEP¤ò»ÈÍÑ¤¹¤ë¾ì¹ç¤Ï¡¢KeyÄ¹¤ò¡Ö64bits¡×¡Ö128bits¡×¤Î¤Ê¤«¤«¤éÀßÄê¤¹¤ëÉ¬Í×¤¬¤¢¤ê¤Þ¤¹¡£¡Ö°Å¹æ²½¡×¤ÎÃæ¤«¤éKeyÄ¹¤òÁªÂò¤·¡¢4¤Ä¤Î¥¹¥í¥Ã¥È(¥­¡¼1¡Á¥­¡¼4)¤ËÂÐ¤·¡¢ASCIIÊ¸»úÎó¤â¤·¤¯¤Ï16¿Ê¿ô¤ÇÆþÎÏ¤¹¤ëÉ¬Í×¤¬¤¢¤ê¤Þ¤¹¡£16¿Ê¿ô¤Ï0¡Á9¤Î¿ô»ú¤ÈA¡ÁF(¤â¤·¤¯¤Ïa¡Áf)¤¤¤º¤ì¤«¤ÎÊ¸»ú¤ò»ÈÍÑ¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£<br /><br />
					WEP¥­¡¼¤Ï¥»¥­¥å¥ê¥Æ¥£¾å¤ÎÍýÍ³¤«¤é¤¢¤Þ¤ê¿ä¾©¤µ¤ì¤Þ¤»¤ó¡£²ÄÇ½¤Ç¤¢¤ì¤ÐWPA¤ò»ÈÍÑ¤¹¤ë¤³¤È¤ò¿ä¾©¤·¤Þ¤¹¡£</dd>

				<dd>ÀßÄêÃÍ¤òÊÝÂ¸¤¹¤ë¾ì¹ç¤Ï¡ÖÀßÄê¡×¥Ü¥¿¥ó¤ò¥¯¥ê¥Ã¥¯¤·¤Æ¤¯¤À¤µ¤¤¡£ÀßÄêÆâÍÆ¤òÇË´þ¤¹¤ë¾ì¹ç¤Ï¡Ö¥­¥ã¥ó¥»¥ë¡×¥Ü¥¿¥ó¤ò¥¯¥ê¥Ã¥¯¤·¤Æ¤¯¤À¤µ¤¤¡£</dd>

			</dl>
		</div>
		<div class="also">
			<h4><% tran("share.seealso"); %></h4>
			<ul>
				<li><a href="HWireless.asp">´ðËÜ(ÌµÀþLAN)</a></li>
				<li><a href="Hradauth.asp">RADIUS</a></li>
				<li><a href="HWirelessMAC.asp">MAC¥¢¥É¥ì¥¹¥Õ¥£¥ë¥¿</a></li>
				<li><a href="HWirelessAdvanced.asp">¾ÜºÙ(ÌµÀþLAN)</a></li>
			</ul>
		</div>
	</body>
</html>
