Repository: mirror/dd-wrt
Catalog: src/router/dnsmasq/po/*.po
Languages: pl

source: failed to load names from %s: %m
pl: b³±d ³adowania nazw z %s: %m

source: bad name at %s line %d
pl: b³êdna nazwa w %s, linia %d

source: read %s - %d addresses
pl: przeczytano %s - %d adresów

source: cleared cache
pl: wyczyszczono cache

source: not giving name %s to the DHCP lease of %s because the name exists in %s with address %s
pl: nazwa %s nie zosta³a nadana dzier¿awie DHCP %s, poniewa¿ nazwa istnieje w %s i ma adres %s

source: could not get memory
pl: nie mo¿na pobraæ pamiêci

source: %s at line %d of %%s
pl: %s w linii %d z %%s

source: FAILED to start up
pl: B£¡D uruchomienia

source: infinite
pl: nieskoñczona

source: Specify local address(es) to listen on.
pl: Adres(y) lokalne do nas³uchiwania.

source: Return ipaddr for all hosts in specified domains.
pl: Zwracanie adresu IP dla wszystkich hostów w podanych domenach.

source: Fake reverse lookups for RFC1918 private address ranges.
pl: Symulacja reverse lookups dla adresów prywatnych opisanych w RFC1918.

source: Treat ipaddr as NXDOMAIN (defeats Verisign wildcard).
pl: Adres IP traktowany jak NXDOMAIN

source: Specify the size of the cache in entries (defaults to %s).
pl: Wielko¶æ pamiêci cache we wpisach (domy¶lna: %s)

source: Specify configuration file (defaults to %s).
pl: ¦cie¿ka do pliku konfiguracyjnego (domy¶lna: %s)

source: Do NOT fork into the background: run in debug mode.
pl: NIE twórz procesu potomnego w tle: dzia³anie w trybie debugowania.

source: Do NOT forward queries with no domain part.
pl: Wy³±czenie przekazywania zapytañ bez czê¶ci domenowej.

source: Return self-pointing MX records for local hosts.
pl: Zwracanie samowskazuj±cego rekordu MX dla lokalnych hostów.

source: Expand simple names in /etc/hosts with domain-suffix.
pl: Rozwijanie prostych nazw z /etc/hosts przyrostkiem domenowym.

source: Don't forward spurious DNS requests from Windows hosts.
pl: Wy³±czenie przekazywania pozornych zapytañ DNS z komputerów Windows

source: Enable DHCP in the range given with lease duration.
pl: Enable DHCP w zakresie okre¶lonym czasem dzier¿awy.

source: Change to this group after startup (defaults to %s).
pl: Po starcie zmiana grupy procesu na podan± (domy¶lnie: %s).

source: Set address or hostname for a specified machine.
pl: Ustawienie adresu lub nazwy hosta dla okre¶lonej maszyny.

source: Do NOT load %s file.
pl: Ignorowanie pliku %s.

source: Specify a hosts file to be read in addition to %s.
pl: Dodatkowy plik hostów poza %s.

source: Specify interface(s) to listen on.
pl: Interfejs(y) do nas³uchiwania.

source: Specify interface(s) NOT to listen on.
pl: Interfejs(y), na których nie nas³uchiwaæ.

source: Map DHCP user class to option set.
pl: W³±czenie mapowania klasy u¿ytkownika DHCP do option set.

source: Don't do DHCP for hosts in option set.
pl: Wy³±czenie odpowiadania na ¿adania DHCP hostów okre¶lonych w option set

source: Do NOT fork into the background, do NOT run in debug mode.
pl: Wy³±czenie tworzenia procesu potomnego w tle, wy³±czenie dzia³ania w trybie debug.

source: Assume we are the only DHCP server on the local network.
pl: Za³o¿enie, ¿e jeste¶my jedynym serwerem DHCP w sieci lokalnej.

source: Specify where to store DHCP leases (defaults to %s).
pl: ¦cie¿ka przechowywania pliku dzier¿aw DHCP (domy¶lna: %s)

source: Return MX records for local hosts.
pl: W³±czenie zwracania rekord MX dla hostów lokalnych.

source: Specify an MX record.
pl: Specyfikacja rekordu MX.

source: Specify BOOTP options to DHCP server.
pl: Okre¶lenie opcji BOOTP serwera DHCP.

source: Do NOT poll %s file, reload only on SIGHUP.
pl: Wy³aczenie analizy pliku %s, ponownie ³adowanie tylko po otrzymaniu sygna³u HUP

source: Do NOT cache failed search results.
pl: Wy³±czenie zapisywania w pamiêci podrêcznej nieudanych wyników wyszukiwania.

source: Use nameservers strictly in the order given in %s.
pl: W³±czenie u¿ywania serwerów nazw w kolejno¶ci podanej w %s.

source: Set extra options to be set to DHCP clients.
pl: Dodatkowe opcje ustawieñ dla klientów DHCP.

source: Specify port to listen for DNS requests on (defaults to 53).
pl: Port nas³uchiwania zapytañ DNS (domy¶lnie: 53).

source: Maximum supported UDP packet size for EDNS.0 (defaults to %s).
pl: Maksymalna obs³ugiwana wielko¶æ pakietu EDNS.0 (domy¶lnie: %s).

source: Log queries.
pl: Zapytania zapisywane w pliku log.

source: Do NOT read resolv.conf.
pl: Wy³±czenie czytania pliku resolv.conf

source: Specify path to resolv.conf (defaults to %s).
pl: Podaj ¶cie¿kê do pliku resolv.conf (domy¶lnie: %s).

source: Never forward queries to specified domains.
pl: Wy³±czenie przekazywania zapytañ do okre¶lonych domen.

source: Specify the domain to be assigned in DHCP leases.
pl: Nazwa domeny, która bêdzie przypisana w dzier¿awach DHCP.

source: Specify default target in an MX record.
pl: Okre¶lenie domy¶lnego celu w rekordzie MX.

source: Specify time-to-live in seconds for replies from /etc/hosts.
pl: Okre¶lenie czasu wa¿no¶ci (time-to-live) w sekundach odpowiedzi branych z /etc/hosts.

source: Change to this user after startup. (defaults to %s).
pl: Po starcie zmiana u¿ytkownika procesu na podanego. (domy¶lnie: %s).

source: Map DHCP vendor class to option set.
pl: Mapowanie nazwy dystrybutora DHCP do ustawieñ opcji.

source: Display dnsmasq version and copyright information.
pl: W³±czenie pokazywania wersji dnsmasq i informacji o ochronie praw autorskich.

source: Specify a SRV record.
pl: Okre¶lenie rekordu SRV.

source: Display this message.
pl: Wy¶wietlenie tych informacji.

source: Specify path of PID file. (defaults to %s).
pl: Okre¶lenie ¶cie¿ki do pliku PID. (domy¶lnie: %s).

source: Specify maximum number of DHCP leases (defaults to %s).
pl: Maksymalna liczba dzier¿aw DHCP. (domy¶lnie: %s).

source: Answer DNS queries based on the interface a query was sent to.
pl: Odpowiedzi na zapytania DNS uzale¿nione od interfejsu, który odebra³ zapytanie.

source: Specify TXT DNS record.
pl: Rekord TXT DNS.

source: Bind only to interfaces in use.
pl: W³±czenie nas³uchiwania tylko na u¿ywanych interfejsach.

source: Read DHCP static host information from %s.
pl: Statycznych informacji DHCP hosta z pliku %s.

source: Do not provide DHCP on this interface, only provide DNS.
pl: Wy³±czenie DHCP na tym interfejsie, w³±czenie tylko DNS.

source: Enable dynamic address allocation for bootp.
pl: W³±czenie automatycznej alokacji adresu dla BOOTP.

source: Usage: dnsmasq [options]
pl: U¿ycie: dnsmasq [opcje]

source: Use short options only on the command line.
pl: Tylko krótkie opcje w linii komend.

source: Valid options are :
pl: Obs³ugiwane opcje:

source: extraneous parameter
pl: dodatkowy parametr

source: missing parameter
pl: brak parametru

source: bad MX name
pl: b³êdna nazwa MX

source: bad MX target
pl: b³êdny cel MX

source: bad port
pl: nieprawid³owy port

source: bad dhcp-range
pl: nieprawid³owy zakres dhcp-range

source: inconsistent DHCP range
pl: niespójny zakres DHCP

source: bad dhcp-host
pl: b³±d w dhcp-host

source: bad dhcp-option
pl: b³±d w dhcp-option

source: bad domain in dhcp-option
pl: nieprawid³owa nazwa domeny w dhcp-option

source: dhcp-option too long
pl: zbyt d³uga nazwa w dhcp-option

source: bad TXT record
pl: nieprawid³owy rekord TX

source: TXT record string too long
pl: zbyt d³ugi rekord TXT

source: bad SRV record
pl: b³±d w rekordzie SRV

source: bad SRV target
pl: nieprawid³owy cel SRV

source: invalid port number
pl: nieprawid³owy port

source: invalid priority
pl: nieprawid³owy priorytet

source: invalid weight
pl: nieprawid³owe znaczenie

source: cannot read %s: %s
pl: b³±d odczytu z %s: %s

source: missing "
pl: brakuje "

source: error
pl: b³±d

source: bad option
pl: nieprawid³owa opcja

source: Dnsmasq version %s %s
pl: Dnsmasq, wersja %s %s

source: Compile time options %s
pl: Wkompilowane opcje %s

source: This software comes with ABSOLUTELY NO WARRANTY.
pl: Oprogramowanie to nie zawiera ¿adnych gwarancji.

source: Dnsmasq is free software, and you are welcome to redistribute it
pl: Dnsmasq jest wolnym oprogramowaniem, mo¿esz je rozprowadzaæ

source: under the terms of the GNU General Public License, version 2.
pl: na warunkach okre¶lonych w GNU General Public Licence, wersja 2.

source: cannot get host-name: %s
pl: nie mo¿na pobraæ nazwy hosta: %s

source: only one resolv.conf file allowed in no-poll mode.
pl: tylko jeden plik resolv.conf jest dopuszczany w trybie no-poll.

source: must have exactly one resolv.conf to read domain from.
pl: musisz mieæ dok³adnie jeden plik resolv.conf do odczytu domen.

source: failed to read %s: %m
pl: b³±d w odczycie %s: %m

source: no search directive found in %s
pl: brak wytycznych wyszukiwania w %s

source: nameserver %s refused to do a recursive query
pl: serwer nazw %s odmawia wykonania zapytania rekursywnego

source: forwarding table overflow: check for server loops.
pl: przekroczenie zakresu tablicy przekazywania: sprawd¼ zapêtlenie serwera.

source: failed to access %s: %m
pl: b³±d w dostêpie do %s: %m

source: failed to load %s: %m
pl: b³±d ³adowania %s: %m

source: reading %s
pl: czytanie %s

source: bad name in %s
pl: nieprawid³owa nazwa w %s

source: Ignoring DHCP lease for %s because it has an illegal domain part
pl: Ignorujê dzier¿awy DHCP dla %s poniewa¿ zawieraj± nieprawid³ow± czê¶æ domenow±

source: failed to create listening socket: %s
pl: b³±d podczas tworzenia gniazda: %s

source: failed to set IPV6 options on listening socket: %s
pl: b³±d ustawienia opcji IPV6 na nas³uchuj±cym gnie¼dzie: %s

source: failed to bind listening socket for %s: %s
pl: b³±d pod³±czenia nas³uchuj±cego gniazda dla %s: %s

source: failed to listen on socket: %s
pl: b³±d w³±czenia nas³uchiwania gniazda: %s

source: ignoring nameserver %s - local interface
pl: ignorowanie serwera nazw %s - interfejs lokalny

source: ignoring nameserver %s - cannot make/bind socket: %m
pl: ignorowanie serwera nazw %s - nie mo¿na utworzyæ/dowi±zaæ gniazda: %m

source: domain
pl: domena

source: unqualified
pl: niekwalifikowany(a/e)

source: domains
pl: domeny

source: using local addresses only for %s %s
pl: w³±czenie u¿ywania lokalnych adresów tylko dla %s %s

source: using nameserver %s#%d for %s %s
pl: u¿ywany serwer nazw: %s#%d dla %s %s

source: using nameserver %s#%d
pl: u¿ywany serwer nazw %s#%d

source: ISC dhcpd integration not available: set HAVE_ISC_READER in src/config.h
pl: Intergracja z ISC dhcpd nie jest dostêpna: ustaw HAVE_ISC_READER w src/config.h

source: failed to find list of interfaces: %s
pl: b³±d w znalezieniu listy interfejsów sieciowych: %s

source: unknown interface %s
pl: nieznany interfejs %s

source: no interface with address %s
pl: brak interfejsu z adresem %s

source: must set exactly one interface on broken systems without IP_RECVIF
pl: musisz ustawiæ dok³adnie jeden interfejs w systemach bez IP_RECVIF

source: DBus error: %s
pl: b³±d DBus: %s

source: DBus not available: set HAVE_DBUS in src/config.h
pl: DBus jest niedostêpny: ustaw HAVE_DBUS w src/config.h

source: started, version %s cachesize %d
pl: uruchomiony, wersja %s wielko¶æ cache %d

source: started, version %s cache disabled
pl: uruchomiony, wersja %s cache wy³±czony

source: compile time options: %s
pl: opcje kompilacji: %s

source: DBus support enabled: connected to system bus
pl: obs³uga DBus w³±czona: pod³±czono do szyny systemowej

source: DBus support enabled: bus connection pending
pl: obs³uga DBus w³±czona: pod³±czanie do szyny systemowej w toku

source: setting --bind-interfaces option because of OS limitations
pl: ustawiam opcjê --bind-interfaces z powodu limitów systemu operacyjnego

source: warning: interface %s does not currently exist
pl: ostrze¿enie: interfejs %s obecnie nie istnieje

source: DHCP, static leases only on %.0s%s, lease time %s
pl: DHCP, statyczne dzier¿awy tylko na %.0s%s, czas dzier¿awy %s

source: DHCP, IP range %s -- %s, lease time %s
pl: DHCP, zakres IP %s -- %s, czas dzier¿awy %s

source: running as root
pl: pracuje z uprawnieniami u¿ytkownika root

source: exiting on receipt of SIGTERM
pl: wy³±czenie po otrzymaniu sygnalu SIGTERM

source: connected to system DBus
pl: po³±czono do systemowego DBus

source: cannot create DHCP socket : %s
pl: nie mo¿na utworzyæ gniazda DHCP : %s

source: failed to set options on DHCP socket: %s
pl: b³±d ustawienia opcji gniazda DHCP: %s

source: failed to set SO_REUSEADDR on DHCP socket: %s
pl: b³±d ustawienia SO_REUSEADDR gniazda DHCP: %s

source: failed to bind DHCP server socket: %s
pl: b³±d pod³±czenia gniazda serwera DHCP: %s

source: cannot create ICMP raw socket: %s.
pl: b³±d utworzenia surowego gniazda ICMP: %s.

source: duplicate IP address %s in dhcp-config directive.
pl: powtórzenie adresu IP %s w opcji dhcp-config

source: DHCP range %s -- %s is not consistent with netmask %s
pl: zakres DHCP %s -- %s jest niespójny z mask± sieciow± %s

source: failed to read %s:%m
pl: b³±d odczytu %s:%m

source: duplicate IP address %s (%s) in dhcp-config directive
pl: powtórzenie adresu IP %s (%s) w opcji dhcp-config

source: Ignoring DHCP host name %s because it has an illegal domain part
pl: Ignorujê nazwê hosta DHCP %s, poniewa¿ posiada nieprawid³ow± czê¶æ domenow±

source: cannot open or create leases file: %s
pl: b³±d otwarcia lub utworzenia pliku dzier¿aw: %s

source: too many stored leases
pl: zbyt du¿a ilo¶æ zapisanych dzier¿aw

source: no address range available for DHCP request %s %s
pl: ¿aden zakres adresowy nie jest dostêpny dla ¿adania DHCP %s %s

source: with subnet selector
pl: z selekcj± podsieci

source: via
pl: przez

source: disabled
pl: wy³±czony(a)

source: address in use
pl: adres w u¿yciu

source: no address configured
pl: brak skonfigurowanego adresu

source: no address available
pl: brak dostêpnego adresu

source: no leases left
pl: brak wolnych dzier¿aw

source: wrong network
pl: nieprawid³owa sieæ

source: unknown lease
pl: nieznana dzier¿awa

source: ignored
pl: ignorujê

source: wrong address
pl: b³êdny adres

source: lease not found
pl: dzier¿awa nie znaleziona

source: address not available
pl: adres niedostêpny

source: static lease available
pl: dostêpna statyczna dzier¿awa

source: address reserved
pl: adres zarezerwowany

source: More than one vendor class matches, using %s
pl: Wiêcej ni¿ jeden dystrybutor pasuj±cy, u¿ywam %s

source: attempt to set an IPv6 server address via DBus - no IPv6 support
pl: próba ustawienia adresu IPv6 serwera przez DBus - brak obs³ugi IPv6

source: could not register a DBus message handler
pl: nie mo¿na zarejestrowaæ uchwytu wiadomo¶ci DBus

source: cannot create DHCP BPF socket: %s
pl: b³±d utworzenia gniazda DHCP BPF: %s
