//////////////////////////////////////////////////////////////////////////////////////////////
//		Russian reference translation file - DD-WRT V23 SP1 by Yuri Krasilnikov 28/11/2008	//
//////////////////////////////////////////////////////////////////////////////////////////////

// ** COMMON SHARE LABEL **//
lang_charset.set="utf-8";

share.annex="Тип Annex";
share.apn="Имя точки доступа";
share.pin="PIN";
share.dial="Номер набора";
share.mode_3g="Тип соединения";
share.mode_3g_auto="Авто 4G/3G/2G";
share.mode_3g_4g="Принудительно LTE/4G";
share.mode_3g_3g="Принудительно 3G";
share.mode_3g_2g="Принудительно 2G";
share.mode_3g_prefer_3g="Предпочтительно 3G";
share.mode_3g_prefer_2g="Предпочтительно 2G";
share.mode_3g_3g2g="Приоритет 3G, при ошибке 2G";
share.firmware="Прошивка";
share.time="Время";
share.interipaddr="IP-адрес WAN";
share.more="Ещё...";
share.help="Помощь";
share.enable="Включить";
share.enabled="Включено";
share.disable="Отключить";
share.disabled="Отключено";
share.usrname="Имя пользователя";
share.passwd="Пароль";
share.hostname="Имя хоста";
share.advanced="Дополнительные настройки";
share.vdsl="DTAG VDSL Vlan тегирование";
share.vdslvlan7="Поддержка T-Home VLAN 7";
share.vdslvlan8="Поддержка T-Home VLAN 8";
share.wan_vlantag="Тег Vlan";
share.compression="PPP-сжатие";
share.mlppp="Множественное соединение по одной линии";
share.vpi_vci="VPI/VCI";
share.encaps= "Инкапсуляция";
share.payload="Тип нагрузки";
share.domainname="Имя домена";
share.wandomainname="Имя домена WAN";
share.landomainname="Имя домена LAN";
share.statu="Состояние";
share.start="Начальный";
share.end="Конечный";
share.proto="Протокол";
share.ip="IP-адрес";
share.mac="MAC-адрес";
share.none="Нет";
share.none2="нет";
share.both="Оба";
share.del="Удалить";
share.remove="Удалить";
share.descr="Описание";
share.from="От";
share.to="До";
share.from2="Из";  // This is share.from variable for page NAT-QoS/UPnP
share.to2="В";  // This is share.to variable for page NAT-QoS/UPnP
share.about="про";
share.everyday="Ежедневно";
share.sun="Воскресенье";
share.sun_s="Вс";
share.sun_s1="Вс";
share.mon="Понедельник";
share.mon_s="Пн";
share.mon_s1="Пн";
share.tue="Вторник";
share.tue_s="Вт";
share.tue_s1="Вт";
share.wed="Среда";
share.wed_s="Ср";
share.wed_s1="Ср";
share.thu="Четверг";
share.thu_s="Чт";
share.thu_s1="Чт";
share.fri="Пятница";
share.fri_s="Пт";
share.fri_s1="Пт";
share.sat="Суббота";
share.sat_s="Сб";
share.sat_s1="Сб";
share.jan="Январь";
share.feb="Февраль";
share.mar="Март";
share.apr="Апрель";
share.may="Май";
share.jun="Июнь";
share.jul="Июль";
share.aug="Август";
share.sep="Сентябрь";
share.oct="Октябрь";
share.nov="Ноябрь";
share.dec="Декабрь";
share.expires="Истекает";
share.yes="Да";
share.no="Нет";
share.filter="Фильтровать";
share.deny="Запретить";
share.range="Диапазон";
share.use="Использовать";
share.mins="мин";
share.secs="с";
share.routername="Имя маршрутизатора";
share.manual="Вручную";
share.port="Порт";
share.ssid="SSID";
share.channel="Канал";
share.frequency="Частота";
share.rssi="Rssi";
share.signal="Сигнал";
share.noise="Шум";
share.beacon="Маяк";
share.openn="Открыто";
share.dtim="dtim";
share.rates="Скорость";
share.rate="Скорость";
share.txrate="Скорость передачи";
share.rxrate="Скорость приема";
share.low="Низкий";
share.medium="Средний";
share.high="Высокий";
share.option="Опция";
share.rule="Правило";
share.lan="LAN";
share.point2point="Точка-точка";
share.nat="NAT";
share.subnet="Маска подсети";
share.unmask="Не скрывать";
share.deflt="По умолчанию";  //don't use share.default!!!
share.all="Все";
share.auto="Авто";
share.right="Правая";
share.left="Левая";
share.share_key="Общий ключ";
share.inter="Интервал (в секундах)";
share.srv="Имя службы";
share.port_range="Диапазон портов";
share.priority="Приоритет";
share.gateway="Шлюз";
share.intrface="Интерфейс";  //don't use share.interface, Mozilla problem!!!
share.ccq="CCQ";
share.pintrface="Физический интерфейс";
share.vintrface="Виртуальный интерфейс";
share.router="Маршрутизатор";
share.static_lease="Статические назначения";
share.srvip="IP сервера";
share.srvipname="IP/Имя сервера";
share.localdns="Локальный DNS";
share.minutes="минут";
share.oui="Поиск OUI";
share.sttic="Статический";
share.connecting="Подключаюсь";
share.connect="Подключить";
share.connected="Подключено";
share.disconnect="Отключить";
share.disconnected="Отключено";
share.info="Информация";
share.state="Состояние";
share.mode="Тип";
share.encrypt="Шифрование";
share.key="Ключ";
share.wireless="Беспроводная сеть";
share.dhcp="DHCP";
share.styl="Стиль";
share.err="ошибок";
share.errs="ошибок";
share.meters="метров";
share.ht40="Широкий HT40 (20+20 МГц)";
share.ht20="Полный HT20 (20 МГц)";
share.dynamicturbo="Динамический (20/40 МГц)";
share.turbo="Турбо (40 МГц)";
share.full="Полная (20 МГц)";
share.half="Половина (10 МГц)";
share.quarter="Четверть (5 МГц)";
share.subquarter="Восьмой (2.5 МГц)";
share.seealso="См. также";
share.never="никогда";
share.unknown="Неизвестно";
share.expired="срок истек";
share.logout="выход";
share.nmounted="Не смонтировано";
share.fssize="Всего / Свободно";
share.src="Адрес источника";
share.dst="Адрес назначения";
share.name_resolution="Разрешение имени";
share.timeout="Таймаут (с)";
share.detail="Щелкните, чтобы увидеть подробности";
share.tmpmem="Временная память";
share._1h="Каждый час";
share._2h="Каждые 2 часа";
share._3h="Каждые 3 часа";
share._4h="Каждые 4 часа";
share._5h="Каждые 5 часов";
share._6h="Каждые 6 часов";
share._12h="Каждые 12 часов";
share._24h="Каждый день";
share._48h="Каждые 2 дня";
share._168h="Каждую неделю";
share.days="Дни";
share.days_genetive="Дней";  // This is share.days for page Setup/DDNS
share.standard="Стандартный";
share.execscript="Выполнить скрипт";
share.user="Пользователь";
share.privatekey="Приватный ключ";
share.bytes="Байт";
share.kbytes="КБайт";
share.mbytes="МБайт";
share.gbytes="ГБайт";
share.preempt="Приоритетн.прерывание";
share.acktiming="Время ожидания ACK";
share.broadcast="Поддержка широковещания";
share.secondcharacter="s";
share.change="Смена пользовательского пароля";

sbutton.save="Сохранить";
sbutton.savetitle="Сохранить, но не применять";
sbutton.apply="Применить";
sbutton.applytitle="Применить немедленно";
sbutton.saving="Сохранено";
sbutton.cmd="Выполнить";
sbutton.cancel="Отмена";
sbutton.canceltitle="Отмена только для этой формы";
sbutton.refres="Обновить";
sbutton.clos="Закрыть";
sbutton.del="Удалить";
sbutton.continu="Продолжить";
sbutton.add="Добавить";
sbutton.remove="Удалить";
sbutton.modify="Изменить";
sbutton.deleted="Удалено";
sbutton.delall="Удалить всё";
sbutton.autorefresh="Автообновление включено";
sbutton.backup="Сохранить";
sbutton.restore="Восстановить";
sbutton.cptotext="Редактировать";
sbutton.runcmd="Выполнить команды";
sbutton.startup="Сохр. параметры запуска";
sbutton.shutdown="Сохр. параметры отключ.";
sbutton.firewall="Сохр. брандмауэр";
sbutton.custom="Сохр. скрипт";
sbutton.wol="Разбудить";
sbutton.add_wol="Добавить хост";
sbutton.manual_wol="Разбудить вручную";
sbutton.summary="Сводка";
sbutton.filterIP="Редактировать список клиентов";
sbutton.filterMac="Редактировать список MAC-фильтра";
sbutton.filterSer="Добавить/редактировать службу";
sbutton.reboot="Перезагрузить маршрутизатор";
sbutton.help="   Помощь  ";
sbutton.wl_client_mac="Список MAC беспроводных клиентов";
sbutton.update_filter="Обновить список фильтра";
sbutton.join="Присоединить";
sbutton.log_in="Журнал входящих";
sbutton.log_out="Журнал исходящих";
sbutton.edit_srv="Добавить/редактировать службу";
sbutton.routingtab="Показать таблицу маршрутизации";
sbutton.wanmac="Использовать MAC-адрес данного компьютера";
sbutton.dhcprel="Высвободить DHCP";
sbutton.dhcpren="Обновить DHCP";
sbutton.survey="Обзор Wi-Fi сетей";
sbutton.upgrading="Обновляется";
sbutton.upgrade="Обновить";	
sbutton.preview="Предварительный просмотр";
sbutton.allways_on="Всегда включено";
sbutton.allways_off="Всегда выключено";
sbutton.download="Скачать";
sbutton.next="Далее &raquo;";
sbutton.prev="&laquo; Назад";


// ** COMMON ERROR MESSAGES  **//
errmsg.err0="Вы должны ввести имя пользователя.";
errmsg.err1="Вы должны ввести имя маршрутизатора.";
errmsg.err2="Выход за пределы, исправьте начальный IP-адрес или число пользователей.";
errmsg.err3="Вы должны выбрать как минимум один день.";
errmsg.err4="Время окончания должно быть больше, чем время начала.";
errmsg.err5="Неверная длина MAC-адреса.";
errmsg.err6="Вы должны ввести пароль.";
errmsg.err7="Вы должны ввести имя хоста.";
errmsg.err8="Вы должны ввести IP-адрес или имя домена.";
errmsg.err9="Неверный IP-адрес DMZ.";
errmsg.err10="Пароль и его подтверждение не совпадают. Пожалуйста, введите пароль заново.";
errmsg.err11="Пробелы в пароле не разрешены.";
errmsg.err12="Вы должны ввести команду.";
errmsg.err13="Обновление завершилось неуспешно.";
errmsg.err45="Недоступно по HTTPS! Пожалуйста, подключитесь по HTTP.";
errmsg.err46="Недоступно по HTTPS";

//common.js error messages
errmsg.err14=" - значение вне допустимых пределов [";
errmsg.err15="MAC-адрес WAN вне допустимых пределов [00 - ff].";
errmsg.err16="Второй символ MAC-адреса должен быть четным: [0, 2, 4, 6, 8, A, C, E].";
errmsg.err17="Некорректный MAC-адрес.";
errmsg.err18="Некорректная длина MAC-адреса.";
errmsg.err19="MAC-адрес не может быть широковещательным.";
errmsg.err20="Введите MAC-адрес в формате (xx:xx:xx:xx:xx:xx).";
errmsg.err21="Неверный формат MAC-адреса.";
errmsg.err22="Некорректный MAC-адрес WAN.";
errmsg.err23="Неверное шестнадцатеричное значение ";
errmsg.err24=" найдено в MAC-адресе ";
errmsg.err25="Некорректное значение ключа.";
errmsg.err26="Некорректная длина ключа.";
errmsg.err27="Недопустимая маска подсети.";
errmsg.err28=" содержит недопустимые символы вне диапазона [ 0 - 9 ].";
errmsg.err29=" содержит недопустимые коды ASCII.";
errmsg.err30=" содержит недопустимые шестнадцатеричные цифры.";
errmsg.err31=" - значение недопустимо.";
errmsg.err32="IP-адрес и шлюз не находятся в одной подсети, заданной маской.";
errmsg.err33="IP-адрес и шлюз не могут совпадать.";
errmsg.err34=" - недопустимый пробел.";
errmsg.err110="Конечное значение должно быть больше начального";
errmsg.err111="Неверный IP адрес";
errmsg.err112="Неверное значение \"<invchars>\" в поле \"<fieldname>\"";

//Wol.asp error messages
errmsg.err35="Вы должны ввести MAC-адрес.";
errmsg.err36="Вы должны ввести сетевой широковещательный адрес.";
errmsg.err37="Вы должны ввести номер порта UDP.";

//WL_WPATable.asp error messages
//WPA.asp error messages
errmsg.err38="Пожалуйста, введите общий ключ!";
errmsg.err39="Неверный ключ – ключ должен содержать от 8 до 63 символов ASCII или 64 шестнадцатеричные цифры";
errmsg.err40="Вы должны ввести значение для ключа ";
errmsg.err41="Неверная длина ключа ";
errmsg.err43="Интервал смены ключа";

//config.asp error messages
errmsg.err42="Выберите файл для восстановления конфигурации.";

//WL_ActiveTable.asp error messages
errmsg.err44="Общее количество проверок превышает 128.";

//Site_Survey.asp error messages
errmsg.err47="неверный SSID.";

//Wireless_WDS.asp error messages
errmsg.err48="WDS несовместим с текущей конфигурацией маршрутизатора. Проверьте нижеследующие условия:\n * Должен быть установлен тип беспроводной сети &#39;Точка доступа&#39; \n * WPA2 не поддерживается в WDS \n * Режим беспроводной сети &#39;Только B&#39; не поддерживается в WDS";

//Wireless_radauth.asp error messages
errmsg.err49="Radius возможен только в режиме точки доступа.";

//Wireless_Basic.asp error messages
errmsg.err50="Вы должны ввести SSID.";

// Management.asp error messages
errmsg.err51="Текущий пароль маршрутизатора является паролем по умолчанию. В целях безопасности вам следует сменить пароль перед тем, как разрешить удаленное управление. Для смены пароля нажмите &#39;OK&#39;. Нажмите &#39;Отмена&#39; для отказа от включения удаленного управления.";
errmsg.err52="Строки в полях пароля и подтверждения пароля не совпадают.";

// Port_Services.asp error messages
errmsg.err53="По завершении всех действий нажмите кнопку &#39;Применить&#39;, чтобы сохранить настройки.";
errmsg.err54="Вы должны ввести имя службы.";
errmsg.err55="Данное имя службы уже существует.";

// QoS.asp error messages
errmsg.err56="Номер порта вне допустимых пределов [0 - 65535]";

// Routing.asp error messages
errmsg.err57="Удалить маршрут?";
errmsg.err103=" должно быть меньше чем ";

// Status_Lan.asp error messages
errmsg.err58="Нажмите для прекращения аренды адреса";
errmsg.err581="Нажмите для отсоединения клиента PPTP";

//Status_Wireless.asp error messages
errmsg.err59="Недоступно! Пожалуйста, включите беспроводную сеть.";

//Upgrade.asp error messages
errmsg.err60="Выберите файл прошивки для обновления.";
errmsg.err61="Неверный файл образа.";

//Services.asp error messages
errmsg.err62=" уже отдан в бессрочную аренду.";

//Saving message
errmsg.err100="Идет обработка...<br/>Пожалуйста, подождите.";
errmsg.err101="Восстановление конфигурации...<br/>Пожалуйста, подождите.";
errmsg.err102="Обновление прошивки...<br/>Пожалуйста, подождите.";

// **  COMMON MENU ENTRIES  **//
bmenu.setup="Настройка";
bmenu.setupbasic="Основные настройки";
bmenu.setupddns="DDNS";
bmenu.setupmacclone="Клонирование MAC";
bmenu.setuprouting="Маршрутизация";
bmenu.setupvlan="VLAN";
bmenu.setupeop="Туннель EoIP";
bmenu.networking="Сеть";

bmenu.wireless="Wi-Fi";
bmenu.wirelessBasic="Основные настройки";
bmenu.wirelessRadius="Radius";
bmenu.wirelessSuperchannel="Суперканал";
bmenu.wimax="WiMAX";
bmenu.wirelessSecurity="Безопасность";
bmenu.wirelessAoss="AOSS";
bmenu.wirelessAossWPS="AOSS / WPS";
bmenu.wirelessMac="MAC-фильтр";
bmenu.wirelessAdvanced="Дополнительно";
bmenu.wirelessAdvancedwl0="WL0-Доп. настройки";
bmenu.wirelessAdvancedwl1="WL1- Доп. настройки ";
bmenu.wirelessWds="WDS";
bmenu.wirelessWds0="Ath0-WDS";
bmenu.wirelessWds1="Ath1-WDS";
bmenu.wirelessWds2="Ath2-WDS";
bmenu.wirelessWds3="Ath3-WDS";
bmenu.wirelessWdswl0="WL0-WDS";
bmenu.wirelessWdswl1="WL1-WDS";

bmenu.security="Безопасность";
bmenu.firwall="Брандмауэр";
bmenu.vpn="Транзит VPN";

bmenu.accrestriction="Контроль доступа";
bmenu.webaccess="Доступ в Интернет";


bmenu.applications="NAT / QoS";
bmenu.applicationsprforwarding="Перенаправление групп портов";
bmenu.applicationspforwarding="Перенаправление портов";
bmenu.applicationsptriggering="Запуск портов";
bmenu.applicationsUpnp="UPnP";
bmenu.applicationsDMZ="DMZ";
bmenu.applicationsQoS="QoS";
bmenu.applicationsP2P="P2P";

bmenu.sipath="SIPatH";
bmenu.sipathoverview="Обзор";
bmenu.sipathphone="Телефонная книга";
bmenu.sipathstatus="Статус";

bmenu.admin="Администрирование";
bmenu.adminManagement="Система";
bmenu.adminAlive="Поддержка соединения";
bmenu.adminLog="Журнал";
bmenu.adminDiag="Команды";
bmenu.adminWol="WOL";
bmenu.adminFactory="Сброс";
bmenu.adminUpgrade="Обновление";
bmenu.adminBackup="Резервирование";

bmenu.services="Службы";
bmenu.servicesServices="Службы";
bmenu.servicesRadius="FreeRadius";
bmenu.servicesPppoesrv="Сервер PPPoE";
bmenu.servicesPptp="PPTP";
bmenu.servicesUSB="USB";
bmenu.servicesNAS="NAS";
bmenu.servicesHotspot="HotSpot";
bmenu.servicesMilkfish="Milkfish SIP";
bmenu.servicesPrivoxy="Блокировка рекламы";
bmenu.servicesLighttpd="Web-сервер";
//bmenu.servicesAnchorFree="Моя рекламная сеть";

bmenu.statu="Состояние";
bmenu.statuRouter="Маршрутизатор";
bmenu.statuInet="WAN";
bmenu.statuLAN="LAN";
bmenu.statuSputnik="Агент Sputnik";
bmenu.statuWLAN="WLAN";
bmenu.statuVPN="OpenVPN";
bmenu.statuBand="Загрузка сетей";
bmenu.statuSysInfo="Сведения о системе";
bmenu.statuActivate="Активация";
bmenu.statuMyPage="Моя Страница";
bmenu.statuGpio="GPIO I/O";
bmenu.statuSyslog="Syslog";

bmenu.setupnetw="Сеть";
bmenu.adminman="Система";

// ** Alive.asp **//
alive.titl="Поддержка соединения";
alive.h2="Поддержка соединения";
alive.legend="Плановая перезагрузка";
alive.sevr1="Плановая перезагрузка";
alive.hour="В заданное время";
alive.legend2=" Сторожевой таймер WDS/соединения";
alive.sevr2="Включить сторожевой таймер";
alive.IP="IP-адреса";
alive.legend3=" Сторожевой таймер прокси/соединения";
alive.sevr3="Включить сторожевой таймер для прокси";
alive.IP2="IP-адрес прокси";
alive.port="Порт прокси";

//help container
halive.right2="Задайте время перезагрузки маршрутизатора. На вкладке &#39;Система&#39; должен быть включен cron.";
halive.right4="Допускается максимум три IP-адреса, разделенных <em>ПРОБЕЛАМИ</em>.<br/>IP вводятся в формате xxx.xxx.xxx.xxx.";

//help page
halive.page1="<dd>Возможно установить перезапуск маршрутизатора по расписанию:<ul><li>Регулярно после xxx секунд.</li><li>В определенный день недели или ежедневно.</li></ul><br/><div class=\"note\"><h4>Примечание</h4><div>Для перезапуска в определенную дату должен быть активен Cron. Смотреть <a href=\"HManagement.asp\">Управление маршрутизатором</a> для активации Cron.</div></div></dd>";
halive.page2="<dd></dd><dd>Проверьте все значения и щелкните <em>Сохранить</em> для сохранения настроек. Щелкните <em>Отмена</em>, чтобы отменить несохраненные изменения.  Щелкните <em>Перегрузить маршрутизатор</em> для немедленного перезапуска устройства.</dd>";

// ** config.asp **//
config.titl="Сохранение и восстановление";
config.h2="Сохранение конфигурации";
config.legend="Параметры сохранения";
config.mess1="Нажмите кнопку \"" + sbutton.backup + "\" для сохранения файла конфигурации на вашем компьютере.";
config.h22="Восстановление конфигурации";
config.legend2="Параметры восстановления";
config.mess2="Выберите файл для восстановления";
config.mess3="П Р Е Д У П Р Е Ж Д Е Н И Е";
config.mess4="Восстанавливайте конфигурацию лишь из тех файлов, которые были получены в той же версии прошивки и для такой же модели маршрутизатора.<br />Не используйте файлы, которые были получены с помощью других прошивок!";

//help container
hconfig.right2="Вы можете сохранить текущую конфигурацию, если вам нужно сбросить установки маршрутизатора в их значения по умолчанию.<br /><br />Нажмите кнопку <em>Сохранить</em> для сохранения текущей конфигурации.";
hconfig.right4="Нажмите кнопку <em>Обзор...</em>, чтобы выбрать файл конфигурации, сохраненный вами ранее на своем компьютере.<br /><br />Нажмите кнопку <em>" + sbutton.restore + "</em>, чтобы заменить текущие значения всех параметров на их значения из файла конфигурации.";

//help page
hconfig.page1="<dd>Вы можете создать резервную копию текущих настроек на случай необходимости восстановления маршрутизатора к заводским параметрам.</dd><dt>";
hconfig.page2="</dt><dd>Щелкните кнопку <i>Сохранить</i> для загрузки настроек маршрутизатора на ваш ПК.</dd>";
hconfig.page3="<dd>Щелкните кнопку <i>Обзор...</i> для выбора файла настроек, сохраненном на вашем ПК. Щелкните кнопку <i>Восстановить</i> для перезаписи всех текущих настроек установками из указанного файла.<br /><br /><div class=\"note\"><h4>Замечание</h4><div>Восстанавливайте установки только из файлов, сохраненных с маршрутизаторов такой же модели и с такой же версией прошивки.</dd></div></dd>";

// ** DDNS.asp **//
ddns.titl="Динамический DNS";
ddns.h2="Динамический DNS (DDNS)";
ddns.legend="DDNS";
ddns.srv="Служба DDNS";
ddns.emailaddr="Адрес E-mail";
ddns.typ="Тип";
ddns.dynamic="Динамический";
ddns.custom="Пользовательский";
ddns.wildcard="Wildcard";
ddns.statu="Статус DDNS";
ddns.system="Сервер DYNDNS";
ddns.options="Дополнительные опции DDNS";
ddns.forceupd="Период принудит. обновления";
ddns.wanip="Не использовать проверку внешнего IP";

ddnsm.all_closed="Сервер DDNS не отвечает";
ddnsm.all_resolving="Разрешение имени домена";
ddnsm.all_errresolv="Не удалось разрешить имя домена";
ddnsm.all_connecting="Соединяюсь с сервером";
ddnsm.all_connectfail="Не удалось соединиться с сервером";
ddnsm.all_disabled="DDNS отключен";
ddnsm.all_noip="Нет соединения с Интернетом";

//help container
hddns.right2="DDNS позволяет осуществлять доступ к вашей сети из Интернета по имени домена вместо IP-адреса. Эта служба отслеживает изменение IP-адресов и динамически обновляет информацию о вашем домене. Вы должны подписаться на обслуживание на DynDNS.org, freedns.afraid.org, ZoneEdit.com, No-IP.com или ином сервере.";
hddns.right4="Введите целое число в поле ввода, чтобы установить период принудительного обновления (в сутках). Обновления должны выполняться автоматически, когда ваш IP-адрес меняется. Во избежание блокировки имени вашего домена или хоста провайдером DDNS избегайте некорректного (слишком частого) обновления.";

//help page
hddns.page1="<dd>Маршрутизатор оснащен функцией сервиса динамических доменных имен (DDNS).  DDNS позволяет присвоить фиксированное значение хосту или домену к динамическому IP адресу. Подобный функционал полезен при хостинге веб страниц, FTP сервера или любого другого сервера внутри вашей сети. Для того, чтобы воспользоваться данной функцией вам необходимо подписаться к услуге DDNS у её поставщика <a href=\"http:\/\/www.dyndns.org\" target=\"_new\">www.dyndns.org</a>, поставщик услуг DDNS.</dd>";
hddns.page2="<dd>Для отключения сервиса DDNS, оставьте значение по умолчанию: <i>Отключить</i>. Для включения этого сервиса следуйте нижеприведенным инструкциям:<ol class=\"wide\"><li>Подпишитесь к услуге DDNS по адресу <a href=\"http:\/\/www.dyndns.org\" target=\"_new\">www.dyndns.org</a>. Вам потребуется имя пользователя, пароль и имя вашего хоста.</li><li>На экране DDNS , выберите  <i>Включить</i>.</li><li>Заполните поля <i>Имя пользователя</i>, <i>Пароль</i> и <i>Имя хоста</i>.</li><li>Щелкните кнопку <i>Сохранить</i> для сохранения изменений. Щелкните кнопку <i>Отменить</i> для отмены несохраненных изменений.</li></ol><br />Теперь у вас есть доступ к вашему маршрутизатору из Интернета через зарегистрированный вами домен.</dd>";
hddns.page3="<dd>Сервис <em>Статического</em> DNS подобен сервису <em>Динамического</em> DNS в том, что разрешает таким именам хостов, как yourname.dyndns.org, указывать на ваш IP адрес. Но в отличии от <em>Динамического</em> DNS хоста, срок действия <em>Статического</em> DNS хоста не истекает по прошествии 35 дней при отсутствии обновлений, однако обновлениям требуется больше времени для распространения через систему DNS.<br/><em>Индивидуальный</em> DNS сервис услуги DynDNS предоставляет управляемое решение первичного (приоритетного) DNS, что дает вам полный контроль над всем доменом и предоставляет унифицированную услугу первичного/вторичного DNS. Онлайн интерфейс дает два уровня контроля над вашим доменом, что подходит средним и продвинутым пользователям.</dd>";
hddns.page4="<dd>Включение функции подстановки (wildcard) для вашего хоста позволяет причислить домены *.yourhost.dyndns.org к тому же IP адресу, что и yourhost.dyndns.org. Эта функция полезна если вы хотите использовать www.yourhost.dyndns.org и по прежнему подключаться к вашему сетевому узлу.</dd>";
hddns.page5="<dd>Для активации интервала принудительного обновления (в днях) введите целое число в ячейку. Принудительное обновление – это такое обновление, которое будет произведено даже при условии, что ваш адрес IP не изменился.</dd>";
hddns.page6="<dd>Здесь отображается состояние подключения услуги DDNS.</dd>";

// ** Diagnostics.asp **//
diag.titl="Диагностика";
diag.h2="Диагностика";
diag.legend="Командная оболочка";
diag.cmd="Команды";
diag.startup="Параметры запуска";
diag.shutdown="Выключить";
diag.firewall="Брандмауэр";
diag.custom="Пользовательский скрипт";

//help container
hdiag.right2="Вы можете выполнять команды с помощью веб-интерфейса. Введите команду в текстовое поле и нажмите кнопку <em>" + sbutton.runcmd + "</em>, чтобы выполнить ее.";

//help page
hdiag.page1="<dd>У вас есть возможность запускать команды непосредственно со страницы веб конфигурации.</dd>";
hdiag.page2="<dd>Введите вашу команду в текстовое поле и щелкните <em>Выполнить команды</em>.</dd>";
hdiag.page3="<dd>Вы можете сохранить несколько команд для выполнения при запуске маршрутизатора. Введите вашу команду в текстовое поле (по одной команде за раз) и щелкните <em>Сохр. параметры запуска</em>.</dd>";
hdiag.page4="<dd>Каждый раз при запуске брандмауэра он может запускать список установленных инструкций из IP таблиц. Введите ваши инструкции для брандмауэра в текстовое поле (по одной за раз) и щелкните <em>Сохр. браундмауэр</em>.<br/><br/>";
hdiag.page5="<dd>Индивидуальные скрипты хранятся в файле /tmp/custom.sh. Вы можете запускать их вручную или использовать Cron для их вызова. Введите ваши инструкции в текстовое поле (по одной за раз) и щелкните <em>Сохр. скрипт</em>.<br/><br/><div class=\"note\"><h4>Примечание</h4><div><ul class=\"wide\"><li>Команды для загрузки сохраняются в переменной nvram rc_startup</li><li>Команды для брандмауэра сохраняются в переменной rc_firewall</li><li>Индивидуальные скрипты сохраняются в переменной rc_custom</li></ul></div></div></dd>";

// ** DMZ.asp **//
dmz.titl="DMZ";
dmz.h2="Демилитаризованная зона (DMZ)";
dmz.legend="DMZ";
dmz.serv="Использование DMZ";
dmz.host="IP-адрес компьютера DMZ";

//help container
hdmz.right2="Включение этой опции откроет к вашему компьютеру полный доступ из Интернета. Все его порты будут доступны извне.";

//help page
hdmz.page1="<dd>Функция демилитаризованной зоны (DMZ) хостинга позволяет одному узлу становиться видимым из интернета для использования некоторых специфичных служб, таких как онлайн игры или видеоконференции. DMZ хостинг открывает все порты для одного сетевого узла. Функция перенаправления портов в данном случае более безопасна, так как она переадресовывает только те порты, которые вы желаете открыть, в то время как DMZ открывает все порты, предоставляя полную видимость к узлу из Интернета.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Любому компьютеру (узлу), на который вы перенаправляете порты, стоит задать статичный IP адрес, иначе этот адрес может быть изменен сервером DHCP.</div></div></dd>";
hdmz.page2="<dd>Чтобы открыть доступ к компьютеру из Интернета, выберите <i>Включить</i> и введите IP адрес сетевого узла в поле <i>IP-адрес компьютера DMZ</i>.<br /><br />Для отключения DMZ установите значение по умолчанию – <i>Отключить</i>.</dd><dd>Щелкните <i>Сохранить</i> для сохранения настроек. Щелкните <i>Отменить</i>, чтобы отменить несохраненные изменения.</dd>";

// ** Factory_Defaults.asp **//
factdef.titl="Сброс настроек";
factdef.h2="Сброс настроек";
factdef.legend="Сброс настроек маршрутизатора";
factdef.restore="Восстановить заводские настройки";
factdef.mess1="Предупреждение! Если вы нажмете OK, значения параметров устройства будут установлены по умолчанию и все ваши настройки будут потеряны.";

//help container
hfactdef.right1="Значения всех параметров устройства будут установлены по умолчанию. Все ваши настройки будут потеряны.";

//help page
hfactdef.page1="<dd>Если вы испытываете проблемы с вашим маршрутизатором, которые могли стать результатом изменения настроек, но вы не знаете каких именно, стоит восстановить настройки на заводские параметры.</dd>";
hfactdef.page2="<dd>Щелкните кнопку <i>Да</i> для сброса всех настроек к заводским параметрам. Потом нажмите кнопку <i>Применить</i>.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Любые сохраненные изменения будут утеряны во время сброса к заводским параметрам. После восстановления маршрутизатор будет доступен по IP-адресу 192.168.1.1 со стандартным паролем <tt>admin</tt>.</div></div></dd>";

// ** FilterIPMAC.asp **//
filterIP.titl="Список клиентов";
filterIP.h2="Список клиентов";
filterIP.h3="Введите MAC-адреса клиентов в следующем формате: xx:xx:xx:xx:xx:xx";
filterIP.h32="Введите IP-адреса клиентов";
filterIP.h33="Введите диапазон IP-адресов клиентов";
filterIP.ip_range="Диапазон IP-адресов";


// ** Filter.asp **//
filter.titl="Контроль доступа";
filter.h2="Доступ в Интернет";
filter.legend="Политика доступа";
filter.pol="Политика";
filter.polname="Имя политики";
filter.pcs="Компьютеры";
filter.polallow="Доступ в Интернет в определенные дни и часы.";
filter.legend2="Дни";
filter.time="Время";
filter.h24="24 часа";
filter.legend3="Блокированные службы";
filter.catchall="Перехват всех протоколов P2P";
filter.legend4="Блокировка сайтов по URL";
filter.legend5="Блокировка сайтов по ключевым словам";
filter.mess1="Удалить политику?";
filter.mess2="Вы должны задать по крайней мере один день.";
filter.mess3="Время окончания должно быть больше времени начала.";

//help container
hfilter.right2="Вы можете определить до 10 политик доступа. Нажмите кнопку <em>" + sbutton.del + "</em> для удаления политики и кнопку <em>" + sbutton.summary + "</em> для просмотра сводки данной политики.";
hfilter.right4="Включение или отключение политики";
hfilter.right6="Вы можете дать название вашей политике.";
hfilter.right8="Выберите дни недели, в которые должна действовать данная политика.";
hfilter.right10="Задайте время суток, в течение которого должна действовать данная политика.";
hfilter.right12="Вы можете заблокировать доступ к определенным службам. Нажмите кнопку <em>" + sbutton.filterSer + "</em> для изменения настроек.";
hfilter.right14="Вы можете заблокировать доступ к определенным сайтам, введя их URL.";
hfilter.right16="Вы можете заблокировать доступ к определенным сайтам по ключевым словам, содержащимся на их страницах.";


// ** FilterSummary.asp **//
filterSum.titl="Сводка ограничений доступа";
filterSum.h2="Сводка интернет-политики";
filterSum.polnum="№";
filterSum.polday="Время суток";


// ** Firewall.asp **//
firewall.titl="Брандмауэр";
firewall.h2="Безопасность";
firewall.legend="Защита с помощью брандмауэра";
firewall.firewall="Брандмауэр SPI";
firewall.legend2="Дополнительные фильтры";
firewall.proxy="Фильтр прокси";
firewall.cookies="Фильтр cookies";
firewall.applet="Фильтр Java-апплетов";
firewall.activex="Фильтр ActiveX";
firewall.legend3="Блокировка запросов из WAN";
firewall.legend4="Препятствовать WAN DoS/Bruteforce";
firewall.ping="Блокировка анонимных запросов из WAN (ping)";
firewall.muticast="Фильтрация многоадресных потоков";
firewall.ssh="Ограничить доступ к SSH";
firewall.telnet="Ограничить доступ по Telnet";
firewall.pptp="Ограничить доступ к PPTP серверу";
firewall.ftp="Ограничить доступ к FTP серверу";
filter.nat="Фильтрация NAT-перенаправления WAN";
filter.port113="Фильтрация IDENT (порт 113)";
filter.snmp="Блокировать SNMP со стороны WAN ";

//help container
hfirewall.right2="Включение/отключение брандмауэра SPI.";

// help page
hfirewall.page1="<dd>Блокировать запросы HTTP, содержащие значение &quot;<i>Host:</i>&quot;.</dd>";
hfirewall.page2="<dd>Идентифицирует запрос HTTP, содержащий значение &quot;<i>Cookie:</i>&quot;, и портит cookie. Попытается предотвратить использование файлов cookie.</dd>";
hfirewall.page3="<dd>Блокирует запросы HTTP, содержащие в строке URL &quot;<i>.js</i>&quot; или &quot;<i>.class</i>&quot;.</dd>";
hfirewall.page4="<dd>Блокирует запросы HTTP, содержащие в строке &quot;<i>.ocx</i>&quot; или &quot;<i>.cab</i>&quot;.</dd>";
hfirewall.page5="<dd>Предотвращает ответ маршрутизатора на запросы &quot;pings&quot; из Интернета.</dd>";
hfirewall.page6="<dd>Предотвращает попадание групповых (multicast) пакетов в локальную сеть.</dd>";
hfirewall.page7="<dd>Предотвращает использование внешнего IP адреса маршрутизатора локальными узлами для связи с сервером, находящегося в локальной сети (для которого было создано правило переадресации).</dd>";
hfirewall.page8="<dd>Предотвращает доступ из вне через порт 113.</dd>";
hfirewall.page9="<dd>Маршрутизатор ведет журнал всего входящего и исходящего трафика для соединения Интернетом.</dd>";
hfirewall.page10="<dd>Для поддержания работы журнала, выберите <i>Включить</i>. Для прекращения ведения журнала, выберите <i>Отключить</i>.</dd>";
hfirewall.page11="<dd>Данный параметр управляет количеством требуемой информации. Установите <i>Уровень журнала</i> на более высокое значение для регистрации большего количества действий.</dd>";
hfirewall.page12="<dd>Чтобы увидеть временный журнал последних входящих соединений, щелкните кнопку <i>Журнал входящих</i>.</td>";
hfirewall.page13="<dd>Чтобы увидеть временный журнал последних исходящих соединений, щелкните кнопку <i>Журнал исходящих</i>.</dd><dd>Проверьте все значения и щелкните <i>Сохранить</i> для сохранения этих параметров. Щелкните <i>Отменить</i> для отмены несохраненных изменений.</dd>";

// ** Forward.asp **//
prforward.titl="Перенаправление групп портов";
prforward.h2="Перенаправление групп портов";
prforward.legend="Перенаправления";
prforward.app="Приложение";

//help container
hprforward.right2="Некоторые приложения для своей корректной работы требуют открыть определенные порты. К таким приложениям относятся, например, серверы и определенные онлайн-игры. Когда из Интернета на определенный порт придет запрос, маршрутизатор перенаправит его на указанный вами компьютер. По соображениям безопасности вы можете ограничить перенаправление портов только теми портами, которые действительно используются, и снять отметку с клетки <em>" + share.enable +"</em> для не используемых в данное время портов.";

//help page
hprforward.page1="<dd>Перенаправление групп портов позволяет вам настраивать доступ к вашей сети различных служб, таких как веб-сервер, FTP-сервер, сервер электронной почты, или другие специализированные сервисы, использующие доступ в Интернет (например, видеоконференции или онлайн игры). Когда поступает запрос подобного типа от пользователей (службы) из вне, то этот запрос будет перенаправлен соответствующему ПК или сетевому узлу.<br /><br />Если необходимо перенаправить только один порт, см. <a href=\"HForward.asp\">Перенаправление портов</a>.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Любой компьютер, чей порт перенаправляется, должен обладать постоянным IP-адресом, иначе есть вероятность, что это значение может поменяться при использовании автоматического получения IP от службы DHCP.</div></div></dd><dd>Для добавления нового правила перенаправления групп портов щелкните <i>Добавить</i> и заполните поля ниже. Для удаления последнего правила щелкните <i>Удалить</i>.</dd>";
hprforward.page2="<dd>Введите название приложения в указанное поле.</dd>";
hprforward.page3="<dd>Введите номер начального (первого) порта в диапазоне перенаправления.</dd>";
hprforward.page4="<dd>Введите номер последнего порта в диапазоне перенаправления.</dd>";
hprforward.page5="<dd>Выберите соответствующий протокол: <i>TCP</i>, <i>UDP</i> или <i>Оба</i>. Эти параметры устанавливаются, согласно требованиям приложения.</dd>";
hprforward.page6="dd>Введите IP адрес того ПК, с которого запускается приложение.</dd>";
hprforward.page7="<dd>Отметьте ячейку <i>Включить</i> для активации правила перенаправления для указанного приложения.</dd><dd>Проверьте все значения и щелкните <i>Сохранить</i> для сохранения ваших настроек. Щелкните кнопку <i>Отменить</i> для отмены несохраненных изменений.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Обязательно сохраните изменения прежде чем добавлять следующее правило перенаправления.</div></div></dd>";

// ** P2P.asp **//
p2p.titl="Приложения Peer-to-Peer";
p2p.h2="Клиент BitTorrent";
p2p.legend="CTorrent";
p2p.ctorrent_srv="Служба Ctorrent";


//help container
//hpp2p.right2="Некоторые приложения для своей корректной работы требуют открыть определенные порты. К таким приложениям относятся, например, серверы и определенные онлайн-игры. Когда из Интернета на определенный порт придет запрос, маршрутизатор перенаправит его на указанный вами компьютер. По соображениям безопасности вы можете ограничить перенаправление портов только теми портами, которые действительно используются, и снять отметку с клетки <em>" + share.enable +"</em> для не используемых в данное время портов.";


// ** ForwardSpec.asp **//
pforward.titl="Перенаправление портов";
pforward.h2="Перенаправление портов";
pforward.legend="Перенаправления";
pforward.app="Приложение";
pforward.src="Сеть источника";
pforward.from="От порта";
pforward.to="До порта";

//help container
hpforward.right2="Некоторые приложения для своей корректной работы требуют открыть определенные порты. К таким приложениям относятся, например, серверы и определенные онлайн-игры. Когда из Интернета на определенный порт придет запрос, маршрутизатор перенаправит его на указанный вами компьютер. По соображениям безопасности вы можете ограничить перенаправление портов только теми портами, которые действительно используются, и снять отметку с клетки <em>" + share.enable +"</em> для не используемых в данное время портов.";

//help page
hpforward.page1="<dd>Переадресация портов позволяет вам настраивать доступ к вашей сети различных служб, таких как веб-сервер, FTP-сервер, сервер электронной почты, или другие специализированные сервисы, использующие доступ в Интернет (например, видеоконференции или онлайн игры). Когда поступает запрос подобного типа от пользователей (службы) из вне, то этот запрос будет перенаправлен соответствующему ПК или сетевому узлу.<br /><br />Если необходимо перенаправить диапазон из нескольких портов, см. <a href=\"HForward.asp\">";
hpforward.page2="</a>.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Любой компьютер, чей порт перенаправляется, должен обладать постоянным IP-адресом, иначе есть вероятность, что это значение может поменяться при использовании автоматического получения IP от службы DHCP.</div></div></dd><dd>Для добавления нового правила перенаправления портов щелкните <i>Добавить</i> и заполните поля ниже. Для удаления последнего правила щелкните <i>Удалить</i>.</dd>";
hpforward.page3="<dd>Введите название приложения в указанное поле.</dd>";
hpforward.page4="<dd>Выберите соответствующий протокол: <i>TCP</i>, <i>UDP</i> или <i>Оба</i>. Эти параметры устанавливаются, согласно требованиям приложения.</dd>";
hpforward.page5="<dd>Перенаправлять, только если отправитель имеет тот же адрес или находится в данной сети (например, 192.168.1.0/24).</dd>";
hpforward.page6="<dd>Введите номер внешнего порта (порт, который будет виден пользователям из Интернета).</dd>";
hpforward.page7="<dd>Введите IP адрес ПК, с которого запускается приложение.</dd>";
hpforward.page8="<dd>Введите номер внутреннего порта (номер порта, используемый приложением).</dd>";
hpforward.page9="<dd>Отметьте ячейку <i>Включить</i> cдля активации правила перенаправления для указанного приложения.</dd><dd>Проверьте все значения и щелкните <i>Сохранить</i> для сохранения ваших настроек. Щелкните кнопку <i>Отменить</i> для отмены несохраненных изменений.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Обязательно сохраните изменения прежде чем добавлять следующее правило перенаправления.</div></div></dd>";

// ** USB.asp **//
usb.titl="USB";
usb.usb_legend="Поддержка USB";
usb.usb_core="Базовая поддержка USB";
usb.usb_uhci="Поддержка USB 1.1 (UHCI)";
usb.usb_ohci="Поддержка USB 1.1 (OHCI)";
usb.usb_ehci="Поддержка USB 2.0";
usb.usb_storage="Поддержка USB-дисков";
usb.usb_ip="USB поверх IP";
usb.usb_printer="Поддержка USB-принтера";
usb.usb_automnt="Авто-монтирование диска";
usb.usb_mntpoint="Точка монтирования диска";
usb.usb_runonmount="Имя скрипта при монтировании";
usb.usb_diskinfo="Информация о диске";
usb.usb_mntjffs="Монтировать этот раздел в /jffs";
usb.usb_mntopt="Монтировать этот раздел в  /opt";
usb.usb_ses_umount="Использовать кнопку SES для отключения диска";

//help page
husb.page1="<dd><ul><li>Включить поддержку USB</li></ul></dd>";
husb.page2="<dd><ul><li>Включить поддержку принтера</li></ul></dd>";
husb.page3="<dd><ul><li>Включить поддержку внешних жестких дисков</li></ul></dd>";
husb.page4="<dd><ul><li>Автоматически монтировать подключаемые диски</li></ul></dd>";
husb.page5="<dt>Опции</dt><dd><ul><li>Запускать сценарии из указанного пути при каждом автоматическом монтировании диска</li><li>Монтировать раздел с данным UUID (уникальный пользовательский идентификатор) в указанную форму монтирования, такую как /opt</li><li>Использовать кнопку SES для размонтирования дисков перед их непосредственным отключением</li></ul></dd>";
husb.page6="<dd><ul><li>Отображать информацию о диске, такую как размер раздела, имя тома, если задано, UUID (например, B965FA66-CC65-4DK8-1254-DD0A78D19A90) для всех подключенных дисков</li></ul></dd></br><dt>Примечание:</dt> </br>Автоматическое монтирование установит все диски в /mnt/, например в /mnt/sda1.</br>Если имя тома opt, то раздел будет установлен в /opt, если jffs – то в  /jffs.</br>Вы можете принудительно изменить это поведение введя UUID в поля опций.</br> </br>";

// ** NAS.asp **//
nas.titl="NAS";
nas.proftpd_legend="FTP Сервер";
nas.proftpd_srv="ProFTPD";
nas.proftpd_port="Порт сервера";
nas.proftpd_dir="Файловая директория";
nas.proftpd_passw="Список паролей пользователей";
nas.proftpd_writeen="Разрешить запись";
nas.proftpd_anon="Анонимный вход (только чтение)";
nas.proftpd_anon_dir="Домашняя папка анонимного доступа";
nas.samba3_legend="Общий доступ к файлам";
nas.samba3="Сервер Samba";
// ** DLNA **
nas.dlna_legend="Сервер DLNA";
nas.dlna_srv="MiniDLNA";
nas.dlna_thumb="Включить обложки";
nas.dlna_dir="Файловая директория";
nas.shareadd="Добавить папку";
nas.sharedel="Удалить";
nas.useradd="Добавить пользователя";
nas.userdel="Удалить";
nas.perm_rw="Чтение/Запись";
nas.perm_ro="Только чтение";
nas.uname="Пользователь";
nas.pwd="Пароль";

hnas.right2="Для общего доступа к файлам добавьте новую общую папку, указав ее имя и путь к ней. Укажите пользователей, которым будет разрешен доступ к папкам посредством FTP или Samba.";

//help page
hnas.page1="<dd>Сервер FTP позволяет предоставить доступ к файлам: <br/><ul><li>Через Интернет – WAN</li><li>В локальной сети – LAN</li></ul></dd>";
hnas.page2="<dd>Сервер DLNA позволяет предоставить доступ к мультимедийным файлам: <br/><ul><li>Вам необходим поддерживающий DLNA клиент, например, DLNA-сертифицированный телевизор для просмотра файлов с носителя, подключенного к маршрутизатору.</li></ul></dd>";
hnas.page3="<dd>SСервер SAMBA предоставляет доступ к файлам: <br/><ul><li>С носителя, подключенного к маршрутизатору, всем клиентам в сети через файловый проводник.</li></ul></dd>";
hnas.page4="<dd><br/><ul><li>Путь: Путь к монтированному разделу. См. запись уже смонтированного диска в <a href=\"../USB.asp\">Поддержка USB</a> </li><li>Поддиректория: Имя директории на данном разделе, например, общая или папка/подпапка/под подпапка </li><li>Имя: Имя общей папки, отображаемое в сети для её просмотра, например, \\Маршрутизатор\Имя </li><li>Публичная: Папка публичного доступа. Учетной записи для доступа к ней не требуется.</li></ul></dd><dt>Примечание</dt><dd><br/>Для пользователей Windows: подключенный USB накопитель отображается в Windows как D: и содержит две директории: <i>public</i> и <i>secret</i>.</br><i>D:\public</i> можно предоставить в общий доступ. Для этого подключите накопитель и в разделе <a href=\"../USB.asp\">Поддержка USB</a> произведите поиск или вручную укажите путь.</br>В системе Linux он установится как D:. Для предоставления в общий доступ <i>D:\public</i>, укажите текущий путь до поддиректории <i>public</i></br>, присвойте ей имя, например, Guest, и задайте параметры ограничения доступа.</dd>";

//** Privoxy.asp **//
privoxy.titl="Блокировка рекламы";
privoxy.server="Privoxy";
privoxy.legend="Прокси-сервер фильтрации";
privoxy.transp="Прозрачный режим";
privoxy.custom="Ручная настройка";

hprivoxy.right2="Включите privoxy и введите настройки прокси-сервера на клиентских устройствах. = <b>IP маршрутизатора</b> Порт прокси = <b>8118</b>";
	
//** Lighttpd.asp **//
lighttpd.titl="Web-сервер";
lighttpd.server="Lighttpd";
lighttpd.legend="Web-сервер Lighttpd";
lighttpd.port="Порт HTTP";
lighttpd.sslport="Порт HTTPS";
lighttpd.custom=" Ручная настройка";

hlighttpd.right2="Включите lighttpd и введите настройки портов HTTP/HTTPS, которые будут прослушиваться lighttpd на наличие обращений. Корневой каталог web-сервера по умолчанию – /jffs/www. Там можно разместить ваш web-сайт.";

// ** Hotspot.asp **//
hotspot.titl=" Хот-спот ";
hotspot.h2="Портал хот-спота ";
hotspot.legend="Chillispot";
hotspot.nowifibridge="Отделить Wifi от моста LAN ";
hotspot.hotspot="Chillispot";
hotspot.pserver="IP/DNS основного сервера Radius";
hotspot.bserver="IP/DNS резервного сервера Radius";
hotspot.dns="IP-адрес DNS";
hotspot.url="Перенаправление URL";
hotspot.dhcp="Интерфейс DHCP";
hotspot.radnas="Radius NAS ID";
hotspot.net="Удаленная сеть";
hotspot.uam="UAM Secret";
hotspot.uamserver="UAM Server";
hotspot.uamport="Порт UAM";
hotspot.uamdns="UAM Any DNS";
hotspot.allowuam="UAM Allowed";
hotspot.allowuad="Домены UAM (разделение пробелом)";
hotspot.macauth="MACauth";
hotspot.macpasswd="Пароль MAC";
hotspot.sec8021Xauth="Аутентификация 802.1X(EAP)";
hotspot.option="Добавочные опции Chillispot";
hotspot.fon_chilli="Управление локальными пользователями Chillispot";
hotspot.fon_user="Список пользователей";
hotspot.http_legend="Перенаправление HTTP";
hotspot.http_srv="Перенаправление HTTP";
hotspot.http_ip="IP назначения HTTP";
hotspot.http_port="Порт назначения HTTP";
hotspot.http_net="Исходная сеть HTTP";
hotspot.nocat_legend="NoCatSplash";
hotspot.nocat_srv="NoCatSplash";
hotspot.nocat_gateway="Имя шлюза";
hotspot.nocat_gatewayaddr="IP адрес шлюза";
hotspot.nocat_home="Домашняя страница";
hotspot.nocat_ifname="Внутренний интерфейс";
hotspot.nocat_redirect="Переадресация домашней страницы";
hotspot.nocat_allowweb="Разрешенные веб-хосты";
hotspot.nocat_docroot="Корень документа";
hotspot.nocat_splash="Splash URL";
hotspot.nocat_port="Исключить порты";
hotspot.nocat_timeout="Таймаут подключения";
hotspot.nocat_verbose="Verbosity";
hotspot.nocat_route="Только маршрутизация";
hotspot.nocat_MAClist="Список разрешенных MAC";
hotspot.nocat_extifname="Внешний интерфейс";
hotspot.smtp_legend="Перенаправление SMTP";
hotspot.smtp_srv="Перенаправление SMTP";
hotspot.smtp_ip="IP назначения SMTP";
hotspot.smtp_net="Исходная сеть SMTP";
hotspot.shat_legend="Нулевая конфигурация IP";
hotspot.shat_srv="Нулевая конфигурация IP";
hotspot.shat_srv2="Нулевая конфигурация IP включена";
hotspot.sputnik_legend="Sputnik";
hotspot.sputnik_srv="Агент Sputnik";
hotspot.sputnik_mode="Режим Sputnik";
hotspot.sputnik_id="ID сервера Sputnik";
hotspot.sputnik_instant="Использовать Sputnik Instant Setup";
hotspot.sputnik_express="Использовать SputnikNet Express";
hotspot.sputnik_about="про Sputnik";
hotspot.sputnik_learn="Узнать больше";
hotspot.wifidog_legend="Wifidog";
hotspot.wifidog_srv="Демон Wifidog";
hotspot.wifidog_id="ID шлюза";
hotspot.wifidog_url="URL портала";
hotspot.wifidog_port="Порт";
hotspot.wifidog_httpdname="Имя веб-сервера";
hotspot.wifidog_httpdconn="Максимальное число пользователей";
hotspot.wifidog_checkinter="Интервал проверки (с)";
hotspot.wifidog_checktimeout="Таймаут клиента";
hotspot.wifidog_tmaclist="Список разрешенных MAC";
hotspot.wifidog_authsrv="Имя хоста AuthServer";
hotspot.wifidog_authsrvssl="AuthServer SSL доступен";
hotspot.wifidog_authsrvsslport="Порт AuthServer SSL";
hotspot.wifidog_authsrvhttpport="Порт AuthServer HTTP";
hotspot.wifidog_authsrvpath="Путь AuthServer";
hotspot.wifidog_config="Правила брандмауэра";
hotspot.wifidog_messagefile="Файл HTML сообщения для Wifidog";
hotspot.wifidog_realm="Realm для HTTP сервера";
hotspot.wifidog_username="Имя пользователя HTTP сервера";
hotspot.wifidog_password="Пароль для HTTP сервера";
hotspot.wifidog_auth="Поддержка аутентификации HTTP сервера";

//help container
hstatus_hots.right1="conup/condown:<br><i>При подключении USB или JFFS к jffs, можно использовать скрипт подключения в /jffs/etc/chilli/</i><br>Локальные пользователи:<br><i>При использовании только локальных пользователей, установите основной RADIUS сервер в 127.0.0.1</i>";

// help page
hstatus_hots.page1="<dd>Вы можете настроить маршрутизатор как шлюз точки доступа с аутентификацией (решение Chillispot) и платным учетом (Radius). ChilliSpot – портал захвата с открытым кодом или контроллер точки доступа беспроводной локальной сети. Он используется для аутентификации пользователей беспроводной сети. В нем поддерживается вход через веб-страницу, что, на данный момент, наиболее стандартная форма подключения для общественных точек доступа. Используется стандарт безопасности WPA. Аутентификация, авторизация и учет производится популярным решением на базе сервера Radius.</dd>";
hstatus_hots.page2="<dd>YВы можете делегировать управление вашим порталом с точкой доступа системе HotspotSystem.com. ChilliSpot предоставляют решения как c оплатой по мере использования сервиса, так и бесплатные варианты. Для получения большей информации посетите <a href=\"http:\/\/www.hotspotsystem.com\">www.hotspotsystem.com</a></dd>";
hstatus_hots.page3="<dd>Имя пользователя оператора, зарегистрированное вами в системе <a href=\"http:\/\/www.hotspotsystem.com\">www.hotspotsystem.com</a></dd>";
hstatus_hots.page4="<dd>Количество месторасположений, которые вы хотели бы подключить.</dd>";
hstatus_hots.page5="<dd>Если данная опция включена (по умолчанию), то сети Wi-Fi и LAN – разделяются. Например, вы можете направить пользователей Wi-Fi на всплывающую страницу платного входа, в то время как все пользователи локальной сети подключаются бесплатно. Если вы отключите данную функцию, то условия станут одинаковыми.</dd>";
hstatus_hots.page6="<dd>Это должен быть интерфейс, отображаемый при подключении к платной точке доступа.</dd>";
hstatus_hots.page7="<dd>Маска подсети для использования услуги платного доступа.</dd>";
hstatus_hots.page8="<dd>Здесь можно настроить всплывающую страницу. В частности добавить сайты для бесплатного просмотра. Если вы немарочный (White Label) оператор связи, то вы можете использовать имя своего домена на данной всплывающей странице.<br>Есть следующие варианты:<ul><li>White Label протокол: выберите https, если на вашем немарочном домене установлен сертификат SSL.</li><li>White Label домен: Введите ваш немарочный домен или имя другого сервера (например, азиатского сервера) предоставленного системой HotspotSystem.com</li><li>Вход в систему через всплывающее окно: можно настроить поле для ввода данных входа на основной всплывающей странице. Вам также необходимо будет настроить это поведение в системе HotspotSystem.com в центре управления на вкладке Manage > Locations, щелкнув нужное местоположение, далее Modify Hotspot Settings > Splash Page Settings!</li><li>Настраиваемое всплывающее окно (Walled Garden): Вы можете перенаправить пользователей сперва на вашу собственную всплывающую страницу. Для применения этого параметра вам необходимо добавить имя вашего домена в список UAM доменов ниже и подтвердить это в центре управления. Вам также следует задать ссылку на нашу всплывающую страницу, чтобы ваши клиенты могли войти в систему или заплатить за доступ (воспользоваться ваучером).</li><li>Разрешенные UAM: IP адреса или сегменты сети, которые могут быть доступны клиентам без предварительной аутентификации (список доменных имен, разделенных запятой). Например, www.chillispot.info,10.11.12.0/24.</li></ul></dd>";
hstatus_hots.page9="dd>IP-адреса серверов Radius 1 и 2.</dd>";
hstatus_hots.page10="<dd>DIP-адрес DNS сервера. Используется, чтобы проинформировать клиента какой адрес DNS используется для разрешения запросов по хост-именам. Если эта опция не настроена, то будет использоваться адрес основного DNS сервера маршрутизатора.</dd>";
hstatus_hots.page11="<dd>URL-адрес веб-сервера, используемого для аутентификации клиентов.</dd>";
hstatus_hots.page12="<dd>Общий ключ Radius для обоих серверов. Данный ключ следует сменить во избежание компрометации безопасности соединения.</dd>";
hstatus_hots.page13="<dd>Интерфейс Ethernet для прослушивания интерфейса нисходящей линии. Данный параметр должен быть всегда задан.</dd>";
hstatus_hots.page14="<dd>Идентификатор сервера сетевого доступа.</dd>";
hstatus_hots.page15="<dd>Общий ключ между uamserver и chilli. Данный ключ следует сменить во избежание компрометации безопасности соединения.</dd>";
hstatus_hots.page16="<dd>Разрешать любой сервер DNS. Обычно неавторизированные клиенты могут пользоваться только DNS серверами, указанными в полях dns1 и dns2. Данная опция позволяет клиентам использовать все серверы DNS. Это удобно для клиентов, которые установили фиксированные наборы серверов DNS.<br><br><div class=\"note\"><h4>Примечание</h4><div>По соображениям безопасности данная опция должна использоваться в сочетании с правилом переадресации брандмауэра, которое перенаправит все запросы DNS указанному серверу DNS.</div></div></dd>";
hstatus_hots.page17="<dd>IP-адрес или сегмент сети к которым клиенты могут подключится без аутентификации (список доменных имен, разделенных запятой).<br>Например: www.chillispot.info,10.11.12.0/24. </dd>";
hstatus_hots.page18="<dd>Если данная опция активна, ChilliSpot попытается авторизовать всех пользователей только используя их MAC-адреса.</dd>";
hstatus_hots.page19="<dd>Здесь вы можете указывать дополнительные опции.<br><br><div class=\"note\"><h4>Примечание</h4><div>Для получения дополнительной информации по различным опциям посетите: <a href=\"http:\/\/www.chillispot.info/chilli.html\">www.chillispot.info</a>.</div></div></dd>";
hstatus_hots.page20="<dd>Включение функции NoCatSplash позволяет вам перенаправить клиент на указанную веб-страницу.</dd>";
hstatus_hots.page21="<dd>Имя шлюза. Любое произвольное значение, которое вы желаете использовать. Например, \"Пиццерия дяди Васи с бесплатным Wi-Fi\". Используйте переменную $GatewayName на вашей странице splash.html для отображения.</dd>";
hstatus_hots.page22="<dd>Создает URL перенаправления после входа через всплывающее окно.</dd>";
hstatus_hots.page23="<dd>Включает переадресацию на указанную домашнюю страницу после входа, см. выше.</dd>";
hstatus_hots.page24="<dd>Список хостов, разделенных пробелом. Занесите в список любой хост (например, веб-сервер со всплывающей страницей или любой другой веб-сайт) к которому вы желаете дать клиентский доступ (порт TCP 80 (HTTP) и 443 (HTTPS)) до того, как они получат \"доступ в систему\" (до того, как они щелкнут \"Я согласен\" на вашей всплывающей странице), но который не поддерживает аутентификацию. Добавьте в список те веб-серверы, которые вы желаете сделать доступными подключающимся клиентам до того, как они щелкнут кнопку Я согласен на странице, внесенной в поле NoCatSplash. Например, страница, содержащая условия пользования и соглашения или приветственная страница.</dd>";
hstatus_hots.page25="<dd>Здесь хранятся все шаблоны приложения (включая SplashForm). Форма splash.html отображается для пользователей.</dd>";
hstatus_hots.page26="<dd>Дополнительный URL для вызова динамической удаленной всплывающей страницы. Он должен заканчиваться /splash.html или содержать путь вашей индивидуальной страницы.<br/><br/><div class=\"note\"><h4>Примечание</h4><div>Оставьте это поле пустым для использования стандартной страницы маршрутизатора.</div></div></dd>";
hstatus_hots.page27="<dd>Список портов (разделять пробелом). Укажите порты TCP, которые будут закрыты при входе пользователя общественного класса. Все другие будут пропускаться. Если ничего не указано, доступ разрешен для пользователей всех классов.<br/><br/><div class=\"note\"><h4>Примечание</h4><div>Вам следует *всегда* исключать порт 25 (SMTP), за исключением случаев, когда вы создаете портал для бессмысленной рассылки спама. У пользователей должен быть свой способ для отправки почты. Фигово, но так уж это устроено.</div></div></dd>";
hstatus_hots.page28="<dd>Сколько времени (в секундном эквиваленте) отсчитывается до того, как клиент повторно сможет увидеть всплывающее окно и нажать \"Я согласен\". Как часто клиенту показывается лицензионное соглашение или другие специфичные страницы.</dd>";
hstatus_hots.page29="<dd>Подробность журнала (в syslogd и /tmp/nocat.log). Сервис Syslogd должен быть включен.<ul><li>0 – минимальный журнал.</li><li>10 – регистрировать всё.</li><li>5 – средний уровень заполнения.</li></ul></dd>";
hstatus_hots.page30="<dd>Необходимо только если вы НЕ ХОТИТЕ, чтобы ваш шлюз преобразовывал сетевые адреса (NAT). Этот параметр следует включать только в сетях со строго описанными маршрутами, и вам не нужно, чтобы шлюз преобразовывал адреса. При обычном использовании эта опция не используется, поэтому, если вы не знаете, как это работает, оставьте этот параметр на значении Выкл.</dd><dd>Проверьте все значения и щелкните <em>Сохранить</em> для сохранения ваших настроек. Щелкните кнопку <em>Отменить</em> для отмены несохраненных изменений. Щелкните кнопку<em>Перезагрузить маршрутизатор</em> для его перезагрузки.</dd>";

// ** Hotspotsystem **//
hotspotsys.legend="Система Hotspot";
hotspotsys.nobridge="Разделить Wi-Fi от моста LAN";
hotspotsys.uamenable="Дополнительные настройки";
hotspotsys.loginonsplash="Поле входа во всплывающем окне";
hotspotsys.allowuam="Разрешить UAM";
hotspotsys.allowuad="Домены UAM (разделение пробелом)";
hotspotsys.whitelabelproto="Протокол White Label";
hotspotsys.whitelabel="Домен White Label";
hotspotsys.operatorid="Имя пользователя оператора";
hotspotsys.locationid="Идентификатор местоположения";
hotspotsys.dhcp="Интерфейс DHCP";
hotspotsys.net="Удаленная сеть";
hotspotsys.customsplash="Настраиваемое всплывающее окно (Walled Garden)";

//
//anchorfree.anchorfree="AnchorFree";
//anchorfree.titl="Моя рекламная сеть";
//anchorfree.h2="Рекламная сеть AnchorFree";
//anchorfree.anchorfree_revenue="Создайте рекламный хот-спот AnchorFree и зарабатывайте деньги";
//anchorfree.email="Высылать отчеты на E-Mail";
//anchorfree.ssid="Использовать другой SSID";
//anchorfree.ssid_name="SSID";
////anchorfree.address_1="Адрес";
//////anchorfree.address_2="Адрес 2";
////anchorfree.city="Город";
////anchorfree.zip="Почтовый индекс или Zip-код";
////anchorfree.state="Округ/штат/область";
////anchorfree.country="Страна";
////anchorfree.category="Категория";
////anchorfree.publish="Опубликовать хот-спот на карте WiFi";
////anchorfree.serviceid="ID службы";
////anchorfree.servicestatus="Статус службы";
////anchorfree.agreement="Условия соглашения";
////anchorfree.agree="Я ПРИНИМАЮ";
////anchorfree.validaddr="для публикации данного хот-спота на карте бесплатных точек WiFi необходимо сообщить корректный адрес!";
////anchorfree.validcity=" для публикации данного хот-спота на карте бесплатных точек WiFi необходимо сообщить корректное название города или почтовый код!";
//anchorfree.validcat="пожалуйста, выберите рекламную категорию вашего хот-спота";
//anchorfree.validcountry="пожалуйста, выберите страну вашего хот-спота";
//anchorfree.validterms="Вы должны принять условия соглашения!";
//
//hanchorfree.right1="Присоединяйтесь к рекламной сети хот-спотов AnchorFree";
//hanchorfree.right2="AnchorFree заведует рекламной сетью хот-спотов, которая позволяет пользователям DD-WRT получать растущие доходы от своего маршрутизатора.";
//hanchorfree.right3="Получайте растущий доход от распространения рекламы AnchorFree";
//hanchorfree.right4="После включения данной функции и создания учетной записи AnchorFree (это бесплатно и просто) в веб-страницы, просматриваемые пользователями, будет включен постоянный рекламный фрейм, который будет приносить вам ежемесячный доход. При превышении минимального месячного порога $25 AnchorFree автоматически переведет средства на ваш счет.";
//hanchorfree.right5="Чтобы узнать больше, пожалуйста, посетите сайт www.anchorfree.com";
//hanchorfree.right6="Активация очень проста";
//hanchorfree.right7="После активации AnchorFree вышлет по адресу владельца зарегистрированной учетной записи простые инструкции по оптимизации вашего хот-спота, FAQ и прочую информацию, которая поможет вам получать доход от вашего марштуризатора. С помощью конфигуратора экрана AnchorFree в интернет-страницы, получаемые через ваш маршрутизатор, будет вставляться узкий и ненавязчивый рекламный фрейм.";
//hanchorfree.right8="Поддержка пользователей";
//hanchorfree.right9="У вас есть вопросы? Напишите нам: boxhelp@anchorfree.com";


// ** Info.htm **//
info.titl="Информация";
info.h2="Сведения о системе";
info.wlanmac="MAC беспроводного адаптера";
info.srv="Службы";
info.ap="Точка доступа";


// ** index_heartbeat.asp **//
idx_h.srv="Сервер Heart Beat";
idx_h.con_strgy="Стратегия соединения";
idx_h.max_idle="Соединение по запросу: макс.время бездействия";
idx_h.alive="Поддержка соединения: период повт.набора";
idx_h.reconnect="Принудительное переподключение";


// ** index_l2tp.asp **//
idx_l.srv="Сервер L2TP";
idx_l.req_chap="Запрашивать CHAP";
idx_l.ref_pap="Отказать PAP";
idx_l.req_auth="Запрашивать авторизацию";
idx_l.iptv="Получать IPTV";

// ** index_pppoe.asp **//
idx_pppoe.use_rp="Использование RP PPPoE";


// ** index_pptp.asp **//
idx_pptp.srv="Использование DHCP";
idx_pptp.wan_ip="IP-адрес WAN";
idx_pptp.gateway="Шлюз (сервер PPTP)";
idx_pptp.encrypt="PPTP-шифрование";
idx_pptp.reorder="Реорганизация пакетов";
idx_pptp.addopt="Дополнительные опции PPTP";
idx_pptp.iptv=" Получать IPTV";

// ** index_static.asp **//
idx_static.dns="Статический DNS";


// ** index.asp **//
idx.titl="Настройка";
idx.h2="Настройка WAN";
idx.h22="Настройка беспроводной сети";
idx.legend="Тип соединения WAN";
idx.conn_type="Тип соединения";
idx.stp="STP";
idx.stp_mess="(отключено для провайдера COMCAST)";
idx.optional="Необязательные настройки";
idx.mtu="MTU";
idx.txqlen="Длина очереди TX";
idx.h23="Настройка локальной сети";
idx.routerip="IP-адрес маршрутизатора";
idx.lanip="IP-адрес в локальной сети";
idx.legend2="Порт WAN";
idx.wantoswitch="Добавить порт WAN в коммутатор";
idx.legend3="Настройки времени";
idx.timeset="Часовой пояс";
idx.static_ip="Статический IP";
idx.dhcp="Динамический IP - DHCP";
idx.dhcp_legend="Настройки сервера сетевых адресов (DHCP)";
idx.dhcp_type="Тип DHCP";
idx.dhcp_srv="Сервер DHCP";
idx.dhcp_fwd="Перенаправление DHCP";
idx.dhcp_start="Начальный IP-адрес";
idx.dhcp_end="Конечный IP-адрес";		//used in Status_Lan.asp
idx.dhcp_maxusers="Макс. число пользователей DHCP";
idx.dhcp_lease="Время аренды для клиента";
idx.dhcp_dnsmasq="Использование DNSMasq для DHCP";
idx.dns_dnsmasq="Использование DNSMasq для DNS";
idx.auth_dnsmasq="DHCP-Authoritative";
idx.summt_opt1="нет";
idx.summt_opt2="первое воскр.апреля – последнее воскр.октября";
idx.summt_opt3="последнее воскр.марта - последнее воскр.октября";
idx.summt_opt4="последнее воскр.октября - последнее воскр.марта";
idx.summt_opt5="2-е воскр.марта - первое воскр.ноября";
idx.summt_opt6="первое воскр.октября - 3-е воскр.марта";
idx.summt_opt7="последнее воскр.сентября - первое воскр.апреля";
idx.summt_opt8="3-е воскр.октября - 3-е воскр.марта";
idx.summt_opt9="Первое воскр. Окт. – Первое воскр. Апр. ";
idx.summt_opt10="3-е воскр. Окт. – 3-е воскр. Фев.";
idx.portsetup="Установка портов";
idx.wanport="Назначение порта WAN";
idx.ntp_client="Клиент службы времени (NTP)";

//help container
hidx.right2="Этот тип соединения чаще всего используется кабельными операторами.";
hidx.right4="Введите имя хоста, выданное вашим провайдером.";
hidx.right6="Введите имя домена, выданное вашим провайдером.";
hidx.right8="Это адрес маршрутизатора.";
hidx.right10="Это маска подсети маршрутизатора.";
hidx.right12="Позволяет маршрутизатору управлять вашими IP-адресами.";
hidx.right14="Адрес, с которого желательно начать распределение адресов.";
hidx.right16="Вы можете ограничить число адресов, распределяемых вашим маршрутизатором. 0 означает, что будут распределяться только предварительно определенные статические адреса.";
hidx.right18="Выберите часовой пояс и период действия летнего времени (DST). Маршрутизатор может использовать местное или всемирное время (UTC).";
hidx.sas="Мастер настройки поможет вам настроить основные параметры вашего маршрутизатора.";

//help page
hidx.page1="<dd>Окно Настройки – это первое окно, которое вы увидите при доступе к маршрутизатору. Большинству пользователей достаточно настроек в этом окне для того, чтобы настроить маршрутизатор на корректную работу. Для некоторых провайдеров Интернет потребуется ввести дополнительную информацию, такую как имя пользователя, пароль, IP-адрес, адрес шлюза и/или адрес DNS. Если потребуется, эту информацию следует получить непосредственно у вашего провайдера.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>После изменения и настроек этих параметров следует сменить пароль маршрутизатора используя окно <a href=\"HManagement.asp\">Управление маршрутизатором</a> Таким образом вы повысите безопасность маршрутизатора и предотвратите несанкционированные изменения. Все пользователи при попытке подключения к странице веб-настроек должны будут ввести пароль для получения доступа.</div></div></dd>";
hidx.page2="<dd>Этот параметр требуется некоторыми провайдерами и должен быть предоставлен вам ими.</dd>";
hidx.page3="<dd>Этот параметр требуется некоторыми провайдерами и должен быть предоставлен вам ими.</dd>";
hidx.page4="<dd>Маршрутизатор поддерживает четыре вида подключений:<ul><li>Авто-конфигурация по DHCP</li><li>Статический IP</li><li>PPPoE (Point-to-Point Protocol over Ethernet)</li><li>PPTP (Point-to-Point Tunnelling Protocol)</li></ul><br />Данные типы подключений могут выбраны из выпадающего списка параметра <i>Тип соединения</i>. Необходимая информация и доступные функции могут отличаться в зависимости от типа выбранного вами подключения.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Некоторые провайдеры требуют использование конкретного МАС-адреса для соединения с сетью Интернет. Для получения дополнительной информации откройте вкладку Система. Затем щелкните кнопку Помощь и почитайте о функции <a href=\"HWanMAC.asp\">Клонирование МАС-адреса</a>.</div></div></dd>";
hidx.page5="<dd>Это IP-адрес маршрутизатора и маска подсети, которые видны пользователям из сети Интернет (включая вашего провайдера). Если для вашего подключения требуется статический IP-адрес, ваш провайдер должен вам его предоставить.</dd>";
hidx.page6="<dd>Ваш провайдер должен предоставить вам IP-адрес шлюза.</dd>";
hidx.page7="<dd>Ваш провайдер должен предоставить вам IP-адрес DNS.</dd>";
hidx.page8="<dd>Введите имя пользователя и пароль для использования при подключении к вашему провайдеру при использовании соединений типа PPPoE или PPTP.</dd>";
hidx.page9="<dd>Сжатие РРР представляет метод общения и использования протоколов сжатия через инкапсулированные связи PPP. Оно основано на протоколе MPPC (Microsoft Point-to-Point Compression). Данный протокол создан для передачи сжатых диаграмм через каналы Р2Р.</dd>";
hidx.page10="<dd>MPPE (Microsoft Point-to-Point Encryption) – шифрование Microsoft соединения точка-к-точке. Протокол, созданный для передачи зашифрованных диаграмм через связи Р2Р.</dd>";
hidx.page11="<dd>Эта опция задает расписание для повторного соединения РРРоЕ отключая клиента PPPD и перезапуская его.</dd>";
hidx.page12="<dd>Можно настроить отключение маршрутизатора через определенный промежуток времени от сети Интернет при длительных периодах бездействия (макс.время бездействия). Если ваше подключение было прервано виду бездействия, то функция Подключение по требованию позволит автоматически восстановить подключение, как только вы попытаетесь снова подключиться к Интернету. Если вы хотите воспользоваться этой функцией, поставьте соответствующий переключатель. Если вы желаете сохранять постоянное подключение, в поле макс.время бездействия введите 0. Либо введите время, в минутах, по истечении которого вы хотите прервать соединение с сетью Интернет.</dd>";
hidx.page13="<dd>Эта опция непрерывно поддерживает ваше соединение с Интернетом, даже когда соединение находится в состоянии простоя. Для использования этой опции выберите <i>Поддержка соединения: период повт.набора</i>. Значение по умолчанию – 30 секунд (иными словами маршрутизатор будет отправлять Keep alive пакеты с периодичностью в 30 секунд).</dd>";
hidx.page14="<dd>Maximum Transmission Unit, максимальна единица передачи. Задает наибольший размер пакета, разрешенного к передаче через Интернет. Оставьте функцию на параметре <i>Авто</i>, чтобы маршрутизатор самостоятельно подобрал наиболее подходящий размер MTU для вашего Интернет-соединения. Для установки размера MTU вручную, выберите <i>Вручную</i>и введите желаемое значение (по умолчанию 1400). Данное значение следует использовать в диапазоне 1200 - 1500.</dd>";
hidx.page15="<dd>Здесь указывается IP-адрес и маска подсети маршрутизатора в том виде, как она доступна из локальной сети. Параметры по умолчанию 192.168.1.1 для IP-адреса и 255.255.255.0 для маски подсети.</dd>";
hidx.page16="<dd>Оставьте базовые параметры, <i>Включено</i>, для использования опции DHCP сервера. Если в вашей сети уже есть DHCP сервер или вы не хотите его использовать, то выберите <i>Отключить</i>.</dd>";
hidx.page17="<dd>Введите цифровое значение с которого DHCP сервер начнет раздавать IP-адреса. Не используйте 1, так как это значение самого маршрутизатора (192.168.1.1).</dd>";
hidx.page18="<dd>Введите максимальное количество узлов, которым вы хотите присвоить IP-адреса с помощью сервера DHCP. Максимальное значение возможных адресов равно 253, если начинать с адреса 192.168.1.2.</dd>";
hidx.page19="<dd>Время аренды для клиента – количество времени, которое выделяется пользователю для соединения к маршрутизатору, используя динамический IP-адрес. Введите значение, в минутах, на которое маршрутизатор позволит \"арендовать\" данный динамический IP-адрес.</dd>";
hidx.page20="<dd>Domain Name System, система доменных имен – данная система определяет порядок преобразования доменных имен или названий веб-страниц в сетевой адрес или ссылку URL. Ваш поставщик услуг доступа в Интернет обычно предоставляет по меньшей мере один IP-адрес для сервера DNS. Если вы желаете использовать другой, то введите его IP-адрес в одно из этих полей. Вы можете указать до трех адресов DNS-серверов. Маршрутизатор будет использовать их для более быстрого доступа к функционирующим DNS-серверам.</dd>";
hidx.page21="<dd>Служба WINS (Windows Internet Naming Service, служба интернет наименования Windows) управляет взаимодействием каждого ПК с сетью Интернет. Если вы пользуетесь сервером WINS, то введите его адрес в это поле. В противном случае, оставьте данное поле пустым.</dd>";
hidx.page22="<dd>Выберите применимый к вам часовой пояс. Для использования местного времени, оставьте галочку в ячейке <i>Использовать местное время</i>.</dd><dd>Проверьте все значения и щелкните <i>Сохранить</i> для сохранения параметров. Нажмите <i>Отменить</i> для отмены несохраненных параметров. Вы можете проверить настройки, подключившись к Интернет.</dd>";

// ** DSL ** //
dsl.status="Статус DSL";
dsl.annex=" DSL Annex";
dsl.iface_status="Статус подключения";
dsl.datarate="Скорость подключения (отдача/прием)";
dsl.snr="Сигнал DSL (отдача/прием)";

// ** Join.asp **//

//sshd.webservices
join.titl="Соединение";
join.mess1="Успешное соединение как клиента со следующей сетью: ";


// ** Log_incoming.asp **//
log_in.titl="Журнал входящих пакетов";
log_in.h2="Журнал входящих пакетов";
log_in.th_ip="IP отправителя";
log_in.th_port="Номер порта получателя";


// ** Log_outgoing.asp **//
log_out.titl="Журнал исходящих пакетов";
log_out.h2="Журнал исходящих пакетов";
log_out.th_lanip="Локальный IP";
log_out.th_wanip="URL/IP назначения";
log_out.th_port="Служба/номер порта";


// ** Log.asp **//
log.titl="Журнал";
log.h2="Обслуживание журнала";
log.legend="Журнал";
log.lvl="Уровень журнала";
log.drop="Отброшенные";
log.reject="Отклоненные";
log.accept="Принятые";


// ** Management.asp **//
management.titl="Администрирование";
management.h2="Управление маршрутизатором";
management.changepassword="В настоящее время ваш маршрутизатор использует небезопасную комбинацию имени пользователя и пароля по умолчанию и не защищен. Пожалуйста, измените их в следующем диалоговом окне!";
management.psswd_legend="Пароль маршрутизатора";
management.psswd_user="Имя пользователя маршрутизатора";
management.psswd_pass="Пароль маршрутизатора";
management.pass_conf="Подтверждение пароля";
management.remote_legend="Удаленный доступ";
management.remote_gui="Управление через GUI";
management.remote_https="Использовать HTTPS";
management.remote_guiport="Порт Web GUI";
management.remote_ssh="Управление через SSH";
management.remote_sshport="Порт удаленного SSH";
management.remote_telnet="Управление через Telnet";
management.remote_telnetport="Порт удаленного Telnet";
management.web_legend="Доступ через Web";
management.web_refresh="Автообновление (в секундах)";
management.web_sysinfo="Включить инфо-сайт";
management.web_sysinfopass="Инфо-сайт защищен паролем";
management.web_sysinfomasq="Маскирование MAC инфо-сайта";
management.boot_legend="Пауза при загрузке";
management.boot_srv="Пауза при загрузке";
management.cron_legend="Cron";
management.cron_srvd="Cron";
management.cron_jobs="Дополнительные задания Cron";
management.loop_legend="Loopback интерфейс";
management.loop_srv="Loopback интерфейс";
management.wifi_legend="802.1x";
management.wifi_srv="802.1x";
management.rst_legend="Кнопка сброса";
management.rst_srv="Кнопка сброса";
management.routing_legend="Маршрутизация";
management.routing_srv="Маршрутизация";
management.ipv6_legend="Поддержка IPv6";
management.ipv6_srv="IPv6";
management.ipv6_rad="Radvd включен";
management.ipv6_radconf="Конфигурация Radvd";
management.jffs_legend="Поддержка JFFS2";
management.jffs_srv="JFFS2";
management.jffs_clean="Очистить JFFS2";
management.lang_legend="Выбор языка";
management.lang_srv="Язык";
management.lang_bulgarian="Болгарский";
management.lang_chinese_traditional="Китайский традиционный";
management.lang_chinese_simplified="Китайский упрощенный";
management.lang_croatian="Хорватский";
management.lang_catalan="Каталонский";
management.lang_czech="Чешский";
management.lang_dutch="Голландский";
management.lang_portuguese_braz="Португальский (Бразилия)";
management.lang_english="Английский";
management.lang_polish="Польский";
management.lang_french="Французский";
management.lang_german="Немецкий";
management.lang_turkish="Турецкий";
management.lang_italian="Итальянский";
management.lang_brazilian="Бразильский";
management.lang_russian="Русский";
management.lang_romanian="Румынский";
management.lang_slovenian="Словенский";
management.lang_spanish="Испанский";
management.lang_serbian="Сербский";
management.lang_swedish="Шведский";
management.lang_japanese="Японский";
management.lang_hungarian="Венгерский";
management.lang_latvian="Латышский";
management.net_legend="Параметры фильтра IP (настройте их для P2P)";
management.net_conctrl="Контроль загрузки TCP";
management.net_port="Макс. число портов";
management.net_tcptimeout="Таймаут TCP (в секундах)";
management.net_udptimeout="Таймаут UDP (в секундах)";
management.clock_legend="Разгон процессора";
management.clock_frq="Частота";
management.clock_support="Не поддерживается";
management.mmc_legend="Поддержка карт MMC/SD";
management.mmc_srv="Устройство MMC";
management.mmc_gpiosel="Выбор контактов GPIO";
management.mmc_gpiopins="Конакты GPIO";
management.mmc_cardinfo="Информация карты";
management.samba_legend="Автомонтирование CIFS";
management.samba_srv="Файловая система Интернет (CIFS)";
management.samba_share="Разделяемые ресурсы";
management.samba_stscript="Стартовый скрипт";
management.SIPatH_srv="SIPatH";
management.SIPatH_port="Порт SIP";
management.SIPatH_domain="Домен SIP";
management.gui_style="Стиль GUI маршрутизатора";
management.web_authlimit="Таймаут повторного входа (секунды)";

//help container
hmanagement.right1="Автообновление:";
hmanagement.right2="Устанавливает интервал автоматического обновления страниц графического интерфейса. Значение 0 полностью отключает данную функцию.";

//help page
hmanagement.page1="<dd>Страница управления маршрутизатором позволит вам менять установки маршрутизатора. Здесь вы найдете большинство настраиваемых параметров ПО DD-WRT.</dd>";
hmanagement.page2="<dd>Новый пароль не должен превышать 32 знака в длину и содержать пробелов. Введите новый пароль повторно для его подтверждения.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Имя пользователя по умолчанию – <tt>root</tt>.<br/>Настоятельно рекомендуем заменить стандартный пароль маршрутизатора – <tt>admin</tt>. Все пользователи, кто попытается подключиться к странице веб-конфигурации или к мастеру настройки должны будут ввести пароль маршрутизатора для работы с ним.</div></div></dd>";
hmanagement.page3="<dd>Данная функция позволяет вам управлять маршрутизатором с удаленного сетевого узла через интернет. Для выключения данного функционала, оставьте параметры по умолчанию: <em>Выкл.</em>. Для включения, выберите <em>Вкл.</em> и используйте указанный порт (по умолчанию 8080) для удаленного подключения. Также смените стандартный пароль, если вы еще не сделали этого.<br /><br />Для удаленного управления маршрутизатором, введите в браузер <tt>http:\/\/xxx.xxx.xxx.xxx:8080</tt> (вместо х-ов следует ввести внешний IP-адрес маршрутизатора, а 8080 указывает на используемый порт). Если все было верно указано, то появится запрос на ввод пароля.<br /><br />Если вы используете https, то вид ссылки должен быть следующим: <tt>https:\/\/xxx.xxx.xxx.xxx:8080</tt> (не все версии DD-WRT имеют такие возможности без перекомпиляции со встроенной поддержкой SSL).<br /><br />Вы также можете включить <em>SSH</em>&nbsp; для удаленного доступа через протокол Secure Shell. Важно: SSH-клиент должен быть включен в <a href=\"HServices.asp\">";
hmanagement.page4="</a> page.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Если активна функция удаленного доступа, то любой пользователь, располагающий паролем доступа и знающий ваш внешний IP, может подключаться к маршрутизатору и изменять настройки.</div></div></dd>";
hmanagement.page5="<dd>Данная функция позволяет вам управлять маршрутизатором используя протоколы HTTP и HTTPS. Если вы решите отключить данную функцию, необходимо будет перезапустить устройство вручную.<br/>Вы также можете включить или отключить отображение веб-страницы с информацией по настройке маршрутизатора. Возможно защитить эту станицу паролем (тем же, что и выше).<br/>Маскирование MAC-адреса позволяет сократить MAC-адреса в веб-интерфейсе.<br/><br/><div class=\"note\"><h4>Примечание</h4><div>Если включена маскировка MAC, все МАС-адреса будут отображены в формате: xx:xx:xx:xx:AA:BB. Маскировка MAC-адресов только применима к странице Сведения о системе.</div></div></dd>";
hmanagement.page6="<dd>Пауза при загрузке – функция, которая вам вряд ли понадобится. Она создает короткую задержку (5 сек.) во время запуска. За это время можно инициировать загрузку новой прошивки, если та, что установлена во Flash ROM, не повреждена. Это, естественно, необходимо только в тех случаях, если вы не можете перезаписать прошивку ввиду того, что установленная прошивка не запускает страницу веб-настроек. Смотрите документацию DD-WRT для дополнительной информации.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Рекомендуется оставить эту функцию включенной, это может быть полезным в случае некорректной установки прошивки на устройство.</div></div></dd>";
hmanagement.page7="<dd>Подсистема Cron контролирует очередность запуска Linux команд. Для этого вам будет необходимо использовать командную строку или загрузочные скрипты.</dd>";
hmanagement.page8="<dd>Включить/выключить интерфейс loopback обратной связи. Интерфейс обратной связи имитирует поведение внутренних клиентов, как если бы они были внешними. Данный функционал полезен для тестирования таких вещей, как имена DynDNS. Интерфейс обратной связи – опциональная функция, так как её включение нарушит соединение PPTP и доступ к локальным сетевым ресурсам.</dd>";
hmanagement.page9="<dd>Ограниченный сервер 802.1x необходим для выполнения требований WPA \"рукопожатия\", для того, чтобы клиенты с Windows XP работали с WPA подключением.</dd>";
hmanagement.page10="<dd>Эта функция контролирует процесс resetbuttond. Кнопка сброса (Reset) в зависимости от длительности нажатия инициирует следующие действия:<ul><li>Короткое нажатие  &ndash; перезапуск маршрутизатора.</li><li>Длинное нажатие (&gt;5 сек) &ndash; перезапустит и восстановит заводские настройки.</li></ul></dd>";
hmanagement.page11="<dd>RМаршрутизация включает протоколы OSPF (Open Shortest Path First) и RIP (Routing Information Protocol), если вы включили эти режимы на странице Маршрутизация.</dd>";
hmanagement.page12="<dd>Если вы настраиваете сеть под использование P2P приложений, то следует увеличить максимум доступных портов и уменьшить время задержки TCP/UDP. Это необходимо для поддержания стабильности маршрутизатора, так как P2P приложения открывают множественные подключения, но часто не закрывают их. Следует использовать следующие параметры:<ul><li>Максимум портов: 4096</li><li>Задержка TCP: 120 сек</li><li>Задержка UDP: 120 сек</li></ul></dd><dd>Проверьте все значения и щелкните <em>Сохранить</em> для сохранения ваших настроек. Щелкните кнопку <em>Отменить</em> для отмены несохраненных изменений. Щелкните кнопку <em>Перезагрузить маршрутизатор</em> для его перезагрузки.</dd>";

// ************ Port_Services.asp (used by Filters.asp and QoS.asp, QOSPort_Services.asp not used anymor) *****************************************//
portserv.titl="Службы портов";
portserv.h2="Службы портов";


// ** Networking.asp **//
networking.h2="Тегирование VLAN";
networking.legend="Тегирование";
networking.h22="Мосты";
networking.legend2="Создать мост";
networking.legend3="Присоединить к мосту";
networking.legend4="Текущая таблица мостов";
networking.brname="Имя моста";
networking.stp="STP включено";
networking.iface="Интерфейсы";
networking.h5="DHCPD";
networking.legend5="Множественный сервер DHCP";
networking.vlan="VLAN";
networking.iface="Интерфейс";
networking.tg_number="Номер тэга";
networking.prio="Приор.";
networking.bridge="Мост";
networking.snooping="IGMP Snooping";
networking.assign="Назначение";
networking.bonding="Объединение";
networking.bondtype="Тип объединения";
networking.bondifaces="Объединяемые интерфейсы";
networking.bond="Объединение";
networking.slave="Вспомогательный";
networking.max="Макс.";
networking.leasetime="Время аренды";

//help container
hnetworking.right1="Множественные DHCPD";
hnetworking.right2="Для использования множественных DHCPD активируйте DNSMasq как сервер DHCP.";

//help page
hnetworking.page1="<dd>Позволяет передавать через один физический интерфейс несколько независимых сетевых потоков. Этот процесс реализован путем добавлением небольшого идентификатора заголовок Ethernet-кадра. По прибытию на другой конец, используя эти идентификаторы, пакеты снова могут быть разделены и восстановлены в исходное состояние. Использование этой опции, совместно с сетевым мостом, позволяет вам создать разные передающие сети, которые, в свою очередь, могут быть совмещены мостом с беспроводным интерфейсом, разделяя сеть управления маршрутизатором и сеть с общим доступом пользователей. Полезная функция для провайдеров с большими сетями.</dd>";
hnetworking.page2="<dd>Позволяет вам создать новый VLAN интерфейс из стандартного интерфейса, фильтруя его по заданному номеру идентификатора.<dd>";
hnetworking.page3="<dd>Создает новый пустой сетевой мост для последующего использования. STP (Spanning Tree Protocol) – протокол связующего дерева, а вместе с функцией PRIO вы можете выставить порядок приоритетности мостов. У меньшего числа более высокий приоритет.<dd>";
hnetworking.page4="<dd>Позволяет назначить любой действующий интерфейс к сетевому мосту. Следует установить опции беспроводного интерфейса в режим моста, если вы хотите назначить любой беспроводной интерфейс. Любые системные настройки моста могут быть принудительно изменены в этом поле. <dd><dd>Нажмите <em>Сохранить</em> для сохранения параметров. Нажмите <em>Отменить</em> для отмены всех несохраненных изменений.</dd>";

// ** QoS.asp **//
qos.titl="Качество обслуживания";
qos.h2="Качество обслуживания (QoS)";
qos.legend="Установки QoS";
qos.srv="Запустить QoS";
qos.type="Планировщик пакетов";
qos.aqd="Порядок очередности";
qos.aqd_sfq="SFQ";
qos.aqd_codel="CODEL";
qos.aqd_fqcodel="FQ_CODEL";
qos.uplink="Исходящий поток (Кб/с)";
qos.dnlink="Входящий поток (Кб/с)";
qos.gaming="Оптимизация для игр";
qos.legend2="Приоритеты служб";
qos.prio_x="Неограниченный";
qos.prio_p="Премиум";
qos.prio_e="Срочный";
qos.prio_b="Основная масса";
qos.legend3="Приоритеты сетевых адресов";
qos.ipmask="IP/маска";
qos.maxrate_b="Макс. Кбит";
qos.maxuprate_b=" Макс. Кбит исходящ.";
qos.maxdownrate_b="Макс. Кбит входящ.";
qos.maxlanrate_b="LAN Max";
qos.maxrate_o="Макс. скорость";
qos.legend4="Приоритеты MAC-адресов";
qos.legend5="Приоритеты портов Ethernet";
qos.legend6="Ширина канала по умолчанию";
qos.legend7="Приоритет пакетов TCP ";
qos.pktdesc="Приоритет малых пакетов TCP со следующими параметрами:";
qos.pktack="ACK";
qos.pktrst="RST";
qos.pktsyn="SYN";
qos.pktfin="FIN";
qos.enabledefaultlvls="Ограничить для каждого пользователя";
qos.bandwidth="Ширина канала, КБит";
qos.up="Восх.";
qos.down="Нисх.";

//help container
hqos.right1="Исходящий поток:";
hqos.right2="Установите значение 80%-95% (макс.) от вашего лимита скорости передачи.";
hqos.right3="Входящий поток:";
hqos.right4="Установите значение 80%-100% (макс.) от вашего лимита скорости приема.";
hqos.right6="Вы можете управлять потоками данных в зависимости от приложения, занимающего канал.";
hqos.right8="Вы можете назначить приоритет для всего трафика с заданного IP-адреса или диапазона IP-адресов.";
hqos.right10="Вы можете назначить приоритет для всего трафика с устройства в вашей сети путем присвоения имени этому устройству, задания требуемого приоритета и указания его MAC-адреса.";
hqos.right12="Вы можете управлять потоками данных в зависимости от того, к какому физическому сетевому порту присоединено устройство. Вы можете назначить приоритеты для устройств, подключенных к портам LAN 1-4.";

//help page
hqos.page1="<dd>BУправление шириной потока приоритезирует трафик проходящий через маршрутизатор. Интерактивный трафик (телефония, веб-серфинг, telnet и т.п.) более приоритетен, чем трафик с массивами данных (передача файлов, P2P). Основная идея позволить двум типам трафика сосуществовать вместе, при этом менее важные потоки не помешают более критичным процессам. Весь этот процесс более-менее автоматизирован.<br /><br />QoS (качество обслуживания) – позволяет контролировать ширину потока для различных служб, сетевых масок, МАС-адресов и четырех LAN портов. Возможность контроля по портам может отличаться в зависимости от модели маршрутизатора. Если у вас не отображается эта функции, значит ваш маршрутизатор её не поддерживает. QoS разделен на 5 классов пропускной способности: неограниченный, премиум, срочный, стандартный и основная масса. Неклассифицированные службы используют стандартный класс.</dd>";
hqos.page2="<dd>YВам будет необходимо самостоятельно решить в каких случаях использовать QoS для портов Интернет (WAN), локальной сети (LAN) или беспроводной сети (WLAN). (Порты локальной и беспроводной сети внутренне объединены в одну виртуальную сеть). Для большинства случаев следует выбирать опцию Интернет (WAN).</dd>";
hqos.page3="<dd><ul class=\"wide\"><li>HFSC – Hierarchical Fair Service Curve (кривая иерархически честного сервиса). Встраиваемые в интерфейс связки формируют дерево команд, в свою очередь каждая из них формирует дальнейшие дочерние связи. Каждой связи присвоен приоритет и выделен канал. Приоритетность контролирует время, уходящее на подготовку пакета к отсылке, ширина канала влияет на пропускную способность.  HFSC – немного более ресурсоемкая, чем HTB. </li><li>HTB – Hierarchical Token Bucket (иерархический буфер токенов) – более быстрая замена протокола CBQ qdisc в Linux и менее ресурсоемкая, чем HFSC. HTB помогает контролировать использование исходящего потока для заданного канала. HTB позволяет использовать одно физическое соединение для имитирования нескольких более медленных соединений и направлять различные виды трафика по разным имитированным каналам. HTB полезен для ограничения значений трафика загрузки/отдачи клиента, предотвращая монополизацию доступного канала.</li></ul></dd>";
hqos.page4="<dd>Для использования функции QoS вам необходимо ввести значения ширины канала для ваших входящих/исходящих соединений. Обычно это 80% - 95% от максимальной ширины канала. Если вы хотите ограничить ширину канала только для исходящего трафика, установите значение 0 (нет ограничений) в качестве параметра входящего соединения. Не устанавливайте 0 для исходящего. </dd>";
hqos.page5="<dd>Классификация ширины канала основывается на четырех категориях: в первую очередь это физические порты, затем МАС-адресация, затем сетевые маски и, наконец, службы. Например, применяя классификацию, основанную на МАС-адресации, получим приоритет над классами сетевых масок и сервисов. Однако классы локальных портов будут работать вместе с классами МАС, масок и сервисов, и не будут их замещать.<ul class=\"wide\"><li>Неограниченный – (60% - 100%) Этот класс предлагает максимальный приоритет и его не стоит широко использовать.</li><li>Премиум – (25% - 100%) Второй во значимости класс, по умолчанию пакеты \"рукопожатий\" и ICMP относятся именно к нему. Большинство служб VoIP и видео будут хорошо функционировать в этом классе, если срочного уровня будет недостаточно.</li><li>Срочный – (10% - 100%) Это класс для интерактивных приложений, которым для нормальной работы нужен канал шире, чем стандартным приложениям.</li><li>Стандартный – (5% - 100%) Все неклассифицированные службы подпадают под этот класс.</li><li>Основная масса - (1% - 100%) Грузовой класс, использует оставшийся канал только когда остальные классы находятся в режиме ожидания. Если линия уже заполнена трафиком от других классов, то данному классу будет выделено только 1% от установленного ограничения. Класс основной массы следует использовать для Р2Р соединений и загрузочных служб, таких как FTP.</li></ul></dd><dd>Проверьте все значения и нажмите <i>Сохранить</i> для сохранения параметров, но без применения, или нажмите <i>Применить</i> для их постоянного, мгновенного применения. Нажмите <i>Отменить</i> для отмены несохраненных изменений.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Не забудьте Сохранить прежде, чем добавлять новое правило для QoS.</div></div></dd>";

// ** RouteTable.asp **//
routetbl.titl="Таблица маршрутизации";
routetbl.h2="Таблица маршрутизации";
routetbl.th1="Сеть назначения";


// ** Routing.asp **//
route.titl="Маршрутизация";
route.h2="Маршруты";
route.metric="Метрика";
route.flags="Флаги";
route.mod="Режим работы";
route.bgp_legend="Параметры BGP";
route.bgp_ip="Соседний IP";
route.bgp_own_as="Собственный AS# BGP";
route.bgp_as="Соседний AS#";
route.rip2_mod="Маршрутизатор RIP2";
route.olsrd_mod="Маршрутизатор OLSR";
route.olsrd_legend="Маршрутизация OLSR (Optimized Link State Routing)";
route.olsrd_poll="Темп опроса";
route.olsrd_gateway="Режим шлюза";
route.olsrd_hna="Сетевое объявление хоста";
route.olsrd_tc="Избыточность TC";
route.olsrd_mpr="Покрытие MPR";
route.olsrd_lqfe="Link Quality Fish Eye";
route.olsrd_lqag="Link Quality Aging";
route.olsrd_lqdmin="Link Quality Dijkstra Min";
route.olsrd_lqdmax="Link Quality Dijkstra Max";
route.olsrd_lqlvl="Link Quality Level";
route.olsrd_hysteresis="Гистерезис";
route.olsrd_newiface="Новый интерфейс";
route.olsrd_smartgw="Умный шлюз";
route.zebra_legend="Настройка Zebra";
route.zebra_log="Лог Zebra";
route.zebra_copt="Стиль настройки Zebra";
route.bird_legend="Настройка Bird";
route.bird_log="Лог Bird";
route.bird_copt="Стиль настройки Bird";
route.ospf_mod="Маршрутизатор OSPF";
route.ospf_legend="Маршрутизация OSPF";
route.ospf_conf="Конфигурация OSPF";
route.copt_gui="Графический интерфейс";
route.copt_vtysh="Vtysh";
route.ospf_copt="Режим настройки OSPF";
route.gateway_legend="Динамическая маршрутизация";
route.static_legend="Статическая маршрутизация";
route.static_setno="Номер маршрута";
route.static_name="Имя маршрута";
route.static_ip="Cеть назначения";

//help container
hroute.right2="Если данный маршрутизатор поддерживает соединение с Интернетом, выберите режим <em>Шлюз</em>. Если в вашей сети есть другой маршрутизатор, выберите режим <em>Маршрутизатор</em>.";
hroute.right4="Это уникальный номер маршрута, вы можете создать до 20 маршрутов.";
hroute.right6="Введите имя, которое вы хотите дать данному маршруту.";
hroute.right8="Это удаленный хост, для которого вы хотите создать статический маршрут.";
hroute.right10="Определяет размер подсети, в которой находится удаленный хост.";

//help page
hroute.page1="<dd>В разделе Маршрутизация, вы можете настроить режимы маршрутизации и прочие настройки маршрутизатора. Режим <i>Шлюз</i> рекомендуется для большинства пользователей.</dd>";
hroute.page2="<dd>Выберите правильный режим работы. Оставьте базовое значение, Шлюз, если маршрутизатор подключает вашу сеть к Интернету. Выберите Маршрутизатор, если ваш маршрутизатор находится в сети с применением других маршрутизаторов. В режиме Шлюз маршрутизатор преобразовывает сетевые имена, в то время как в других режимах – нет.</dd>";
hroute.page3="<dd>Динамическая маршрутизация позволяет маршрутизатору автоматически подстраиваться к физическим изменениям в топологии сети и обмениваться таблицами маршрутизации с другими маршрутизаторами. Маршрутизатор определяет маршрут сетевых пакетов, основываясь на наименьшем количестве скачков от источника к цели назначения.<br /><br />Для включения функции динамической маршрутизации для Интернета, выберите <i>WAN</i>. Для включения этой функции для локальной и беспроводной сети, выберите <i>LAN и WLAN</i>. Для включения этой функции для обоих направлений (Интернета и локальной сети), выберите вариант <i>Оба</i>. TДля отключения функции динамической маршрутизации для всех процессов передачи данных оставьте значение по умолчанию – <i>Отключить</i>.<br /><br /><div class=\"note\"><b>Примечание:</b><br />Динамическая маршрутизация невозможна при использовании режима Шлюз.</div></dd>";
hroute.page4="<dd>Статическая маршрутизация – предварительно заданный путь по которому сетевая информация должна направляться для достижения указанной точки назначения.<br /><br />Чтобы задать статичный маршрут между маршрутизатором и другой сетью, необходимо:<ol class=\"wide\"><li>Выбрать номер из выпадающего списка статических маршрутов.</li><li>Ввести следующие данные:<ul><li>IP-адрес точки назначения &ndash; адрес сети или сетевого узла, к которому вы присваивайте данный маршрут.</li><li>Маска подсети &ndash; параметр, определяющий какая часть IP-адреса является сетевой частью, а какая – указывает на хост.</li><li>Шлюз &ndash; IP-адрес шлюзового устройства, которое обеспечивает связь между данным маршрутизатором и сетевым узлом.</li></ul></li><li>В зависимости от того, где находится IP-адрес точки назначения, выберите <i>LAN и WLAN</i> или <i>WAN</i> из выпадающего меню. </li><li>Щелкните кнопку <i>Применить</i> для сохранения изменений. Для отмены несохраненных изменений нажмите кнопку <i>Отмена</i> Для установки дополнительных статических маршрутов повторите шаги 1-4.</li></ol><br />Для удаления заданных статических маршрутов:<ol class=\"wide\"><li>Из выпадающего списка статических маршрутов выберите порядковый номер маршрута для удаления.</li><li>Нажмите кнопку <i>Удалить</i>.</li><li>Для сохранения нажмите кнопку <i>Применить</i>. Для отмены удаления нажмите кнопку <i>Отмена</i>.</li></ol></dd>";
hroute.page5="<dd>Нажмите кнопку <i>Отобразить таблицу маршрутизации</i> для просмотра всех действующих маршрутов. Следующие данные будут отображаться для каждой записи:<ul class=\"wide\"><li>IP-адрес точки назначения &ndash; адрес сети или сетевого узла к которому присвоен статический маршрут.</li><li>Маска подсети &ndash; параметр, определяющий какая часть IP-адреса является сетевой частью, а какая – указывает на хост.</li><li>Шлюз &ndash; IP-адрес шлюзового устройства, которое обеспечивает связь между данным маршрутизатором и сетевым узлом.</li><li>Интерфейс &ndash; обозначает, находится ли IP-адреса точки назначения в локальной проводной или беспроводной сети, в Интернете или в интерфейсе обратной связи (фальшивая сеть в которой один компьютер ведет себя как сеть, что бывает необходимо для некоторого ПО).</li></ul><br />Нажмите кнопку <i>Обновить</i> для отображения данных. Нажмите кнопку <i>Закрыть</i> для возврата к окну маршрутизации.</dd>";

// ** Site_Survey.asp **//
survey.titl="Обзор Wi-Fi сетей";
survey.h2="Соседние Wi-Fi сети";
survey.thjoin="Присоединение к сети";


// ** Services.asp **//
service.titl="Службы";
service.h2="Управление службами";

//kaid
service.kaid_legend="XBOX Kaid";
service.kaid_srv="Запустить Kaid";
service.kaid_locdevnum="Число локальных устройств";
service.kaid_uibind="Слушающий порт UI";
service.kaid_orbport="Порт ORB";
service.kaid_orbdeepport="Deep порт ORB";

//DHCPd
service.dhcp_legend="Клиент DHCP";
service.dhcp_vendor="Установить Vendorclass";
service.dhcp_reqip="Запросить IP";
service.dhcp_legend2="Сервер DHCP";
service.dhcp_srv="Демон DHCP";
service.dhcp_jffs2="Хранить БД клиентов в JFFS2";
service.dhcp_nvramlease="Хранить БД клиентов в  NVRAM";
service.dhcp_domain="Используемый домен";
service.dhcp_landomain="Домен LAN";
service.dhcp_option="Дополнительные опции DHCPd";
service.dnsmasq_legend="DNSMasq";
service.dnsmasq_srv="DNSMasq";
service.dnsmasq_loc="Локальный DNS";
service.dnsmasq_no_dns_rebind="Отключить DNS Rebind";
service.dnsmasq_opt="Дополнительные опции DNSMasq";

//pptp.webservices
service.pptp_legend="PPTP";
service.pptp_srv="Сервер PPTP";
service.pptp_client="IP-адрес(а) клиентов";
service.pptp_chap="CHAP-Secrets";
	
//syslog.webservices
service.syslog_legend="Системный журнал";
service.syslog_srv="Syslogd";
service.syslog_ip="Удаленный сервер";

//telnet.webservices
service.telnet_legend="Telnet";
service.telnet_srv="Telnet";

//pptpd_client.webservices
service.pptpd_legend="Клиент PPTP";
service.pptpd_option="Опции клиента PPTP";
service.pptpd_ipdns="IP или имя DNS сервера";
service.pptpd_subnet="Удаленная подсеть";
service.pptpd_subnetmask="Маска удаленной подсети";
service.pptpd_encry="MPPE шифрование";
service.pptpd_mtu="MTU";
service.pptpd_mru="MRU";
service.pptpd_nat="NAT";
service.dns1="DNS1";
service.dns2="DNS2";
service.wins1="WINS1";
service.wins2="WINS2";

//rflow.webservices
service.rflow_legend="RFlow / MACupd";
service.rflow_srv1="RFlow";
service.rflow_srv2="MACupd";

//pppoe-relay.webservices
service.pppoe_legend="Ретрансляция PPPoE";
service.pppoe_srv="Ретрансляция";

//pppoe-server.webservices
service.pppoesrv_legend="Сервер PPPoE";
service.pppoesrv_srv="Демон сервера RP-PPPoE";
service.pppoesrv_srvopt="Опции сервера RP-PPPoE";
service.pppoesrv_compr="Сжатие";
service.pppoesrv_remoteaddr="Начальный IP удаленной сети";
service.pppoesrv_remotenet="IP удаленной сети";
service.pppoesrv_remotemask="Маска удаленной сети";
service.pppoesrv_lcpei="Интервал эха LCP";
service.pppoesrv_lcpef="Неуспешное эхо LCP";
service.pppoesrv_idlet="Время бездействия";
service.pppoesrv_auth="Аутентификация";
service.pppoesrv_radip="IP сервера Radius";
service.pppoesrv_radauthport="Порт аутентификации Radius";
service.pppoesrv_radaccport="Порт учета Radius";
service.pppoesrv_radkey="Разделяемый ключ Radius";
service.pppoesrv_chaps="Управление локальными пользователями (CHAP Secrets)";
service.pppoesrv_limit="Лимит сессий на MAC адрес";

//help container
hpppoesrv.right2="IP: 0.0.0.0 -> Вы получите IP из пула адресов";
hpppoesrv.right3="Вы должны установить правильное число клиентских устройств согласно вашему диапазону IP адресов";

//help page
hpppoesrv.page1="<dd>PPPoE сервер.....<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Обратите внимание....</div></div></dd>";
hpppoesrv.page2="<dd>Нажмите <i>Сохранить</i> для сохранения параметров или нажмите <i>Отменить</i> для отмены несохраненных изменений.</dd>";

//snmp.webservices
service.snmp_legend="SNMP";
service.snmp_srv="SNMP";
service.snmp_loc="Расположение";
service.snmp_contact="Контакт";
service.snmp_name="Имя";
service.snmp_read="RO Community";
service.snmp_write="RW Community";

//openvpn.webvpn
service.vpnd_legend="OpenVPN сервер/демон";
service.vpnd_srv="OpenVPN";
service.vpnd_starttype="Запускать при:";
service.vpnd_startWanup="Поднятии WAN";
service.vpnd_startSystem="Старте системы";
service.vpnd_crl="Список аннулированных сертификатов";
service.vpnd_config="Дополнительные настройки";
service.vpnd_dhpem="DH PEM";
service.vpnd_tlsauth="Ключ авторизации TLS";
service.vpnd_cert="Сертификат публичного сервера";
service.vpnd_key="Ключ приватного сервера";
service.vpnd_pkcs="Ключ PKCS12";
service.vpnd_mode="Режим сервера";
service.vpnd_net="Сеть";
service.vpnd_mask="Сетевая маска";
service.vpnd_startip="Начало диапазона IP";
service.vpnd_endip="Конец диапазона IP";
service.vpnd_cl2cl="Разрешить соединение Клиент-Клиент";
service.vpnd_switch="Настроить как";
service.vpnd_dupcn="Разрешить дупликацию cn";
service.vpnd_proxy="Режим DHCP-Прокси";
service.vpnd_clcon="Скрипт при подключении клиента";
service.vpnd_ccddef="CCD-Dir файл по умолчанию";
service.vpnd_dhcpbl="Блокировка DHCP через туннель";
service.vpnd_static="Статичный ключ";
service.vpn_redirgate="Перенаправить шлюз по умолчанию";
service.vpn_legend="Клиент OpenVPN";
service.vpn_srv="Запустить OpenVPN";
service.vpn_ipname="IP/имя сервера";
service.vpn_mtu="Параметры TUN MTU";
service.vpn_mss="TCP MSS";
service.vpn_fragment="UDP фрагмент туннеля";
service.vpn_compress="Использовать сжатие LZO";
service.vpn_cl2cl="Разрешить подключение Клиент-Клиент";
service.vpn_tunnel="Протокол туннеля";
service.vpn_tuntap="Туннельное устройство";
service.vpn_srvcert="Публичный сертификат сервера";
service.vpn_clicert="Публичный сертификат клиента";
service.vpn_certtype="nsCertType";
service.vpn_clikey="Личный ключ пользователя";
service.vpn_nat="NAT";
service.vpn_cipher="Шифр";
service.vpn_auth="Алгоритм хеширования";
service.vpn_bridge="Объеденить туннель в мост с br0";
service.vpn_adv="Дополнительные настройки";
service.vpn_tlscip="Шифр TLS";
service.vpn_route="Политика маршрутизации ";
service.vpnd_server="Сервер";
service.vpnd_deamon="Демон";
service.vpnd_lzoyes="Да";
service.vpnd_lzono="Нет";
service.vpnd_lzooff="Off";
service.vpnd_lzoadaptive="Адаптивно";

//help page
hservice.page1="<dd>Функция DHCPd присваивает IP адреса вашим локальным устройствам. Тогда как основные параметры конфигурации маршрутизатора находятся в меню Настройка, здесь вы можете указать некоторые дополнительные функции.<ul class=\"wide\"><li>Используемый домен &ndash; здесь можно установить домен, который будет задан клиентам DHCP как локальный домен. Это может быть как локальный домен, так и внешний домен.</li><li>Домен LAN &ndash; здесь можно указать домен локальной сети, который можно использовать как домен для DNSmasq и службы DHCP, если указано в параметре выше.</li><li>Статические назначения &ndash; при помощи данной функции можно присвоить определенным хостам в сети заданные IP-адреса. Это также является способом добавить узлы с фиксированными адресами к локальной службе DNS (DNSmasq) маршрутизатора.</li></ul><br/>Также есть дополнительные опции, которые можно настроить в <em>Дополнительные опции DHCPD</em>.</dd>";
hservice.page2="<dd>DNSmasq – локальный сервер DNS. Он преобразовывает все локальные хост-имена, известные маршрутизатору от службы DHCP (динамические и статические), и перенаправляет кэшированные значения DNS с удаленных DNS серверов. <em>Локальный DNS</em> позволяет DHCP-клиентам в локальной сети преобразовывать статические и динамические DHCP хост-имена.<br/>Также есть дополнительные опции, которые можно настроить в <em>Дополнительные опции DNSMasq</em>. Например: <br/><ul><li>Статическое присвоение: dhcp-host=AB:CD:EF:11:22:33,192.168.0.10,myhost,myhost.domain,12h</li><li>Максимальное время аренды: dhcp-lease-max=2</li><li>Диапазон IP для DHCP: dhcp-range=192.168.0.110,192.168.0.111,12h</li></ul><br/><br/><div class=\"note\"><h4>Примечание</h4><div>Все опции сохраняются в файл /tmp/dnsmasq.conf в формате одна опция на строку.<br/>Полный список доступных опций: <a href=\"http:\/\/thekelleys.org.uk/dnsmasq/docs/dnsmasq-man.html\" target=\"_new\">DNSMasq man</a>.</div></div></dd>";
hservice.page3="<dd>Kai - средство для соединения игровых платформ через Интернет. Включите данную службу и добавьте МАС-адреса Xbox, разделяя их \";\".<ul class=\"wide\"><li>";
hservice.page4=" &ndash; количество консолей для обнаружения перед тем, как движок не заблокирует фильтр pcap. Установка этого параметра на значение 0 означает, что движок никогда не блокируется, т.е. вы можете использовать сколько угодно консолей, но это скажется на производительности, особенно если сеть загружена другим трафиком. Наилучший вариант – установить максимальное число равное количеству имеющихся у вас консолей (по умолчанию оно равно 1, т.к. чаще всего в сети не более одной консоли).</li><li>";
hservice.page5=" &ndash; указывает какой IP или Kaid порт будет прослушивать идентификаторы контроллера.</li></ul><br/><div class=\"note\"><h4>Примечание</h4><div>Xbox Xbox должен быть подключен напрямую к одному из портов Ethernet маршрутизатора.</div></div></dd>";
hservice.page6="<dd>RFlow коллектор – инструмент мониторинга и управления трафиком, позволяющий следить за всей сетью маршрутизаторов DD-WRT.<br/><ul class=\"wide\"><li>RFlow порт по умолчанию – 2055</li><li>MACupd порт по умолчанию – 2056</li><li>Интервал = 10 – сообщения отправляются на сервер каждые 10 секунд</li><li>Интерфейс: выберите интерфейс для мониторинга.</li></ul><br/><div class=\"note\"><h4>Примечание</h4><div>Для каждого значения RFlow и IP сервера MACupd: Введите IP-адрес слушающего сервера (ПК на win32 с коллектором RFlow).</div></div></dd>";
hservice.page7="<dd>Включение SSHd позволяет вам получить доступ к системе Linux на вашем маршрутизаторе при помощи клиентского ПО SSH (из-под Windows, например, хорошо работает Putty).<ul class=\"wide\"><li>Вход по паролю &ndash; позволяет войти при помощи пароля маршрутизатора (имя пользователя – <tt>root</tt>)</li><li>Порт &ndash; номер порта для SSHd (по умолчанию 22)</li><li>Авторизированные ключи &ndash; здесь можно вставить свои общественные ключи, чтобы использовать вход на основе ключа (более безопасно, чем простой пароль).</li></ul></dd>";
hservice.page8="<dd>Включить Syslogd для захвата системных сообщений. По умолчанию они записываются в локальный файл \/var\/log\/messages. Для пересылки их на другую систему введите IP-адрес удаленного сервера Syslog.</dd>";
hservice.page9="<dd>Включите сервер telnet для подключения к маршрутизатору через протокол telnet. Имя пользователя – <tt>root</tt>, а пароль – пароль маршрутизатора.<br/><br/><div class=\"note\"><h4>Примечание</h4><div>Если маршрутизатор используется в окружении с низкой степенью доверия (публичная точка доступа), то крайне рекомендуется не использовать Telnet, а использовать SSH.</div></div></dd><dd>Проверьте все значения и щелкните <em>Сохранить</em> для сохранения настроек. Нажмите <em>Отменить</em> для отмены несохраненных изменений. Нажмите <em>RПерегрузить маршрутизатор</em> для его мгновенной перезагрузки.</dd>";

//help container
hstatus_vpn.right1=" Политика маршрутизации :<br><i>Добавьте IP/сеть в виде 0.0.0.0/0 для принудительного использования туннеля как шлюза по умолчанию. По одному значению на IP/сеть.<br><i>Адрес IP/Маска сети</i><br>Должны быть заданы при использовании режима DHCP-прокси и при условии, что туннель НЕ объединен мостом</i>";
hstatus_vpn.right2=" Дополнительные установки:<br><i>Для настройки маршрутизации у клиентов добавить  \'push \"route IP mask gateway\"\', для настройки DNS/WINS добавить \'push \"dhcp-option DNS (or WINS) IP\"\' в конфигурацию.</i><br>Директория подключения клиентов:<br><i>Если USB или JFFS подключен к /jffs, будут вызваны скрипты из /jffs/etc/openvpn/ccd/</i>";
hstatus_vpn.right3="Общие моменты:<br><i>Поддерживается 3 метода аутентификации: pkcs12 (+dh на сервере), статическая и стандартные сертификаты. Включайте MSS только на одной из сторон подключения, а фрагментацию – на обеих.</i>";

//help page
hstatus_vpn.page1="<dd>Технология VPN от Microsoft и других поставщиков решений удаленного доступа. Она встроена в Windows XP. Конфигурация этой функции позволяет получить удаленный доступ к вашей локальной сети.<ul class=\"wide\"><li>IP сервера &ndash; адрес IP вашего маршрутизатора.</li><li>Клиентский IP &ndash; список или диапазон IP-адресов для удаленно подключаемых устройств. Этот диапазон не должен пересекаться с адресами DHCP (например, 192.168.0.2,192.168.0.3), диапазоном (например, 192.168.0.1-254 или 192.168.0-255.2) или комбинации (например, 192.168.0.2,192.168.0.5-8).</li><li>CHAP-Secrets &ndash; список имен пользователей и паролей для входа в сеть VPN, вводить по одному пользователю в строку (например, joe * joespassword *). Для дополнительной информации смотреть страницу PPPD MAN.</li></ul></dd>";
hstatus_vpn.page2="<dd>VPN Клиент – ПО, позволяющее подключаться к VPN серверам от Microsoft и поставщиков решений удаленного доступа. Данная конфигурация позволяет маршрутизатору создать виртуальную частную сеть с удаленной локальной сетью.<ul class=\"wide\"><li>IP сервера или имя DNS сервера  &ndash; – IP-адрес или имя DNS сервера VPN к которому вы хотели бы подключится (например: www.MyServer.com). </li><li>Удаленная подсеть &ndash; удаленная подсеть той сети, с которой вы осуществляете подключение (например, 192.168.2.0). </li><li>Маска удаленной подсети &ndash; маска удаленной подсети сети, к которой вы осуществляете подключение (например, 255.255.255.0). </li><li>MPPE шифрование &ndash; тип безопасного соединения, который вы используете. Если вы подключаетесь к другому маршрутизатору с DD-WRT, вам понадобится, например, mppe required. Но если вы подключаетесь к Windows VPN серверу, вам понадобится, например, mppe required,no40,no56,stateless или mppe,no40,no56,stateful. </li><li>MTU &ndash; максимальная единица передачи (по умолчанию: 1450) </li><li>MRU &ndash; максимальная единица приема (по умолчанию: 1450) </li><li>Имя пользователя &ndash; ведите имя пользователя, которое вы используете для подключения к серверу VPN. Если вы подключаетесь к другому серверу PPTP на базе Linux, то вам только понадобится ввести имя пользователя (например, root). Но если вы подключаетесь к серверу VPN с Windows ОС необходимо будет ввести имя сервера и имя пользователя (например, DOMAIN\\\\UserName). </li><li>Пароль  &ndash; Eвведите пароль для этого пользователя. </li></ul></dd><dd>Проверьте все значения и щелкните <i>Сохранить</i> для сохранения параметров. Нажмите <i>Отменить</i> для отмены несохраненных изменений.</dd>";

//vnc.repeater
service.vncrepeater_legend="VNC";
service.vncrepeater="Повторитель VNC";

//sshd.webservices
service.ssh_legend="Secure Shell";
service.ssh_srv="SSHd";
service.ssh_password="Вход по паролю";
service.ssh_key="Авторизованные ключи";
service.ssh_forwarding="Перенаправление TCP SSH";

//radiooff.webservices
service.radiooff_legend="Кнопка SES / AOSS / EZ-SETUP / WPS";
service.radiooff_srv="Эта кнопка отключает Wi-Fi";
service.radiooff_bootoff="Отключить Wi-Fi при загрузке";
service.radiooff_legend_aoss="Функция кнопки AOSS";
service.radiooff_srv_aoss="AOSS";
service.radiooff_srv_disabled="Не использовать";

//ses.webservices ====> might replace the above radiooff_button
service.ses_legend="Кнопка SES / AOSS / EZ-SETUP";
service.ses_srv="Реакция на кнопку";
service.ses_toggleradio="Включить/отключить Wi-Fi";
service.ses_script="Скрипт пользователя";

//hwmon.webservices
service.hwmon_legend="Мониторинг оборудования";
service.hwmon_critemp="Критическая температура (включить кулер)";
service.hwmon_hystemp="Рабочая температура (отключить кулер)";

//rstat.webservices
service.rstats_legend="Мониторинг пропускной способности";
service.rstats_srv="Демон rstats";
service.rstats_path="Сохранять данные в";
service.rstats_time="Интервал сохранения";
service.rstats_usrdir="каталог пользователя";

//nstx.webservices
service.nstx_legend="Туннель IP через DNS";
service.nstx_srv="Демон nstx";
service.nstx_ipenable="Связать только с данным IP";
service.nstx_log="Включить отладочные сообщения";

//ttraff.webservices
service.ttraff_legend="Счетчик трафика WAN";
service.ttraff_daemon="Демон ttraff";

//notifier.webservices
service.warn_legend="Служба уведомлений о соединениях";
service.warn="Служба уведомлений";
service.warn_limit="Макс. число подключений";
service.warn_server="Сервер SMTP";
service.warn_from="Адрес эл.почты отправителя";
service.warn_fromfull="Полное имя отправителя";
service.warn_to=" Адрес эл.почты получателя";
service.warn_domain="Домен получателя";
service.warn_user="Имя пользователя на серв. SMTP";
service.warn_pass="Пароль на сервере SMTP";

service.samba3_srv="Samba";
service.samba3_srvstr="Серверная строка";
service.samba3_pub="Папка общего доступа";
service.samba3_config="Дополнительные настройки";
service.samba3_workgrp="Рабочая группа";
service.samba3_dirpath="Путь к файлам";
service.samba3_usr1="Пользователь1";
service.samba3_pass1=" Пароль1";
service.samba3_usr2=" Пользователь2";
service.samba3_pass2="  Пароль2";
service.samba3_pubacl="Только чтение";
service.samba3_advanced="Дополнительно"
service.samba3_custom="Использовать дополнительные настройки";
service.samba3_shares="Общие папки";
service.samba3_share_path="Путь";
service.samba3_share_subdir="Поддиректория";
service.samba3_share_label="Имя";
service.samba3_share_public="Публичная";
service.samba3_share_access="Доступ";
service.samba3_users="Пользователи";
service.samba3_username="Имя пользователя";
service.samba3_password="Пароль";
service.samba3_user_shares="Доступ к общим папкам";
service.dlna_type_audio="Аудио";
service.dlna_type_video="Видео";
service.dlna_type_images="Изображения";
//milkfish.webservices
service.milkfish_siprouter="Milkfish SIP";
service.milkfish_alias="Псевдоним";
service.milkfish_uri="SIP URI";
service.milkfish_mainswitch="Основной коммутатор";
service.milkfish_fromswitch="From-Substitution";
service.milkfish_fromdomain="From-Domain";
service.milkfish_username="Имя пользователя Milkfish";
service.milkfish_password="Пароль Milkfish";
service.milkfish_audit="Аудит Milkfish";
service.milkfish_siptrace="Трассировка SIP";
service.milkfish_subscribers="Локальные подписчики";
service.milkfish_aliases="Локальные псевдонимы";
service.milkfish_dynsip="Динамический SIP";
service.milkfish_status="Статус SIP";
service.milkfish_database="База данных SIP";
service.milkfish_messaging="Сообщения SIP";
service.milkfish_phonebook="Адресная книга SIP";
service.milkfish_dynsipdomain="Домен DynSIP";
service.milkfish_dynsipurl="Обновление URL DynSIP";
service.milkfish_dsusername="Имя пользователя DynSIP";
service.milkfish_dspassword="Пароль DynSIP";
service.milkfish_sipmessage="Сообщение SIP";
service.milkfish_destination="Назначение SIP";
service.milkfish_contact="Контакт";
service.milkfish_agent="User Agent";
service.milkfish_registrations="Активные регистрации";
service.milkfish_localsubscr="Локальные подписчики";
service.milkfish_localalias="Локальные псевдонимы";
service.milkfish_messaging="Сообщения SIP";
service.milkfish_siptrace="Трассировка SIP";
service.milkfish_advdynsip="Расширенные настройки DynSIP";
service.milkfish_answers="Проблемы, вопросы, предложения? – Ищите ответы на <a href=\"http:\/\/forum.milkfish.org\" target=\"_blank\">Форуме пользователей Milkfish-dd</a>";

//service.milkfish_="";//
service.hmilkfish_right2="Включает/отключает ваш маршрутизатор Milkfish SIP.";
service.hmilkfish_right4="Включает/отключает подмену From:-Headerfield вашего WAN IP в исходящих сообщениях SIP. Эта опция должна быть включена, если вы хотите позволить вызываемым делать обратные вызовы при изменении вашего IP-адреса";
service.hmilkfish_right6="Вызываемый при обратном вызове вызывает данный домен (вместо вашего IP-адреса). Чтобы эта опция действовала, необходимо включить также опцию From-Substitution";
service.hmilkfish_right8="Здесь задается ваше имя пользователя в  Milkfish Community Forum – оно выдается при регистрации на yourname.homesip.net";
service.hmilkfish_right10="Здесь задается ваш пароль в  Milkfish Community Forum – он выдается при регистрации на yourname.homesip.net";
service.hmilkfish_right12="Включает/отключает базовую трассировку SIP на вашем маршрутизаторе";
service.hmilkfish_right14="Локальные подписчики SIP – это локально управляемые учетные записи SIP";
service.hmilkfish_right16="Псевдонимы SIP – это перенаправление, аналогичное перенаправлению E-mail. Могут быть использованы для перенаправления буквенно-цифровых учетных записей в цифровые учетные записи телефонных пользователей и наоборот";
service.hmilkfish_right18="Включает/отключает динамический SIP (т.е. службу Homesip.net). Требуется задание имени пользователя и пароля";
service.hmilkfish_right20="пока не реализовано – оставьте поле пустым";
service.hmilkfish_right22="пока не реализовано – оставьте поле пустым";
service.hmilkfish_right24="пока не реализовано – оставьте поле пустым";
service.hmilkfish_right26="пока не реализовано – оставьте поле пустым";
//service.hmilkfish_="";//

//help page
service.hmilkfish_page1="<dt>Milkfish-dd - Professional VoIP/IM Router - v1.0</dt><ul class=\"wide\"> <br><b>Добро пожаловать в настройки Milkfish под DD-WRT.</b><br>Milkfish позволяет использование и управление несколькими телефонами SIP, несмотря на наличие функции NAT (преобразования сетевых адресов).<br><br><u>Провайдерская конфигурация телефона</u>: IP-адрес маршрутизатора является исходящим прокси <b>Outbound Proxy</b> или исходящим сервером <b>Outbound Server</b> для исходящих потоков и <b>STUN отключен</b> (утилиты прохождения сессий для NAT).<br>Все прочие настройки необходимо выставить в соответствии с параметрами полученными от провайдера.<br><br><u>Локальная конфигурация телефона</u>: IP-адрес этого маршрутизатора является <b>SIP сервером</b> или <b>Регистрационным сервером</b> и добавлена <b>Учетная запись локальной подписки</b>.<br><br>Динамическому SIP для работы необходима действующая учетная запись. Пользователей Homesip необходимо зарегистрировать на форуме Milkfish.<br></ul><br /><div class=\"note\"><h4>Получить поддержку...</h4><div><br />Документацию по встроенному ПО можно найти по адресу: <a href=\"http:\/\/wiki.milkfish.org\" target=\"new\">wiki.milkfish.org</a>.<br>Все вопросы можно адресовать в форум <a href=\"http:\/\/forum.milkfish.org\" target=\"new\">forum.milkfish.org</a>.</div></div><br /><div class=\"note\"><h4>Поддержать...</h4><div><br />Вам понравился Milkfish? Тогда поддержите нас <b>donations@milkfish.org</b>:&nbsp;&nbsp;<br />";
service.hmilkfish_page2="<div class=\"note\"><h4>Правовые вопросы</h4><div>Copyright &copy; 2005-2008 by <a href=\"http:\/\/www.milkfish.org\" target=\"new\">The Milkfish Project</a>. Все права зарезервированы.<br />Логотипы и торговые марки являются собственностью их непосредственных владельцев.<br />The ПО Milkfish лицензируется открытой лицензией <a href=\"http:\/\/www.gnu.org/licenses/gpl.html\" target=\"new\">GNU General Public License</a>.<br />Доводим до сведения, что данное ПО находится на стадии разработки и поставляется абсолютно без каких-либо гарантий, за исключением моментов, установленных законодательством.</div></div><br /><div class=\"note\"><div class=\"center\">Milkfish разрабатывается...<br><a target=\"_blank\" href=\"http:\/\/www.sipwerk.com\"><img border=\"1\" src=\"../images/sipwerk.png\" alt=\"sipwerk logo\" /></a><br></div><br /></div><br /></dd><dd>Нажмите <i>Сохранить</i> для сохранения параметров или нажмите <i>Отменить</i> для отмены несохраненных изменений.</dd>";

service.samba3_srv="Samba";
service.samba3_srvstr="Серверная строка";
service.samba3_pub="Папка общего доступа";
service.samba3_config="Дополнительные настройки";
service.samba3_workgrp="Рабочая группа";
service.samba3_dirpath="Путь к файлам";
service.samba3_usr1="Пользователь1";
service.samba3_pass1=" Пароль1";
service.samba3_usr2=" Пользователь2";
service.samba3_pass2="  Пароль2";
service.samba3_pubacl="Только чтение";
service.samba3_advanced="Дополнительно"
service.samba3_custom="Использовать дополнительные настройки";
service.samba3_shares="Общие папки";
service.samba3_share_path="Путь";
service.samba3_share_subdir="Поддиректория";
service.samba3_share_label="Имя";
service.samba3_share_public="Публичная";
service.samba3_share_access="Доступ";
service.samba3_users="Пользователи";
service.samba3_username="Имя пользователя";
service.samba3_password="Пароль";
service.samba3_user_shares="Доступ к общим папкам";
service.dlna_type_audio="Аудио";
service.dlna_type_video="Видео";
service.dlna_type_images="Изображения";

// Zabbix
service.zabbix_legend="Zabbix";
service.zabbix_cl="Клиент";
service.zabbix_serverip="IP адрес сервера Zabbix";
service.zabbix_usrpara="Пользовательские настройки";

//TRansmission
service.transmission_legend="Bittorrent";
service.transmission_srv="Демон Transmission";
service.transmission_dir="Папка Transmission";

// ** eop-tunnel.asp **//
eoip.titl="Туннель EoIP";
eoip.tunnel="Туннель";
eoip.legend="Туннель Ethernet Over IP";
eoip.srv="Туннель EoIP";
eoip.remoteIP="Удаленный IP-адрес";
eoip.tunnelID="Идентификатор туннеля";
eoip.comp="Сжатие";
eoip.passtos="Транзит TOS";
eoip.frag="Фрагмент";
eoip.mssfix="mssfix";
eoip.shaper="шейпер";
eoip.bridging="Создание моста";

//help page
heoip.page1="<dd>Туннелирование Ethernet over IP (EoIP) позволяет вам создать туннель через Ethernet подключение между двумя маршрутизаторами поверх IP соединения. Интерфейс EoIP отображается как локальный интерфейс Ethernet. Когда включена функция подобного моста между маршрутизаторами, весь трафик Ethernet (все протоколы Ethernet) объединяется так, будто подключение осуществляется непосредственно к маршрутизатору.<br/>Возможные установки интерфейса EoIP: <br/><ul><li>Возможность создавать мост между локальными сетями через Интернет</li><li>Возможность создавать мост между локальными сетями через туннель с шифрованием</li><li>Возможность создавать мост между локальными сетями по беспроводному протоколу 802.11b в режиме 'ad-hoc' (пиринговая сеть)</li></ul></dd>";

// ** Sipath.asp + cgi **//
sipath.titl="Обзор SiPath";
sipath.phone_titl="Адресная книга";
sipath.status_titl="Статус";


// ** Status_Lan.asp **//
status_lan.titl="Статус LAN";
status_lan.h2="Локальная сеть";
status_lan.legend="Статус LAN";
status_lan.h22="Протокол динамической конфигурации хостов (DHCP)";
status_lan.legend2="Статус DHCP";
status_lan.legend3="Клиенты DHCP";
status_lan.legend4="Активные клиенты";
status_lan.legend5="Подключенные клиенты PPTP";
status_lan.legend6=" Подключенные клиенты PPPoE";
status_lan.concount="Число сессий";
status_lan.conratio="Процент";

//help container
hstatus_lan.right2="Это MAC-адрес маршрутизатора в вашей локальной проводной сети.";
hstatus_lan.right4="Это IP-адрес маршрутизатора в вашей локальной проводной сети.";
hstatus_lan.right6="Здесь отображается маска подсети для локальной сети.";
hstatus_lan.right8="Если маршрутизатор используется как сервер DHCP, здесь будут указаны параметры сервера.";
hstatus_lan.right10="Щелкнув по любому MAC-адресу, вы получите соответствующий уникальный идентификатор производителя (Organizationally Unique Identifier, OUI) сетевого интерфейса (будет выполнен поиск OUI в базе данных IEEE).";

//help page
hstatus_lan.page1="<dd> данном окне состояния отображаются настройки и состояние локальной сети. В данном окне корректировки невозможны.</dd><dt>MAC-адрес</dt><dd>Тут отображен MAC-адрес интерфейса LAN.</dd><dt>IP-адрес и маска подсети</dt><dd>Тут отображены текущие параметры адреса IP и маски подсети маршрутизатора так, как они видны пользователям вашей локальной сети.</dd><dt>Сервер DHCP</dt><dd>Тут отображено состояние функции DHCP сервера.</dd><dt>Начальный/конечный IP-адрес</dt><dd>Первый и последний адрес IP, который сервер DHCP может предоставить клиентам.</dd><dt>Список клиентов DHCP</dt><dd>Для отображения всех текущих аренд IP-адресов, выданных сервером DHCP, нажмите кнопку <i>Таблица клиентов DHCP</i>.</dd>";

// ** Status_Bandwidth.asp **//
status_band.titl="Мониторинг загрузки сетей";
status_band.h2="Мониторинг загрузки сетей";
status_band.chg_unit="Сменить единицы на ";
status_band.chg_scale="Автомасштаб";
status_band.chg_error="Невозможно получить данные об интерфейсе";
status_band.chg_collect_initial="Получение исходных данных, подождите, пожалуйста...";
status_band.strin="Входящ.";
status_band.strout="Исходящ.";
status_band.follow="текущ.";
status_band.up="макс.";

//help container
hstatus_band.svg="Для отображения графиков загрузки сетей требуется плагин SVG фирмы Adobe.";
hstatus_band.right1="Щелкните по надписи для смены единиц измерения (байт/с или бит/с).";
hstatus_band.right2="Щелкните по надписи для выбора способа масштабирования.";

// ** Status_Router.asp **//
status_router.titl="Состояние маршрутизатора";
status_router.h2="Сведения о маршрутизаторе";
status_router.legend="Система";
status_router.sys_model="Модель маршрутизатора";
status_router.sys_firmver="Версия прошивки";
status_router.sys_time="Текущее время";
status_router.sys_up="Время работы";
status_router.sys_load="Средняя загрузка";
status_router.sys_kernel="Версия ядра";
status_router.legend2="Процессор";
status_router.cpu="Модель процессора";
status_router.cores="Ядра CPU";
status_router.clock="Частота процессора";
status_router.legend3="Память";
status_router.mem_tot="Всего доступно";
status_router.mem_free="Свободная";
status_router.mem_used="Используется";
status_router.mem_buf="Буфера";
status_router.mem_cached="Кэш";
status_router.mem_active="Активная";
status_router.mem_inactive="Неактивная";
status_router.mem_hidden="Скрыто"; // do not translate this line, this is bogus (BrainSlayer)
status_router.legend4="Сеть";
status_router.net_maxports="Макс. число портов IP-фильтра";
status_router.net_conntrack="Активные IP-соединения";
status_router.notavail="Недоступно";
status_router.legend6="Использование дискового пространства";
status_router.inpvolt="Напряжение питания";
status_router.cputemp="Температура процессора";

//help container
hstatus_router.right2="Это имя маршрутизатора, которое задается на вкладке <i>Установка</i>.";
hstatus_router.right4="Это MAC-адрес маршрутизатора, который видит ваш провайдер.";
hstatus_router.right6="Это текущая версия прошивки маршрутизатора.";
hstatus_router.right8="Это время, полученное от сервера NTP. Выбрать сервер можно на вкладке <em>" + bmenu.setup + " | " + bmenu.setupbasic + "</em>.";
hstatus_router.right10="Это время, прошедшее с момента последней перезагрузки системы.";
hstatus_router.right12="Эти три числа представляют собой загрузку системы в течение последней минуты, последних пяти и пятнадцати минут.";

//help page
hstatus_router.page1="dd>Данное окно состояния отображает текущее состояние маршрутизатора. Вся информация доступна в формате только для чтения.</dd><dt>Версия прошивки </dt><dd>Здесь отображается номер версии прошивки, установленной в данный момент. При каких-либо проблемах с маршрутизатором обновление прошивки следует производить только из раздела Обновление. Посетите <a href=\"http:\/\/www.dd-wrt.com\" target=\"_new\">www.dd-wrt.com</a> для получение дополнительной информации по обновлению.</dd><dt>Текущее время</dt><dd>Здесь отображается текущие дата и время.</dd><dt>MAC-адрес </dt><dd>MAC-адрес интерфейса подключения к Интернету.</dd><dt>Имя маршрутизатора</dt><dd>Показывает имя, заданное для этого маршрутизатора.</dd><dt>Модель маршрутизатора</dt><dd>Информация о производителе и модели маршрутизатора.</dd><dt>Модель процессора</dt><dd>Отображает тип и ревизию центрального процессора.</dd><dt>Частота процессора</dt><dd>Показывает частоту процессора.</dd><dt>Имя хоста</dt><dd>Имя хоста – это имя маршрутизатора. Данное значение обязательно для некоторых поставщиков услуг доступа в Интернет.</dd><dt>Тип конфигурации</dt><dt>IP-адрес, Маска подсети, Шлюз по умолчанию</dt><dd>Здесь отображены IP-адрес в Интернете, маска подсети и IP-адрес шлюза по умолчанию в том виде, как они видны внешним пользователям сети Интернет.</dd><dt>DNS</dt><dd>Здесь отображаются IP-адреса DNS (системы доменных имен), используемые маршрутизатором в данный момент. Использование нескольких IP-адресов DNS – частое явление. Обычно используется первое из доступных значений DNS.</dd><dt>Трафик</dt><dd>Тут отображается информация об Интернет трафике (весь с момента последней перезагрузки или за последний месяц).</dd>";

// ** Status_Internet.asp **//
status_inet.titl="Статус WAN";
status_inet.h11="WAN";
status_inet.conft="Тип конфигурации";
status_inet.www_loginstatus="Статус подключения";
status_inet.wanuptime="Длительность подключения";
status_inet.leasetime="Оставшееся время аренды";
status_inet.traff="Трафик";
status_inet.traff_tot="Общий трафик";
status_inet.traff_mon="Трафик за месяц";
status_inet.traffin="Входящий";
status_inet.traffout="Исходящий";
status_inet.previous="Предыдущий месяц";
status_inet.next="Следующий месяц";
status_inet.dataadmin="Управление данными о трафике";
status_inet.delete_confirm="ПРЕДУПРЕЖДЕНИЕ! Будут удалены все данные о трафике. Продолжить?";


//help container
hstatus_inet.right2="Здесь показана информация, которая требуется для соединения с вашим Интернет-провайдером. Эта информация задается на вкладке <em>Установка</em>. Вы можете <em>Подключить</em> или <em>Отключить</em> соединение, нажав соответствующую кнопку на данной странице.";
hstatus_inet.right4="Здесь показан Интернет-трафик вашего маршрутизатора с момента последней перезагрузки.";
hstatus_inet.right6=" Здесь показан Интернет-трафик вашего маршрутизатора в течение месяца. Наведите указатель мыши на столбец графика, чтобы увидеть данные за указанный день. Данные сохраняются в энергонезависимой памяти (NVRAM).";


// ** Status_Conntrack.asp **//
status_conn.titl="Таблица активных IP-соединений";
status_conn.h2="Активные IP-соединения";


// ** Status_SputnikAPD.asp **//
status_sputnik.titl="Статус агента Sputnik";
status_sputnik.h2="Sputnik&reg; Agent&trade;";
status_sputnik.manage="Управляется";
status_sputnik.license="Нр.лицензии SCC.";

//help container
hstatus_sputnik.right1="Состояние агента Sputnik";
hstatus_sputnik.right2="Это окно отображает состояние процессов агента Sputnik.";
hstatus_sputnik.right4="Центр управления Sputnik к которому подключается эта точка доступа.";
hstatus_sputnik.right6="Текущее состояние агента."; 
hstatus_sputnik.right8="Номер лицензии вашего центра управления Sputnik.";


// ** Status_Wireless.asp **//
status_wireless.titl="Статус беспроводной сети";
status_wireless.h2="Беспроводная сеть";
status_wireless.legend="Статус беспроводной сети";
status_wireless.net="Сеть";
status_wireless.pptp="Статус PPTP";
status_wireless.legend2="Сведения о беспроводных пакетах";
status_wireless.rx="Принято (RX)";
status_wireless.tx="Отправлено (TX)";
status_wireless.h22="Узлы беспроводной сети";
status_wireless.legend3="Клиенты";
status_wireless.signal_qual="Качество сигнала";
status_wireless.wds="Узлы WDS";

// ** GPS info **//
status_gpsi.legend="Информация GPS";
status_gpsi.status="Статус";
status_gpsi.lon="Долгота";
status_gpsi.lat="Широта";
status_gpsi.alt="Высота";
status_gpsi.sat="Видимые спутники";	

//help container
hstatus_wireless.right2="Это MAC-адрес маршрутизатора в вашей беспроводной локальной сети.";
hstatus_wireless.right4="Здесь отображается текущий режим работы беспроводной сети (Смешанный, Только G, Только B или Отключено) согласно настройкам на вкладке WiFi.";

//help page
hstatus_wireless.page1="<dd>Данное окно отображает информацию о состоянии и настройках беспроводной сети. В данном окне корректировки невозможны.</dd>";
hstatus_wireless.page2="<dd>Тут отображен MAC-адрес беспроводного интерфейса.</dd>";
hstatus_wireless.page3="<dd>Тут отображен режим беспроводной сети.</dd>";
hstatus_wireless.page4="<dd>Тут отображается имя сети (SSID) для беспроводного подключения.</dd>";
hstatus_wireless.page5="<dd>Тут отображен канал, используемый беспроводной сетью.</dd>";
hstatus_wireless.page6="<dd>Тут отображено значение мощности беспроводного передатчика.</dd>";
hstatus_wireless.page7="<dd>Тут отображена текущая скорость беспроводного соединения.</dd>";
hstatus_wireless.page8="dd>Здесь отображена информация о типе шифрования.</dd><dd>Щелкните кнопку <i>Обзор Wi-Fi сетей</i> для отображения всех беспроводных сетей в радиусе действия маршрутизатора.</dd>";

// ** Status_OpenVPN.asp **//
status_openvpn.titl="Статус OpenVPN";


// ** Triggering.asp **//
trforward.titl="Запуск портов";
trforward.h2="Запуск портов";
trforward.legend="Перенаправления";
trforward.trrange="Группа запускаемых портов";
trforward.fwdrange="Группа перенаправляемых портов";
trforward.app="Приложение";

//help container
htrforward.right2="Введите имя приложения, запускающего порты.";
htrforward.right4="Для каждого приложения задайте список групп портов, подлежащих запуску. При необходимости уточните номера портов в документации по приложению.";
htrforward.right6="Для каждого приложения задайте список групп портов, подлежащих перенаправлению. При необходимости уточните номера портов в документации по приложению.";
htrforward.right8="Введите номер первого порта в группе запускаемых и перенаправляемых портов.";
htrforward.right10="Введите номер последнего порта в группе запускаемых и перенаправляемых портов.";

//help page
htrforward.page1="<dd>Функция запуска портов позволяет переадресовывать порты без установки фиксированного IP. Устанавливая правила динамического перенаправления, вы можете позволить входящему трафику отправляться на указанный сетевой узел, используя порт отличный от того, что используется для исходящего трафика.<br /><br />Если вы желаете перенаправить порт на ПК со статичным IP адресом, смотрите <a href=\"HForwardSpec.asp\">";
htrforward.page2="</a> или <a href=\"Forward_range.asp\">Перенаправление групп портов</a>.</dd><dd>Для добавления нового правила для запуска портов нажмите <i>Добавить</i> и заполните поля ниже. Для удаления последнего правила, нажмите <i>Удалить</i>.</dd><dt>Приложение</dt><dd>Введите имя приложения в указанное поле.</dd><dt>Группа запускаемых портов</dt><dd>Введите номера первого и последнего портов в диапазоне, который следует запустить. Если ПК отправляет исходящий трафик через эти порты, то и входящий трафик из <i>Группы перенаправляемых портов</i> будет перенаправлен на этот ПК.</dd><dt>Группа перенаправляемых портов</dt><dd>Введите номер первого и последнего порта диапазона, который следует перенаправить для трафика из Интернет на компьютер, который запустил порты, указанные в <i>Группе запускаемых портов</i>.</dd><dt>Включить</td><dd>Отметьте ячейку <i>Включить</i> для активации функции запуска портов для приложения.</dd><dd>Проверьте все значения и щелкните <i>Сохранить</i> для сохранения ваших настроек. Щелкните кнопку <i>Отменить</i> для отмены несохраненных изменений.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Не забывайте сохранить ваши изменения прежде чем добавлять новое правило.</div></div></dd>";

// ** Upgrade.asp **//
upgrad.titl="Обновление прошивки";
upgrad.h2="Управление прошивкой";
upgrad.legend="Обновление прошивки";
upgrad.info1="По завершении обновления";
upgrad.resetOff="Не выполнять сброс параметров";
upgrad.resetOn="Установить заводские настройки";
upgrad.file="Пожалуйста, выберите файл прошивки";
upgrad.warning="П Р Е Д У П Р Е Ж Д Е Н И Е";
upgrad.mess1="Обновление прошивки может занять несколько минут.<br />Не выключайте питание маршрутизатора и не нажимайте кнопку сброса!";

//help container
hupgrad.right2="Нажмите кнопку <em>Обзор...</em>, чтобы выбрать файл прошивки для загрузки в маршрутизатор.<br /><br /> Нажмите кнопку <em>Обновить</em>, чтобы начать обновление. Процесс обновления нельзя прерывать.";

//help page
hupgrad.page1="<dd>Новые версии прошивок публикуются на сайте  <a href=\"http:\/\/www.dd-wrt.com\" target=\"_new\">www.dd-wrt.com</a> и могут быть загружены бесплатно. Если у вас нет проблем с маршрутизатором, то загружать более свежую версию ПО нет необходимости, если только в данной прошивке нет необходимых вам новых функций.<br/><br/><div class=\"note\"><h4>Примечание</h4><div>После обновления прошивки маршрутизатора все настройки будут утеряны, поэтому следует записать все важные параметры перед обновлением.</div></div></dd><dd>Чтобы обновить прошивку:<ol class=\"wide\"><li>Загрузите файл прошивки с веб-страницы.</li><li>Щелкните кнопку <i>Обзор...</i> и выберите файл обновления.</li><li>Щелкните кнопку <i>Обновить</i> и дождитесь завершения обновления.</li></ol><br /><div class=\"note\"><h4>Примечание</h4><div>НЕ ОТКЛЮЧАЙТЕ МАРШРУТИЗАТОР И НЕ НАЖИМАЙТЕ КНОПКУ СБРОСА (RESET) В ПРОЦЕССЕ ОБНОВЛЕНИЯ ПРОШИВКИ.</div></div></dd><dt>Сброс настроек</dt><dd>Если вы хотите сбросить маршрутизатор до состояния заводской конфигурации, выберите значение <i>Установить заводские настройки</i>.<br /><br /></dd>";

// ** UPnP.asp **//
upnp.titl="UPnP";
upnp.h2="Universal Plug and Play (UPnP)";
upnp.legend="Перенаправления";
upnp.legend2="Конфигурация UPnP";
upnp.serv="Служба UPnP";
upnp.clear="Очистка перенаправлений при старте";
upnp.url="Послать презентационный URL";
upnp.msg1="Щелкните здесь для удаления записи";
upnp.msg2="Удалить все записи?";

//help container
hupnp.right2="Щелкните по значку мусорной корзины для удаления отдельной записи.";
hupnp.right4="Позволяет приложениям автоматически устанавливать перенаправления портов.";

//help page
hupnp.page1="<dd>Universal Plug and Play (UPnP) – комплекс компьютерных сетевых протоколов. Это технология Microsoft для автоматической настройки устройств. Цель UPnP – позволить устройствам беспроблемное подключение для упрощения реализации сетей в домашней и корпоративной среде. Для этого UPnP задает и публикует протоколы контроля, построенные на основе открытых стандартов сетевых коммуникаций.</dd>";
hupnp.page2="<dd>TТаблица переадресаций UPnP отображает все открытые порты, автоматически переадресованные процессами UPnP. Вы можете удалить переадресации, щелкнув на иконку мусорного бака, или удалить все переадресации разом нажав кнопку <em>Удалить всё</em>.</dd>";
hupnp.page3="<dd>Позволяет приложениям автоматически настраивать переадресацию.</dd>";
hupnp.page4="<dd>Если активировано, все переадресации портов UPnP удаляются при каждой перезагрузке маршрутизатора.</dd>";
hupnp.page5="<dd>Если активировано, тэг с презентационным URL пересылается вместе с описанием устройства. В этом случае маршрутизатор будет отображаться в <em>Сетевом окружении Windows</em>. <br/><br/>div class=\"note\"><h4>Примечание</h4><div>При включении этой функции может потребоваться перезагрузить компьютер.</div></div></dd><dd>Нажмите <i>Сохранить</i> для сохранения параметров. Нажмите <i>Отменить</i> для отмены несохраненных изменений.</dd>";

// ** VPN.asp **//
vpn.titl="Транзит VPN";
vpn.h2="Виртуальная частная сеть (VPN)";
vpn.legend="Транзитная передача VPN";
vpn.ipsec="Транзитная передача IPSec";
vpn.pptp="Транзитная передача PPTP";
vpn.l2tp="Транзитная передача L2TP";

//help container
hvpn.right1="Вы можете разрешить транзитную передачу IPSec, PPTP и/или L2TP, чтобы позволить устройствам вашей сети устанавливать связи с VPN.";

//help page
hvpn.page1="<dd>Virtual Private Networking (виртуальная частная сеть) обычно используется в сфере бизнеса. Для тоннелей VPN маршрутизатор поддерживает транзитную передачу (passthrough) IPSec, PPTP и L2TP.</dd>";
hvpn.page2="<dd>IPSec – это набор протоколов используемых для безопасного обмена пакетами на уровне IP. Транзитная передача IPSec включена по умолчанию, разрешая открытие тоннелей IPSec. Чтобы запретить эту функцию, выберите <i>Отключить</i>.</dd>";
hvpn.page3="<dd>PPTP метод позволяет использовать VPN сессии для Windows NT 4.0 или 2000 сервера. Транзитная передача PPTP включена по умолчанию. Для отключения выберите <i>Отключить</i>.</dd>";
hvpn.page4="<dd>LTTP – расширенная версия протокола PPP, позволяющая провайдерам создавать виртуальные частные сети (VPN). L2TP соединяет в себе лучшие свойства двух протоколов туннелирования: PPTP от Microsoft и L2F от Cisco Systems. Транзитная передача L2TP включена по умолчанию. Для отключения выберите <i>Отключить</i>.</dd><dd>Проверьте все значения и нажмите <i>Сохранить</i> для сохранения параметров. Нажмите <i>Отменить</i> для отмены всех несохраненных изменений.</dd>";

// ** Vlan.asp **//
vlan.titl=" LAN";
vlan.h2="Виртуальная локальная сеть (VLAN)";
vlan.legend="VLAN";
vlan.bridge="Назначена<br />мосту";
vlan.tagged="Тегирована";
vlan.negociate="Автосогласование";
vlan.aggregation="Агрегирование<br>портов 3 и 4";
vlan.trunk="Объединение";
vlan.linkstatus="Состояние соединения";
vlan.fullspeed="Полная скорость";
vlan.fullduplex="Полный дуплекс";
vlan.gigabit="Гигабит";

// ** WEP.asp **//
wep.defkey="Ключ передачи по умолчанию";
wep.passphrase="Идентификационная фраза";
wep.opt_64="64 бит 10 16-тиричных цифр";
wep.opt_128="128 бит 26 16-тиричных цифр";
wep.generate="Сгенерировать";

// ** WOL.asp **//
wol.titl="WOL";
wol.h2="Wake-On-LAN (WOL)";
wol.legend="Доступные хосты";
wol.legend2="Адреса WOL";
wol.legend3="Выходной сигнал";
wol.legend4="WOL вручную";
wol.enable="Включить WOL?";
wol.mac="MAC-адрес(а)";
wol.broadcast="Широковещательный адрес";
wol.udp="Порт UDP";
wol.msg1="Щелкните, чтобы удалить хост WOL";
wol.h22="Автоматический Wake-On-LAN";
wol.legend5="Демон Wake-On-LAN";
wol.srv="Демон WOL";
wol.pass="Пароль";

//help container
hwol.right2="Эта страница позволяет вам <em>Разбудить</em> хосты вашей локальной сети (т.е. локально соединенные с вашим маршрутизатором). Вы можете будить хосты вручную, нажав кнопку <em>"+sbutton.wol+"</em>. Вы также можете запрограммировать автоматическое пробуждение хостов по расписанию: для этого используется "+wol.srv+".";
hwol.right4="MAC-адрес(а) нужно вводить в формате xx:xx:xx:xx:xx:xx (напр., 01:23:45:67:89:AB) и разделять <em>ПРОБЕЛОМ</em>";
hwol.right6="IP-адрес обычно является широковещательным адресом вашей локальной сети, но может быть и удаленным адресом в том случае, если хост не принадлежит локальной сети маршрутизатора.";

//help page
hwol.page1="<dd>Данная страница позволяет <em>пробудить</em> клиентов вашей локальной сети (локально подключенные к маршрутизатору).</dd><dt class=\"term\">Доступные узлы:</dt><dd class=\"definition\">Раздел доступные хосты предоставляет список сетевых узлов для добавления/удаления к списку адресов WOL (Wake-on-LAN). Этот список – набор всех динамических и статических DHCP клиентов.<div class=\"note\"><h4>Примечание</h4><div>Эта таблица использует МАС-адрес, &quot;угадывает&quot; адрес сетевого вещания на основании того, что он должен соответствовать такой же маске подсети, как и у маршрутизатора (lan_netmask), и использует указанный UDP порт. Если порт не указан, то WOL-пакет отсылается на порт 7.</div></div></dd>";
hwol.page2="<dd class=\"definition\">Раздел адресов WOL <em>пробуждать</em> индивидуальные узлы из списка WOL (хранится в переменной <b>wol_hosts</b> nvram). Этот список – набор выбранных доступных и добавленных вручную узлов.</dd>";
hwol.page3="<dd class=\"definition\">Раздел WOL вручную позволяет пробуждать индивидуальные узлы или список узлов нажатием на кнопку <em>Разбудить вручную</em>, отправив этому узлу/списку <i>волшебный пакет</i>.</dd>";
hwol.page4="<dd class=\"definition\">Введите МАС-адрес(а) (либо разделенные пробелом, либо по одному в строчку) компьютера(-ов), которые необходимо разбудить.<div class=\"note\"><h4>Примечание</h4><div>Каждый МАС-адрес пишется в формате xx:xx:xx:xx:xx:xx.</div></div></dd>";
hwol.page5="<dd class=\"definition\">Использовать широковещательную передачу на этот IP-адрес или имя хоста (обычно, это является вашим широковещательным сетевым IP-адресом для пробуждения локальных сетевых узлов).</dd>";
hwol.page6="<dd class=\"definition\">Транслировать на этот UDP-порт.</dd>";
hwol.page7="<dd class=\"definition\">Кроме попытки <i>разбудить </i> указанные вручную узлы, нажатие на кнопку &quot;Разбудить вручную&quot; сохранит МАС-адрес, значения UDP-порта и широковещательного адреса в переменные nvram <b>manual_wol_mac</b>, <b>manual_wol_network</b> и <b>manual_wol_port</b> и запишет их в память.</dd>";

// ** WanMAC.asp **//
wanmac.titl="Клонирование MAC-адреса";
wanmac.h2="Клонирование MAC-адреса";
wanmac.legend="Клонирование MAC";
wanmac.wan="Клонирование MAC-адреса WAN";
wanmac.wlan="Клонирование MAC-адреса Wi-Fi";

//help container
hwanmac.right2="Некоторые Интернет-провайдеры регистрируют ваш MAC-адрес. Если вы не желаете регистрировать новый MAC-адрес, вы можете клонировать на маршрутизаторе адрес, который зарегистрирован у вашего провайдера.";

//help page
hwanmac.page1="<dd>TMAC-адрес – уникальный 12-значный код-идентификатор сетевого интерфейса. Некоторые провайдеры требуют регистрацию МАС-адреса вашей сетевой карты, которая подключается к провайдеру напрямую или через DSL модем при первичном подключении к Интернету.</dd>";
hwanmac.page2="<dd>Для клонирования МАС-адреса вашего сетевого адаптера маршрутизатором, выберите <i>Включить</i> и введите МАС-адрес вашего адаптера в поле <i>Клонирование MAC-адреса WAN</i> или нажмите <i>Использовать МАС-адрес данного компьютера</i> для заполнения поля МАС адресом ПК, который в данный момент используется для настройки. Сохраните настройки, нажав кнопку <i>Сохранить</i>.<br/><br/>Для отключения клонирования МАС-адреса верните базовый параметр – <i>Отключить</i>.</dd><dd>Найти МАС-адрес вашего ПК можно следуя инструкциям к операционной системе вашего ПК.<br/><br/><b>Windows 98 и Millennium:</b><ol class=\"wide\"><li>Нажмите кнопку Старт и выберите <i>Запустить...</i>.</li><li>Введите <tt>winipcfg</tt> в появившемся поле и нажмите OK.</li><li>Выберите адаптер Ethernet, который вы используете.</li><li>Нажмите Дополнительная информация.</li><li>5.	Запишите ваш адрес МАС.</li></ol><br /><b>Windows 2000 и XP:</b><ol class=\"wide\"><li>1.	Нажмите кнопку Старт, и выберите Запустить...</li><li>Введите <tt>cmd</tt> в появившемся поле, и нажмите OK.</li><li>В командной строке введите <tt>ipconfig /all</tt> и найдите физический адрес вашего адаптера.</li><li>Запишите ваш адрес МАС.</li></ol></dd><dd>Проверьте все значения и щелкните <i>Сохранить</i> для сохранения параметров. Нажмите </i>Отменить</i> для отмены всех несохраненных изменений.</dd>";

// ** WL_WPATable.asp / WPA.asp / Radius.asp **//
wpa.titl="Безопасность беспроводной сети";
wpa.h2="Безопасность беспроводной сети";
wpa.secmode="Режим безопасности";
wpa.legend="Шифрование";
wpa.auth_mode="Сетевая аутентификация";
wpa.wpa="WPA";
wpa.radius="Radius";
wpa.gtk_rekey="Интервал смены ключей WPA";
wpa.rekey="Интервал обновления ключей (с)";
wpa.radius_ipaddr="Адрес сервера RADIUS";
wpa.radius_port="Порт сервера RADIUS";
wpa.radius_key="Ключ RADIUS";
wpa.algorithms="Алгоритмы WPA";
wpa.shared_key="Общий ключ WPA";


aoss.titl="Безопасность AOSS";
aoss.aoss="AOSS";
aoss.service="Сервис AOSS";
aoss.enable="Включить AOSS";
aoss.start="Начать согласование AOSS";
aoss.securitymodes="Режимы безопасности";
aoss.wpaaes="WPA AES";
aoss.wpatkip="WPA TKIP";
aoss.wep="WEP 64/128";
aoss.client_name="Имя клиента";
aoss.security="Безопасность";
aoss.connectivity="Соединение";
aoss.clients="Клиенты AOSS";
aoss.notice="ПРИМЕЧАНИЕ";
aoss.ap_mode_notice="ПРИМЕЧАНИЕ: AOSS возможно к использованию только при условии, когда устройство настроено как точка доступа или точка доступа WDS.";
aoss.wep_notice="Метод безопасности WEP небезопасен, ввиду чего не рекомендуется.";
aoss.wep_info="(необходим многим игровым консолям с поддержкой AOSS)";
aoss.wps="Настройка WPS";
aoss.wps_ap_pin=" PIN WPS-шлюза (на наклейке)";
aoss.wpspin="PIN WPS-клиента";
aoss.wpsactivate="Активировать PIN";
aoss.wpsregister="Зарегистрировать PIN";
aoss.wpsgenerate="Сгенерировать PIN";
aoss.pinnotvalid="Неверный PIN, контрольная сумма не совпадает!";
aoss.wpsenable="Кнопка WPS";
aoss.wpsstatus="Состояние WPS";
aoss.externalregistrar="Метод PIN";
aoss.release="Отключить";
aoss.configure="Настроить";

olupgrade.avail_updates="Доступны обновления";
olupgrade.version="Версия";
olupgrade.release="Релиз";
olupgrade.readme="Описание";
olupgrade.choose="Выбрать";
olupgrade.retrieve_error="Ошибка получения информации об обновлении";

sec80211x.xsuptype="XSupplicant Type";
sec80211x.servercertif="Сертификат публичного сервера";
sec80211x.clientcertif="Клиентский сертификат";
sec80211x.phase2="Фаза 2";
sec80211x.anon="Аноним";
sec80211x.options="Дополнительные настройки сети";

//help container
hwpa.right2="Возможный выбор: Отключено, WEP, WPA Personal, WPA Enterprise или RADIUS. Все устройства в вашей сети должны использовать один и тот же режим безопасности.";

//help page
hwpa.page1="<dd>Маршрутизатор поддерживает различные типы сетевой безопасности. Wi-Fi Protected Access (WPA) Personal, WPA Remote Access Dial In User Service (RADIUS), RADIUS и Wire Equivalence Protection (WEP). Любой из этих режимов может быть выбран из списка режима безопасности. Для отключения настроек безопасности, вернитесь к параметру по умолчанию – <i>Отключить</i>.</dd>";
hwpa.page2="<dd>Протокол временной целостности ключа (TKIP). Данный протокол использует более сложные методы шифрования, чем WEP, и включает в себя код целостности сообщения (MIC) для того, чтобы предотвратить перехват пакетов. Система продвинутого шифрования (AES) – использует симметричные блоки данных с 128-битным шифрованием и содержит код MIC. Если ваш беспроводной клиент поддерживает систему шифрования AES, то следует использовать именно ее.<br /><br />Для использования шифрования WPA Personal, введите пароль в поле <i>Общий ключ WPA</i> длиной от 8 до 64 знаков. Вы можете также ввести значение от 0 до 99,999 секунд в поле <i>Интервал обновления ключей (с)</i>.</dd>";
hwpa.page3="<dd>WPA Enterprise (корпоративный) для авторизации пользователей использует внешний сервер RADIUS. Для использования WPA RADIUS, введите IP-адрес сервера RADIUS, порт RADIUS (базовый 1812) и общий ключ для сервера RADIUS.</dd>";
hwpa.page4="<dd>WPA2 использует стандарт 802.11i для предоставления дополнительной безопасности кроме той, что возможна при использовании WPA. AES обязателен для использования с WPA2 и для поддержки WPA2 вам могут потребоваться дополнительные обновления для вашей ОС и драйверов сетевой карты. Конфигурация WPA2/TKIP не поддерживается. Также не поддерживаются режимы безопасности WPA2 при использовании WDS.</dd>";
hwpa.page5="<dd>Этот режим позволяет использовать клиентов WPA2 и WPA одновременно. Если только часть клиентских устройств вашей сети поддерживает режим WPA2, то следует выбрать режим WPA2 Mixed. Для максимальной совместимости стоит использовать WPA2 Mixed/TKIP+AES.</dd>";
hwpa.page6="<dd>RADIUS использует для аутентификации сервер RADIUS или протокол WEP для шифрования данных. Для использования RADIUS, введите IP-адрес сервера RADIUS и его общий ключ. Выберите желаемую степень шифрования (64 или 128 бит) для протокола WEP и введите фразу-пароль или WEP-ключ.</dd>";
hwpa.page7="dd>Есть две степени шифрования WEP: 64-битное (40 бит) и 128-битное. Для использования WEP, выберите желаемое значение бит, введите фразу-пароль или до четырех WEP-ключей в шестнадцатеричном формате. При использовании 64 бит (40 бит) длина каждого ключа должна быть равна 10 знакам. Для 128-битного шифрования, каждый ключ должен состоять из 26 шестнадцатеричных чисел. Действительные шестнадцатеричные числа следующие: \"0\"-\"9\" и \"A\"-\"F\". Проверьте спецификации ваших беспроводных клиентов, чтобы убедится, какие именно режимы шифрования они поддерживают.<br /><br />Мы не рекомендуем использовать шифрование WEP ввиду его слабой устойчивости к взлому и, поэтому, следует использовать режим WPA при любой возможности. Пользуйтесь режимом WEP только если ваши клиенты не поддерживают более защищенные стандарты (обычно это устаревшие машины стандарта 802.11b).</dd><dd>Проверьте все значения и нажмите <i>Сохранить</i> для сохранения настроек. Нажмите </i>Отменить</i> для отмены несохраненных изменений.</dd>";

// ** WL_FilterTable.asp **//
wl_filter.titl="Список фильтра MAC-адресов";
wl_filter.h2="Список фильтра MAC-адресов";
wl_filter.h3="Введите MAC-адрес в следующем формате&nbsp;:&nbsp;&nbsp;&nbsp;xx:xx:xx:xx:xx:xx";
filter.none="Не задано";

// ** WL_ActiveTable.asp **//
wl_active.titl="Список MAC-адресов активных клиентов беспроводной сети";
wl_active.h2="Список MAC-адресов клиентов беспроводной сети";
wl_active.h3="Включить MAC-фильтр";
wl_active.active="Активные клиенты";
wl_active.inactive="Неактивные клиенты";


// ** Wireless_WDS.asp **//
wds.titl="WDS";
wds.h2="Беспроводная распределенная система (WDS)";
wds.legend="Параметры WDS";
wds.label="Lazy WDS";
wds.label2="Подсеть WDS";
wds.wl_mac="Беспроводной MAC";
wds.lazy_default="По умолчанию: Отключено";
wds.nat1="wLAN->WDS";
wds.nat2="WDS->wLAN";
wds.subnet="Подсеть";
wds.legend2="Дополнительные опции";

//help page
hwds.page1="<dd>Беспроводная распределенная система (WDS) – режим беспроводной точки доступа, который позволяет создавать беспроводной мост, в котором точки WDS сообщаются только друг с другом (не позволяя другим беспроводным клиентам подключаться), и/или работать как повторитель, когда точки доступа общаются друг с другом и с беспроводными клиентами (что уменьшает общую пропускную способность в 2 раза). Данная прошивка поддерживает два вида WDS: LAN и Точка-точка.</dd><dt>Тип WDS LAN</dt><dd>Самый простой и наиболее распространенный тип используется для связи локальных сетей. Он прост в настройке и не требует дополнительных сетевых протоколов или углубленных познаний сетевого оборудования. Другими словами – это режим сетевого моста. Как пример можно привести увеличение радиуса существующей точки доступа путем установки второй точки и соединения её с первой посредством WDS LAN типа.<ol class=\"wide\"><li>Обязательно используйте одинаковые <a href=\"HWireless.asp\">Основные настройки Wi-Fi</a> на обоих маршрутизаторах, а также одинаковые <a href=\"HWPA.asp\">Настройки безопасности</a>.</li><li>Найдите выпадающее меню с опцией <i>Отключить</i>. Нажмите её и затем выберите <i>LAN</i>, повторите эти же настройки на втором маршрутизаторе.</li><li>На первом маршрутизаторе запишите значение <i>Беспроводной MAC</i> и введите его на втором, в ту же строку куда вы установили значение \"LAN\".</li><li>Произведите обратное действие, взяв МАС-адрес со второго маршрутизатора и сохраните его на первом.</li><li>Проверьте верность введенных значений и нажмите <i>Сохранить</i>.</li><li>Перейдите к странице <a href=\"HStatusWireless.asp\">Состояние беспроводной сети</a> Вы увидите <i>Связь WDS</i> и МАС-адрес второго маршрутизатора, а также значение с уровнем сигнала. Если значение уровня сигнала \"0dBm\", то что-то не так. Проверьте настройки и убедитесь, что антенны присоединены, затем попробуйте снова.</li><li>7.	Как только вы увидите хорошие показатели сигнала (от -70dBm до -30dBm, где -70dBm – наименьшее значение), вы можете поменять <i>Тип соединения</i> на странице <a href=\"HSetup.asp\">Основные настройки</a> на втором маршрутизаторе на значение <i>Отключено</i>, а на втором маршрутизаторе установите как <em>Шлюз</em>. Теперь можно запустить стандартные тесты для проверки соединения (например, <tt>ping</tt>).</li></ol><br /><br /><div class=\"note\"><h4>Примечание</h4><div>Функция WDS только доступна в режиме <em>Точка доступа</em>. Также тип шифрования беспроводного соединения <em>WPA2</em> и режим <em>Только В</em> не поддерживаются при использовании WDS.</div></div></dd>";

// ** Wireless_radauth.asp **//
radius.titl="Radius";
radius.h2="Remote Authentication Dial-In User Service";
radius.legend="Radius";
radius.label="MAC-адрес клиента Radius";
radius.label2="Формат MAC";
radius.label3="Адрес сервера аутентификации Radius";
radius.label4="Порт сервера аутентификации Radius";
radius.label5="Максимум неаутентиф.пользователей";
radius.label6="Формат пароля";
radius.label7="Общий секрет аутентификации Radius";

radius.label23="Адрес резервного сервера Radius";
radius.label24="Порт резервного сервера Radius ";
radius.label27="Общий пароль резервного сервера Radius ";

radius.label8="Игнор.Radius, если сервер недоступен";
radius.label13="Адрес сервера учета Radius";
radius.label14="Порт сервера учета Radius";
radius.label17="Общий секрет сервера учета Radius";
radius.label18="Учет Radius";

// help page
hradauth.page1="<dd>RADIUS (Remote Authentication Dial-In User Service) - сервис безопасности для аутентификации и авторизации пользователей коммутируемого доступа. Типичная корпоративная сеть может включать в себя сервер общего доступа вместе с сервером RADIUS, присоединенного к модемной сети, используемые для служб аутентификации. Удаленные пользователи \"дозваниваются\" до сервера общего доступа, и он, в свою очередь, отправляет запрос для аутентификации на сервер RADIUS. RADIUS сервер аутентифицирует пользователей, и авторизует доступ к внутрисетевым ресурсам. Удаленные пользователи – клиенты сервера общего доступа, а сервер общего доступа – клиент RADIUS сервера.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>RADIUS только доступен в режиме <em>Точки доступа (AP)</em>.</div></div></dd>";
hradauth.page2="<dd>При отправке запроса аутентификации на RADIUS сервер беспроводной клиент использует МАС-адрес в качестве имени пользователя. Он будет получен сервером RADIUS в следующем формате:<ul class=\"wide\"><li>aabbcc-ddeeff</li><li>aabbccddeeff</li><li>aa-bb-cc-dd-ee-ff</li></ul></dd> ";
hradauth.page3="<dd>IP адрес сервера RADIUS и TCP порт.</dd>";
hradauth.page4="<dd>Задает количество пользователей, которые могут получать доступ без какой-либо действующей аутентификации.</dd>";
hradauth.page5="<dd>Задает, какой пароль RADIUS следует использовать: общий ключ или сам МАС-адрес.</dd>";
hradauth.page6="<dd>Транзакции между клиентом и сервером учета RADIUS аутентифицируются при помощи общего ключа, который никогда не высылается в сеть.</dd>";
hradauth.page7="<dd>Если сервер Radius становится недоступен, аутентификация будет отключена до тех пор, пока сервер снова не станет доступен. Это позволяет обеспечить удаленное беспроводное администрирование точки доступа при всех сценариях ошибок.</dd>";

// ** Wireless_MAC.asp **//
wl_mac.titl="MAC-фильтр";
wl_mac.h2="MAC-фильтр беспроводной сети";
wl_mac.legend="MAC-фильтр";
wl_mac.label="Использовать фильтр";
wl_mac.label2="Режим фильтрации";
wl_mac.deny="Запретить доступ к сети клиентам из списка";
wl_mac.allow="Разрешить доступ к сети только клиентам из списка";

//help page
hwl_mac.page1="<dd>MAC-фильтр позволяет вам контролировать какие беспроводные клиенты могут подключаться к маршрутизатору в зависимости от их МАС-адреса. Чтобы узнать, как найти МАС-адрес на Windows ПК, смотрите инструкции в разделе <a href=\"HWanMAC.asp\">Клонирование МАС-адреса</a>.</dd><dd>Чтобы установить фильтр, нажмите <i>Включить</i> и следуйте дальнейшим инструкциям:<ol class=\"wide\"><li>Если вы желаете заблокировать конкретный компьютер, оснащенный беспроводным модулем, от сообщения с маршрутизатором, тогда оставьте значения по умолчанию - <i>Запретить доступ к сети клиентам из списка</i>. Если же вы хотите разрешить доступ только определенным ПК, то выберите <i>Разрешить доступ к сети только клиентам из списка</i>.</li><li>Нажмите кнопку <i>Редактировать список МАС-фильтра</i>. Введите соответствующие МАС-адреса в поля.<br /><br /><div class=\"note\"><b>Примечание:</b><br />МАС-адрес должен вводится в следующем формате: xxxxxxxxxxxx (где х-ами отображены значения МАС-адреса).</div></li><li>Нажмите <i>Сохранить</i> для сохранения настроек. Нажмите <i>Отменить</i> для отмены всех несохраненных изменений. Нажмите кнопку <i>Закрыть</i> для возврата к предыдущему окну без сохранения изменений.</li></ol><br />Чтобы отключить фильтрацию МАС-адресов, возвратите настройки на параметр по умолчанию – <i>Отключить</i>./dd>";

// ** WiMAX
wl_wimax.titl="WiMAX";
wl_wimax.h2="Worldwide Interoperability for Microwave Access";
wl_wimax.downstream="Частота приема";
wl_wimax.upstream="Частота передачи";
wl_wimax.width="Ширина канала";
wl_wimax.duplex="Дуплексный режим";
wl_wimax.mode="Режим работы";
wl_wimax.mac="MAC-адрес подписчика";

// ** Gpio **//
gpio.titl="GPIO Вводы / Выводы";
gpio.h2=" GPIO Вводы / Выводы";
gpio.oplegend=" GPIO Выводы";
gpio.iplegend=" GPIO Вводы";

// ** FreeRadius.asp **//var freeradius=new Object();
freeradius.titl="FreeRadius";
freeradius.h2="FreeRadius";
freeradius.certificate="Сертификат сервера";
freeradius.cert="Сгенерировать сертификат";
freeradius.clientcert="Клиентский сертификат";
freeradius.settings="Настройки";
freeradius.users="Пользователи";
freeradius.clients="Клиенты";
freeradius.username="Имя пользователя";
freeradius.password="Пароль";
freeradius.downstream="Скорость загрузки";
freeradius.upstream="Скорость отдачи";
freeradius.sharedkey="Общий ключ";


freeradius.countrycode="Код страны";
freeradius.state="Регион или область";
freeradius.locality="Район";
freeradius.organisation="Организация/Компания";
freeradius.email="Адрес эл.почты";
freeradius.common="Общее имя сертификата";
freeradius.expiration="Истекает через (дней)";
freeradius.passphrase="Контрольная фраза";
//freeradius.generate="Сгенерировать сертификат";
freeradius.cert_status="Состояние сертификата";
freeradius.port="Порт Radius";

//help container
hfreeradius.right2="Необходимо включить JFFS перед запуском FreeRadius.";

// ** Wireless_Advanced.asp **//
wl_adv.titl="Дополнительные параметры беспроводной сети";
wl_adv.h2="Дополнительные параметры беспроводной сети";
wl_adv.legend="Дополнительные параметры";
wl_adv.legend2="Параметры поддержки мультимедиа";
wl_adv.label="Тип аутентификации";
wl_adv.label2="Базовая скорость";
wl_adv.label3="Фиксированная скорость передачи";
wl_adv.label4="Режим защиты CTS";
wl_adv.label5="Разброс фрейма";
wl_adv.label6="Интервал маяка";
wl_adv.label7="Интервал DTIM";
wl_adv.label8="Порог фрагментации";
wl_adv.label9="Порог RTS";
wl_adv.label10="Макс.число ассоциированн.клиентов";
wl_adv.label11="Изоляция точки доступа";
wl_adv.label12="Передающая антенна";
wl_adv.label13="Приемная антенна";
wl_adv.label14="Преамбула";
wl_adv.reference="Эталонный шум";
wl_adv.label16="Форсаж";
wl_adv.label17="Беспроводной доступ к GUI";
wl_adv.label18="Поддержка WMM";
wl_adv.label19="No-Acknowledgement";
wl_adv.label20="Shortslot Override";
wl_adv.label21="Макс. скорость передачи";
wl_adv.label23="Мин. скорость передачи";
wl_adv.label22="Режим сосуществования с Bluetooth";
wl_adv.label24="Юстировка антенны";
wl_adv.label25="Вывод антенны";
wl_adv.table1="Параметры EDCA AP (от точки доступа к клиенту)";

wl_adv.txchainmask="TX-цепи антенны";
wl_adv.rxchainmask="RX-цепи антенны";



wl_adv.col1="CWmin";
wl_adv.col2="CWmax";
wl_adv.col3="AIFSN";
wl_adv.col4="TXOP(b)";
wl_adv.col5="TXOP(a/g)";

wl_adv.table3="Параметры WMM: пределы повторов, пропаданий и макс.скорость.";
wl_adv.txpcol1="S. Retry";
wl_adv.txpcol2="S. Fallbk";
wl_adv.txpcol3="L. Retry";
wl_adv.txpcol4="L. Fallbk";
wl_adv.txpcol5="Max Rate";
wl_adv.txprow1="AC BE TX параметры";
wl_adv.txprow2="AC BK TX параметры";
wl_adv.txprow3="AC VI TX параметры";
wl_adv.txprow4="AC VO TX параметры";

wl_adv.col6="Admin Forced";
wl_adv.row1="Фоновый";
wl_adv.row2="Негарантированный класс";
wl_adv.row3="Видео";
wl_adv.row4="Голос";
wl_adv.table2="Параметры EDCA STA (от клиента к точке доступа)";
wl_adv.lng="Длинный"; 					//************* don't use .long! *************
wl_adv.shrt="Короткий"; 				//************* don't use .short! **************
wl_adv.mbps="Мбит/с";

//help container
hwl_adv.right2="Вы можете задать режимы Авто и Общий ключ. Аутентификация на основе общего ключа более надежна, но все устройства в вашей сети должны поддерживать данный режим аутентификации.";

//help page
hwl_adv.page1="<dd>Дополнительные параметры беспроводной сети позволяют индивидуально настроить установки передачи данных. При стандартных сценариях использования данные настройки следует оставить на их базовых значениях.</dd>";
hwl_adv.page2="<dd>По умолчанию установлено в значении <i>Авто</i>, что позволяет использовать открытую аутентификацию или использовать общий ключ. Для систем с открытой аутентификацией отправитель и получатель не используют WEP ключ для аутентификации. При аутентификации с общим ключом отправитель и получатель будут использовать ключ. Если вы желаете использовать только аутентификацию с общим ключом, выберите опцию <i>Общий ключ</i>.</dd>";
hwl_adv.page3="<dd>По умолчанию установлено в значении <i>По умолчанию</i>. Оно зависит от режима беспроводного соединения, которое вы выбираете. Скорость доступа будет подстроена под выбранный режим. Значения по умолчанию нацелены обеспечить максимальную совместимость со всеми устройствами. Вы также можете выбрать все возможные скорости доступа, выбрав <i>Все</i>. Для совместимостью со старыми устройствами 802.11b выберите <i>1-2Mbps</i>.</dd>";
hwl_adv.page4="<dd>По умолчанию установлено в значении <i>Авто</i>. Разнится в величинах от 1 до 54 Мбит/с. Скорость передачи данных следует выставить в зависимости от скорости в вашей беспроводной сети. Вы можете самостоятельно выбрать из списка возможных диапазонов или оставить значение в режиме <i>Авто</i>, чтобы маршрутизатор самостоятельно подобрал наиболее удачные характеристики.</dd>";
hwl_adv.page5="<dd>По умолчанию установлено в значении <i>Отключить</i>. При использовании параметра <i>Авто</i>, защитный механизм позволит вашим беспроводным устройствам 802.11b подключаться к сети класса 802.11g даже при условии наличия множества устройств класса 802.11g, однако их производительность может быть снижена.</dd>";
hwl_adv.page6="<dd>По умолчанию установлено в значении <i>Отключить</i>. Разброс фрейма позволяет пакетам \"выстреливать\", тем самым повышая скорость сети, однако, данная функция рекомендуется для сетей лишь с несколькими (1-3) клиентами. Большое количество клиентов, использующих эту функцию, могут отрицательно сказаться на пропускной способности сети.</dd>";
hwl_adv.page7="<dd>По умолчанию установлено в значении 100. Введите значение в диапазоне 1 - 65,535 миллисекунд. Значение интервала маяка указывает на частоту его срабатывания. Маяк – это пакет, транслируемый маршрутизатором для синхронизации беспроводного соединения. При плохом приеме мы рекомендуем значение 50.</dd>";
hwl_adv.page8="<dd>По умолчанию установлено в значении 1. Это значение, ограниченное диапазоном 1 - 255, обозначает интервал отправки сообщений подтверждения доставки трафика (DTIM). Поле DTIM – поле отсчета, информирующее клиентскую сторону о появлении доступного окна для передачи сообщений. Когда маршрутизатор поместил в буфер сообщение на отсылку для направления заданному клиенту, он отправляет следующий пакет DTIM со значением интервала DTIM. Клиент получает маяк и подготавливается к принятию сообщения.</dd>";
hwl_adv.page9="<dd>Это значение следует оставить на базовом значении 2346. Диапазон ограничен значениями в 256-2346 байтов. Оно обозначает максимальный размер пересылаемого пакета прежде, чем он будет разбит на меньшие. Если вы столкнулись с большим количеством ошибок при пересылке пакетов, то вы можете слегка повысить порог фрагментации. Установка слишком низкого порога фрагментации может привести к плохой производительности сети. Рекомендуются только незначительные изменения этого значения.</dd>";
hwl_adv.page10="<dd>Это значение следует оставить на его параметрах по умолчанию – 2347. Диапазон ограничен значениями в 0-2347 байтов. В случае, если наблюдается нестабильность потока данных, рекомендуется производить только незначительные изменения. Если сетевой пакет меньше предустановленного порога RTS, то механизм RTS/CTS не будет применяться. Маршрутизатор будет высылать фреймы запроса для отсылки (RTS) определенной принимающей станции и пытаться договориться об отправке пакета с данными. При получении запроса RTS беспроводная станция отвечает пакетом готовности к пересылке (CTS) для подтверждения готовности начать передачу.</dd>";
hwl_adv.page11="<dd>Значение по умолчанию – <i>Отключить</i>. Эта установка изолирует клиентов беспроводного подключения таким образом, что доступ друг к другу у них отсутствует.</dd>";
hwl_adv.page12="<dd>Значения следующие: <i>Авто</i> (по умолчанию), <i>Left</i>, <i>Right</i>. Этот параметр используется совместно с внешними антеннами, для предоставления им оптимальных характеристик. На некоторых моделях правая и левая антенны могут быть расположены наоборот в зависимости от точки зрения.</dd>";
hwl_adv.page13="<dd>Значения преамбулы могут быть <i>Длинная</i> (по умолчанию) и <i>Короткая</i>. Если ваше беспроводное устройство поддерживает короткую преамбулу и у вас проблемы заставить его работать с другими устройствами 802.11b, убедитесь, что вы его настроили на использование длинной преамбулы.</dd>";
hwl_adv.page14="<dd>Данное значение варьируется от 1 до 1000 мВт. По умолчанию txpwr выбран таким образом, чтобы согласовываться с нормативными доменами вашей страны и сохранять стабильность беспроводной сети. Настройки с параметрами более высокой мощности не рекомендуются, т.к. радио чип будет генерировать избыточное тепло, тем самым снижая жизненный цикл устройства.</dd>";
hwl_adv.page15="<dd>Значение по умолчанию – <i>Отключить</i>. Данный параметр следует использовать только с моделями WRT54GS и только совместно с другими маршрутизаторами Linksys \"GS\" и беспроводными клиентами поддерживающими технологию Linksys \"Speedbooster\".</dd>";
hwl_adv.page16="<dd>Значение по умолчанию – <i>Включить</i>. Данная опция позволяет получить доступ к странице веб-настроек маршрутизатора с беспроводных клиентов. Отключите эту функцию, если вы желаете заблокировать возможность доступа к настройкам с клиентов беспроводной сети.</dd>";
hwl_adv.page17="<dd>Функция <em>Ограничения Wi-Fi доступа</em> отвечает за расписание действия радиопередатчика. По умолчанию расписание отключено и передатчик беспроводного сигнала включен постоянно. Включите расписание, если желаете отключать беспроводную сеть в определенное время суток. Часы, во время которых передатчик работает, отмечены зеленым; красным, в свою очередь, отмечены часы, когда радиопередатчик выключен. Щелкните на соответствующее значение времени, чтобы включить/выключить передатчик.</dd>";
hwl_adv.page18="<dd>Включает поддержку мультимедийных функции Wi-Fi. Настройка опций QoS состоит из настройки параметров существующей очереди для различных типов беспроводного трафика. Вы можете настроить различные минимальные и максимальные значения времени ожидания в очереди пакетов в зависимости от того, какие требования к мультимедийному контенту были направлены. Очередь автоматически применяет минимальное время задержки передачи для голосовых, видео и критичных к выполнению приложений, и использует параметры максимальной производительности для традиционных данных IP.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Например, к чувствительным ко времени голосовым, видео и мультимедийным приложениям предоставляется более высокий приоритет при передаче (более короткие периоды ожидания), в то время как традиционные IP данные, которые не так чувствительны к задержкам, но более насыщенны данными, могут дольше ожидать своей очереди.</div></div></dd>";
hwl_adv.page19="<dd>Этот параметр относится к политике распознавания используемой на уровне МАС. Хотя отказ от распознавания может привести к более высоким результатам пропускной способности, но в то же время может повысится количество ошибок в \"шумном\" радиочастотном окружении.</dd>";
hwl_adv.page20="<dd>Это влияет на трафик идущий от точки доступа к клиентской станции.</dd>";
hwl_adv.page21="<dd>Это влияет на трафик идущий от клиентской станции до точки доступа.</dd>";
hwl_adv.page22="<dd>Приоритет Фоновый.<BR />Высокая пропускная способность. Объемные потоки данных, требующие максимальной пропускной способности, но не чувствительные к задержкам, попадают в эту очередь (например, FTP-трафик).</dd>";
hwl_adv.page23="<dd>Приоритет Негарантированный класс.<BR />Средняя пропускная способность и задержка. Наиболее распространенные данные протокола IP попадают в эту очередь.</dd>";
hwl_adv.page24="<dd>Приоритет Видео.<BR />Минимальная задержка. Чувствительная к потери времени информация (например, видео) попадает в эту очередь.</dd>";
hwl_adv.page25="<dd>Минимальное окно разногласий. Этот параметр – вводная в алгоритм, определяющий изначальное случайное время задержки ожидания (\"Окно\") для повторной передачи. Указанное здесь значение, в поле минимальное окно разногласий – это верхний предел диапазона (в миллисекундах), который определяет изначальное случайное время задержки ожидания.<BR />Первым случайно сгенерированным числом будет число от 0 до указанного здесь значения. Если первое случайно выбранное время задержки ожидания истекает, счетчик повтора увеличивается и окно времени ожидания удваивается. Подобное удвоение будет продолжаться до тех пор, пока значение случайного времени задержки ожидания не достигнет значения максимального окна разногласий. Действительными значениями для \"cwmin\" являются 1, 3, 7, 15, 31, 63, 127, 255, 511 или 1024. Значение \"cwmin\" не может превышать значения \"CWmax\".</dd>";
hwl_adv.page26="<dd>Максимальное окно разногласий. Значение, указанное здесь – верхний предел (в миллисекундах) для удвоения значения случайного времени задержки ожидания. Подобное удвоение будет продолжаться до тех пор, пока пакет данных не будет отправлен или пока не будет достигнуто значение максимального окна разногласий. Если такое значение достигнуто, то повторы будут продолжаться пока не достигнут числа максимальных попыток. Действительные значения для \"cwmax\" 1, 3, 7, 15, 31, 63, 127, 255, 511 и 1024. Значения \"cwmax\" должны быть больше значения \"CWmin\".</dd>";
hwl_adv.page27="<dd>Арбитражное количество межфрагментного расстояния определяет время ожидания (в миллисекундах) фреймов данных.</dd>";
hwl_adv.page28="<dd>TВозможность передачи для режимов \"a\", \"b\", и \"g\" – это интервал времени, когда точка доступа беспроводного мультимедийного расширителя имеет право инициировать передачу на беспроводной носитель. Это значение (в миллисекундах) определяет возможность передачи (TXOP) для точки доступа, т.е. интервал времени, когда точка доступа мультимедийного Wi-Fi может начать трансляцию по беспроводной сети.</dd><dd>Проверьте все значения и щелкните <i>Сохранить</i> для сохранения ваших настроек. Нажмите <i>Отменить</i> для отмены несохраненных изменений.</dd>";

// ** Wireless_Basic.asp **//
wl_basic.titl="Беспроводная сеть";
wl_basic.h2="Беспроводная сеть";
wl_basic.cardtype="Тип карты";
wl_basic.legend="Основные параметры";
wl_basic.label="Тип беспроводной сети";
wl_basic.label2="Режим беспроводной сети";
wl_basic.label3="Имя беспроводной сети (SSID)";
wl_basic.label4="Беспроводной канал";
wl_basic.label5="Широковещание SSID";
wl_basic.label6="Время ожидания ACK";
wl_basic.label7="Режим передачи 802.11n";
wl_basic.turboqam="Поддержка TurboQAM (QAM256)";
wl_basic.scanlist="Список сканирования";
wl_basic.duallink="Двойная связь";
wl_basic.parent="IP головного устройства";
wl_basic.masquerade="Masquerade / NAT";
wl_basic.ap="Точка доступа";
wl_basic.client="Клиент";
wl_basic.repeater="Повторитель";
wl_basic.repeaterbridge="Повторитель-мост";
wl_basic.clientBridge="Клиентский мост";
wl_basic.clientRelayd="Клиентский мост (с маршрутизацией)";
wl_basic.adhoc="Adhoc";
wl_basic.wdssta="Станция WDS";
wl_basic.wdsap="Точка доступа WDS";
wl_basic.mixed="Смешанный";
wl_basic.bft="Явное формирование луча";
wl_basic.bfr="Неявное формирование луча";
wl_basic.greenfield="Greenfield";
wl_basic.preamble="Короткая преамбула";
wl_basic.preamble="Короткая преамбула";
wl_basic.clientRelaydDefaultGwMode="Режим шлюза по умолчанию";
wl_basic.b="Только B";
wl_basic.a="Только A";
wl_basic.ac="Только AC";
wl_basic.na="Смешанный NA";
wl_basic.ng="Смешанный NG";
wl_basic.n5="Только N (5 ГГц)";
wl_basic.n2="Только N (2.4 ГГц)";
wl_basic.g="Только G";
wl_basic.bg="B и G";
wl_basic.n="Только N";
wl_basic.rts="Порог RTS";
wl_basic.rtsvalue="Порог";
wl_basic.protmode="Режим защиты";
wl_basic.legend2="Ограничения Wi-Fi доступа";
wl_basic.radio="Wi-Fi";
wl_basic.radiotimer="Расписание работы Wi-Fi";
wl_basic.radio_on="Wi-Fi включена";
wl_basic.radio_off="Wi-Fi отключена";
wl_basic.h2_v24="Беспроводные физические интерфейсы";
wl_basic.h2_vi="Виртуальные интерфейсы";
wl_basic.regdom="Управляющий домен";
wl_basic.TXpower="Мощность передатчика";
wl_basic.TXpowerFcc="Пиковая мощность TX (FCC)";
wl_basic.AntGain="Усиление антенны";
wl_basic.diversity="Разнесенность";
wl_basic.primary="Первичная";
wl_basic.secondary="Вторичная";
wl_basic.vertical="Вертикальная";
wl_basic.horizontal="Горизонтальная";
wl_basic.adaptive="Адаптивная";
wl_basic.internal="Внутренний";
wl_basic.external="Внешняя";
wl_basic.ghz24="Мощность на 2.4 ГГц";
wl_basic.ghz5="Мощность на 5 ГГц";
wl_basic.network="Конфигурация сети";
wl_basic.unbridged="Не в мосте";
wl_basic.bridged="В мосте";
wl_basic.turbo="Турборежим";
wl_basic.extrange="Расширенная дальность";
wl_basic.supergcomp="Сжатие Super G";
wl_basic.supergff="Быстрое кадрирование Super G";
wl_basic.extchannel="Режим расширенного канала";
wl_basic.outband="Частотный диапазон вне помещений";
wl_basic.channel_width="Ширина канала";
wl_basic.channel_wide="Широкий канал";
wl_basic.regulatory="Суперканал";
wl_basic.chanshift="Сдвиг канала";
wl_basic.specialmode="Режим 2.3 ГГц";
wl_basic.wifi_bonding="Прикрепление WiFi";
wl_basic.sifstime="Время OFDM SIFS";
wl_basic.preambletime="Время преамбулы OFDM";
wl_basic.multicast="Многоадресные потоки";
wl_basic.intmit="Помехозащищенность";
wl_basic.noise_immunity="Уровень помехозащищенности";
wl_basic.ofdm_weak_det="Обнаружение слабого сигнала OFDM";
wl_basic.radar="Обнаружение радара";
wl_basic.mtikie="Совместимость MTik";
wl_basic.csma="Контроль несущей";
wl_basic.if_label="Метка (опционально)";
wl_basic.if_info="Инфомация (опционально)";
wl_basic.advanced_options="Дополнительные опции";
wl_basic.rate_control="Алгоритм управления скоростью";
wl_basic.ap83_vap_note="Использование более чем трех виртуальных интерфейсов могут привести к падению производительности при добавлении определенных клиентов к этим интерфейсам.";
wl_basic.isolation="Изоляция сети";
wl_basic.country_settings="Настройки по странам";
wl_basic.ch_pos_auto="Авто";
wl_basic.ch_pos_upr="Верхний";
wl_basic.ch_pos_lwr="Нижний";
wl_basic.ghz="ГГц";
wl_basic.mhz="МГц";
wl_basic.tbqam="TurboQAM";

//help container
hwl_basic.right2="Если вы хотите исключить беспроводных G-клиентов, выберите режим <em>Только B</em>. Если вы хотите отключить беспроводной доступ, выберите <em>Отключить</em>.<br/><b>Замечание :</b> при изменении режима беспроводной сети также подлежат изменению некоторые чувствительные к режиму параметры (\"" + wl_adv.label16 + "\", \"" + wl_adv.label2 + "\" или \"" + wl_adv.label5 + "\").";
hwl_basic.right3="Время ожидания ACK: ";
hwl_basic.right4="Настраивает время ожидания ACK. Для устройств на базе Broadcom значение 0 полностью отключает время ожидания подтверждения. Для устройств на базе Atheros это значение означает автоматическую установку времени ожидания подтверждения";
hwl_basic.right6="Щелкните по любому часу, чтобы включить или отключить радиосигнал в указанный час. (<em>Зеленый</em> цвет означает, что радиодоступ разрешен, а <em>красный</em> - что радиодоступ заблокирован)";

//help page
hwl_basic.page1="<dd>Беспроводная часть вашего маршрутизатора может работать в различных режимах:<ul class=\"wide\"><li>Режим точки доступа (AP) &ndash; это режим по умолчанию, также называется режимом инфраструктуры. Ваш маршрутизатор является центральной точкой соединения, к которой могут подключаться другие клиенты.</li>li>Режим клиента &ndash; радио интерфейс используется для подключения в качестве клиента к удаленной точке доступа. Преобразование адресов (NAT) или маршрутизация между внешними и локальными сетями производится аналогично \"обычному\" режиму шлюза или маршрутизатора. Используйте этот режим, если ваше Интернет соединение предоставляется удаленной точкой доступа, и вы хотите, чтобы у вашего маршрутизатор была собственная подсеть. </li><li>Режим клиентского моста &ndash; радио интерфейс используется для подключения локальных проводных клиентов к удаленной точке доступа. Проводные клиенты и удаленная точка доступа будут в одной подсети (поэтому это соединение называется \"мост\" между двумя сегментами сети). Интернет подключение маршрутизатора не используется и может быть отключено. Этот режим следует использовать, если вы хотите использовать маршрутизатор в качестве \"беспроводного сетевого адаптера\" для устройств, подключенных к одному из его LAN портов.</li><li>Режим Ad-Hoc &ndash; это пиринговое беспроводное подключение. Клиенты в режиме Ad-Hoc подключаются друг к другу без использования центральной точки доступа.</li></ul><br /><br /><div class=\"note\"><h4>Примечание</h4><div><a href=\"HWDS.asp\">WDS</a> доступно только в режиме точки доступа.</div></div></dd>";
hwl_basic.page2="<dd>Если в вашей сети есть устройства стандарта 802.11b и 802.11g, то оставьте параметр по умолчанию – <i>Смешанный</i>. Если вы используете только G –устройства, выберите <i>Только G</i>. Если вы хотите ограничить вашу сеть только для устройств стандарта 802.11b, тогда выберите <i>Только B</i>. Если вы желаете отключить беспроводной доступ, выберите <i>Отключено</i>. Имейте ввиду, что режим <i>Только B</i> не поддерживает WDS.</dd>";
hwl_basic.page3="<dd>SSID – имя сети, общедоступно для всех устройств в беспроводной сети. Оно должно быть идентичным для всех устройств, включенных в эту сеть. Оно чувствительно к регистру и не должно превышать 32 буквенно-цифровых знаков (т.е. стандартные знаки клавиатуры). Убедитесь, что этот параметр одинаков для всех устройств вашей сети.<br /><br /><div class=\"note\"><h4>Примечание</h4><div>Для дополнительной безопасности рекомендуется сменить стандартное имя сети (SSID) на ваше собственное уникальное значение.</div></div></dd>";
hwl_basic.page4="<dd>Выберите подходящий канал из списка приведенных для соответствия установкам вашей сети (в Северной Америке разрешены каналы 1-11, в Европе 1-13, в Японии – все 14 каналов). Все устройства в вашей беспроводной сети должны использовать один и тот же канал для корректной работы. Во избежание конфликта с другими сетями следует выбирать каналы с разницей +/-3.</dd>";
hwl_basic.page5="<dd>Когда беспроводные клиенты опрашивают сеть на наличие беспроводных соединений, они обнаруживают транслируемый маршрутизатором SSID. Если вы желаете сеть оставаться видимой, сохраните значение <i>Включить</i>. Если вы не хотите, чтобы маршрутизатор транслировал SSID, тогда выберите <i>Отключить</i>.</dd";
hwl_basic.page6="<dd>Для Atheros настройте задержку ack на базе типичного максимального расстояния в метрах.<div class=\"note\"><h4>Примечание</h4><div>На устройствах, базирующихся на чипах Atheros, прошивка DD-WRT при использовании значения 0 не отключает, а наоборот, включает режим ACK задержки.</div></div><ul class=\"wide\"><li> 0 отключает ACK задержку полностью</li><li> 1 - 999999 настраивает АСК задержку</li></ul></dd>";
hwl_basic.page7="<dd>Проверьте все значения и нажмите <i>Сохранить</i> для сохранения настроек. Нажмите <i>Отменить</i> для отмены несохраненных изменений.</dd>";

// ** Fail_s.asp / Fail_u_s.asp / Fail.asp **//
fail.mess1="Вы ввели неверные данные. Пожалуйста, попробуйте ещё раз.";
fail.mess2="Обновление завершилось неуспешно.";


// ** Success*.asp / Reboot.asp  **//
success.saved="Значения сохранены.";
success.restore="Значения восстановлены.<br/>Идет перезагрузка. Пожалуйста, подождите...";
success.upgrade="Обновление успешно завершено.<br/>Идет перезагрузка. Пожалуйста, подождите ...";
success.success_noreboot="Значения приняты.";
success.success_reboot=success.success_noreboot + "<br />Идет перезагрузка. Пожалуйста, подождите ...";

success.alert_reset="Значения всех параметров выставлены по умолчанию.<br /><br />";
success.alert1="Пожалуйста, прежде чем снова подключиться к сети, имейте в виду следующее:";
success.alert2="Если вы изменили IP-адрес вашего маршрутизатора, учтите, что вы должны обновить/изменить адреса клиентов локальной сети.";
success.alert3="Если вы подключаетесь по беспроводной сети, присоединитесь к сети и нажмите <em>Продолжить</em>.";

// ** Logout.asp  **//
logout.message="Вы отключились от системы.<br />Благодарим вас за использование DD-WRT!";

// ** Setup Assistant **//
sas.title="Мастер настройки ";
sas.internet_connection="Интернет подключение";
sas.network_settings="Настройки сети";
sas.wireless_settings="Настройки Wi-Fi";
sas.other_settings="Прочие настройки";
sas.hwan="Настройка Интернета (WAN)";

hsas.wan="Интерфейс WAN подключает ваш маршрутизатор к Интернету или другим сетям. Если ваша сеть уже подключена к сети Интернет и вам только требуется использование точки доступа, установите режим WAN в положение \"Отключить\".";
hsas.h_routerip="IP маршрутизатора";
hsas.routerip="Это IP-адрес присвоенный вашему маршрутизатору в вашей внутренней сети. При изменении данного параметра вам необходимо будет использовать новый адрес для доступа к интерфейсу пользователя.";
hsas.h_dhcp="DHCP";
hsas.dhcp="ПК и прочие сетевые устройства могут автоматически получать адреса IP через протокол DHCP в вашей локальной сети без необходимости их ручной настройки. В случае использования стороннего сервера DHCP, отключите данную функцию во избежание возможных конфликтов.";
hsas.h_wireless_physical="Интерфейс беспроводного соединения";
hsas.wireless_physical="Настройки данного интерфейса определяют поведение беспроводного соединения маршрутизатора. Можно изменить режим работы (точка доступа, клиент или повторитель), имя беспроводной сети или дополнительные настройки, такие как ширина канала. В случае, если вы меняете ширину канала со стандартных 20 МГц, убедитесь, что подключаемые клиентские устройства поддерживают установленную ширину канала. ";
hsas.h_wireless_security="Безопасность беспроводного соединения";
hsas.wireless_security="Чтобы вам было легче настраивать клиентские устройства, вы можете изменить пароль беспроводного подключения. Отключение параметров безопасности или изменение его в пользу режима WEP не рекомендуется по соображениям безопасности.";
hsas.h_routername="Имя маршрутизатора";
hsas.routername="При помощи данного имени происходит общение с другими устройствами в сети и позволяет идентифицировать устройство.";
hsas.networking="Помощь по настройкам сети";
hsas.wireless="Помощь по настройкам беспроводного подключения";
hsas.other="Помощь по прочим настройкам";

// ** AOSS **//
haoss.basic="Система \"AirStation One-Touch Secure System\" (AOSS) позволяет подключение совместимых устройств к данной точке доступа без необходимости настройки вручную.";
haoss.securitymodes="Режим безопасности AOSS определяет какой из режимов безопасности клиентского устройства будет принят при согласовании AOSS-подключения. Если клиентское устройство не поддерживает ни один из режимов безопасности AOSS, то такое устройство не сможет подключиться.";
haoss.wps="WPS включает поддержку системы Wi-Fi Protected Setup с использованием кнопки WPS или PIN кода, который поставляется с вашим устройством.";

ias.title="Настройки";
ias.card_info="Карточка настроек";
ias.edit_note="Щелкните на любую информацию из карточки настроек для их редактирования.";
ias.assistant="Запустить мастер настройки";
ias.assistant_iptv="Запустить мастер IPTV";
ias.print_setup_card="Распечатать карточку настроек";
ias.print_guest_card="Распечатать гостевую карточку";
ias.apply_changes="Применить изменения";
ias.wlnetwork="Беспроводная Сеть";
ias.wlinfo_2_4_GHz="(2.4 ГГц) – Совместимая с 802.11n/g/b";
ias.wlinfo_5_GHz="(5 Ghz) – Совместимая с 802.11n/a";
ias.hl_setup_card="Карточка настроек";
ias.hl_client_access="Для клиентского доступа";
ias.hl_for_conf="Для настройки";
ias.hl_guest_card="Гостевая карточка";


// ************		OLD PAGES 		*******************************//
// *********************** DHCPTable.asp *****************************//
dhcp.titl="Таблица активных IP-адресов DHCP";
dhcp.h2="Таблица активных IP-адресов DHCP";
dhcp.server="IP-адрес DHCP-сервера :";
dhcp.tclient="Имя хоста клиента";

donate.mb="Вы можете также внести пожертвование через систему Moneybookers на счет mb@dd-wrt.com";

