{
  "1 Movie": "1 Film",
  "1 Show": "1 Programme",
  "A new TV tuner ({tunerMake} {tunerModel}) has been found! Plex DVR is the easiest way to record your favorite shows!": "A new TV tuner ({tunerMake} {tunerModel}) has been found! Plex DVR is the easiest way to record your favourite programmes!",
  "Ad": "Advert",
  "Ad in {seconds}": "Advert in {seconds}",
  "Add Library": "Add library",
  "Add Show to Watchlist": "Add Programme to Watchlist",
  "Add a TIDAL subscription to save your favorite music and playlists": "Add a TIDAL subscription to save your favourite music and playlists",
  "Add movies and shows to your Watchlist to catch up on later. Watching an item in the list or marking it as watched will remove it from the list.": "Add films and programmes to your Watchlist to catch up on later. Watching an item in the list or marking it as watched will remove it from the list.",
  "Add movies and shows to your Watchlist to catch up on later. Watching an item in the list or marking it as watched will remove it from the list. Get started by selecting items below to add to your Watchlist.": "Add films and programmes to your Watchlist to catch up on later. Watching an item in the list or marking it as watched will remove it from the list. Get started by selecting items below to add to your Watchlist.",
  "Add to Favorites": "Add to Favourites",
  "Add to Library": "Add to library",
  "Add to favorites": "Add to favourites",
  "Add {channelTitle} to favorites": "Add {channelTitle} to favourites",
  "Add {title} to favorites": "Add {title} to favourites",
  "Airing Details": "Airing details",
  "All Tuners are Currently in Use": "All tuners are currently in use",
  "All set! Your Plex Media Server is working hard to find your media and make it beautiful. Grab the Plex app for all your favorite devices to get the most out of Plex and start streaming everywhere!": "All set! Your Plex Media Server is working hard to find your media and make it beautiful. Grab the Plex app for all your favourite devices to get the most out of Plex and start streaming everywhere!",
  "All {1} settings and customization will be reset and restored to their default state.": "All {1} settings and customisation will be reset and restored to their default state.",
  "All {productName} settings and customization will be reset and restored to their default state. Other {productName} instances will not be affected.": "All {productName} settings and customisation will be reset and restored to their default state. Other {productName} instances will not be affected.",
  "All {productName} settings and customization will be reset and restored to their default state. This will affect other {productName} instances.": "All {productName} settings and customisation will be reset and restored to their default state. This will affect other {productName} instances.",
  "Analyze": "Analyse",
  "Analyze Library": "Analyse Library",
  "Analyzes all the media files in the library. The analysis captures information about the media which helps Plex decide how to optimally play back the media.": "Analyses all the media files in the library. The analysis captures information about the media which helps Plex decide how to optimally play back the media.",
  "Analyzing": "Analysing",
  "Analyzing {1} in {2} on {3}": "Analysing {1} in {2} on {3}",
  "Any {1} settings and customization made in this {1} instance will not be synchronized with other {1} instances.  This is because we have detected you have previously saved settings from a newer version of {1}.": "Any {1} settings and customisation made in this {1} instance will not be synchronised with other {1} instances.  This is because we have detected you have previously saved settings from a newer version of {1}.",
  "Are you sure you want to delete this version? You can enable it again in Optimized Versions Settings.": "Are you sure you want to delete this version? You can enable it again in Optimised Versions Settings.",
  "Authorized Devices": "Authorised Devices",
  "Behind the Scenes": "Behind the scenes",
  "By Folder": "By folder",
  "Change refresh rate of display to match video when playing in fullscreen.": "Change refresh rate of display to match video when playing in full screen.",
  "Changes to {productName} settings and customization will no longer synchronize with other {productName} instances.": "Changes to {productName} settings and customisation will no longer synchronise with other {productName} instances.",
  "Check the status in {1}Optimized Versions Settings{2}.": "Check the status in {1}Optimised Versions Settings{2}.",
  "Choose \"Optimize...\" on items in your library and optimized versions will appear here.": "Choose \"Optimise...\" on items in your library and optimised versions will appear here.",
  "Choose what you’d like to have in your sidebar navigation menu. (You’ll always have easy access to everything, so you can make changes and further customize your menu later.)": "Choose what you’d like to have in your sidebar navigation menu. (You’ll always have easy access to everything, so you can make changes and further customise your menu later.)",
  "Cinema Trailers to Play Before Movies": "Cinema Trailers to Play Before Films",
  "Confirm Password must match Password": "Confirm password must match password",
  "Conflict Detected": "Conflict detected",
  "Conversions for media optimization will appear here.": "Conversions for media optimisation will appear here.",
  "Create Library": "Create library",
  "Currently all {1} settings and customization apply to this {1} instance only.": "Currently all {1} settings and customisation apply to this {1} instance only.",
  "Currently all {1} settings and customization are synchronized with other {1} instances.": "Currently all {1} settings and customisation are synchronised with other {1} instances.",
  "Custom Filter...": "Custom filter...",
  "Customize your Media": "Customise your Media",
  "Deleted Scene": "Deleted scene",
  "Disable Remote Access": "Disable remote access",
  "Do you and your friends have the same taste in movies & TV? Sharing your Watch History is a great way to find out.": "Do you and your friends have the same taste in films & TV? Sharing your Watch History is a great way to find out.",
  "Enter Fullscreen": "Enter Full Screen",
  "Exit Fullscreen": "Exit Full Screen",
  "Favorites": "Favourites",
  "Generate a URL for all of your friends’ Watchlists. With this URL, you’ll be able to add your friends’ Watchlisted titles to all of your favorite services.": "Generate a URL for all of your friends’ Watchlists. With this URL, you’ll be able to add your friends’ Watchlisted titles to all of your favourite services.",
  "Generate your own unique URL for your Watchlist. With your URL, you’ll be able to add your Watchlist titles to all of your favorite services.": "Generate your own unique URL for your Watchlist. With your URL, you’ll be able to add your Watchlist titles to all of your favourite services.",
  "Help us out by following {1}our guide{2} to naming and organizing your media.": "Help us out by following {1}our guide{2} to naming and organising your media.",
  "Hooked on home automation? With a Plex Pass, you can setup \"webhooks\" - Have Plex dim the lights when you start a movie, or send a tweet after you finish an episode of your favourite TV show.": "Hooked on home automation? With a Plex Pass, you can setup \"webhooks\" - Have Plex dim the lights when you start a film, or send a tweet after you finish an episode of your favourite TV programme.",
  "Initializing Plex Media Server…": "Initialising Plex Media Server…",
  "Invalid Credentials": "Invalid credentials",
  "Invalid Password": "Invalid password",
  "Keep track of movies and shows you’ve watched and more.": "Keep track of films and programmes you’ve watched and more.",
  "Keeping Plex on top may cause problems switching between maximized and fullscreen window appearances. Disable this setting if you encounter problems.": "Keeping Plex on top may cause problems switching between maximised and full screen window appearances. Disable this setting if you encounter problems.",
  "Live Music Video": "Live music video",
  "Live TV Movie": "Live TV Film",
  "Live TV Movies": "Live TV Films",
  "Live TV Season": "Live TV Series",
  "Live TV Seasons": "Live TV Series",
  "Live TV Show": "Live TV Programme",
  "Live TV Shows": "Live TV Programmes",
  "Lyric Music Video": "Lyric music video",
  "Manage your completed conversions in {1}Optimized Versions Settings{2}.": "Manage your completed conversions in {1}Optimised Versions Settings{2}.",
  "Manage your optimized versions in {1}Optimized Versions Settings{2}.": "Manage your optimised versions in {1}Optimised Versions Settings{2}.",
  "Minimize Player": "Minimise Player",
  "Modify Recording": "Modify recording",
  "More control over TV season titles, episode ordering, and extras": "More control over TV series titles, episode ordering, and extras",
  "Movie": "Film",
  "Movie Library": "Film Library",
  "Movies": "Films",
  "Movies & Shows": "Films & Programmes",
  "Movies & Shows in Media Libraries": "Films & Programmes in Media Libraries",
  "Movies & TV": "Films & TV",
  "Music Video": "Music video",
  "Needs Update": "Needs update",
  "Next Page": "Next page",
  "No Movies Watched": "No Films Played",
  "No seasons": "No series",
  "Normalize Multi-channel Audio": "Normalise Multi-channel Audio",
  "Not authorized": "Not authorised",
  "On Deck": "On deck",
  "Optimize": "Optimise",
  "Optimize Database": "Optimise Database",
  "Optimize database complete": "Optimise database complete",
  "Optimize...": "Optimise...",
  "Optimized Versions": "Optimised Versions",
  "Optimized Versions requires Plex Media Server {1} or later.": "Optimised Versions requires Plex Media Server {1} or later.",
  "Organize Your Media": "Organise your media",
  "Organize, beautify, stream, and share your personal collection of movies, TV, music, and photos anywhere, on all your devices. To get started, download our free Plex Media Server software on the device where you store your media.": "Organise, beautify, stream, and share your personal collection of films, TV, music, and photos anywhere, on all your devices. To get started, download our free Plex Media Server software on the device where you store your media.",
  "Other Videos": "Other videos",
  "Other viewers are watching ads. Playback will resume automatically when they're done.": "Other viewers are watching adverts. Playback will resume automatically when they're done.",
  "Personalize": "Personalise",
  "Photo Album": "Photo album",
  "Play your media on any screen with your favorite Plex app": "Play your media on any screen with your favourite Plex app",
  "Playing ad": "Playing advert",
  "Playing ad {index} of {total}": "Playing advert {index} of {total}",
  "Please enable one or more Discover features on the Online Media Sources page to customize your Streaming Services.": "Please enable one or more Discover features on the Online Media Sources page to customise your Streaming Services.",
  "Plex organizes your media into libraries. You can add as many libraries as you want, and you can have multiple libraries with the same type.": "Plex organises your media into libraries. You can add as many libraries as you want, and you can have multiple libraries with the same type.",
  "Plex scans your media, automatically organizes it, and makes it beautiful": "Plex scans your media, automatically organises it, and makes it beautiful",
  "Postal Code": "Postal code",
  "Postal Code is not in correct format": "Postcode is not in correct format",
  "Previous Page": "Previous page",
  "Recently Viewed": "Recently viewed",
  "Recently Viewed Shows": "Recently viewed programmes",
  "Record Options": "Record options",
  "Remove From Plex Home": "Remove from Plex Home",
  "Remove Show from Watchlist": "Remove Programme from Watchlist",
  "Remove from Favorites": "Remove from Favourites",
  "Remove from favorites": "Remove from favourites",
  "Remove {channelTitle} from favorites": "Remove {channelTitle} from favourites",
  "Remove {title} from favorites": "Remove {title} from favourites",
  "Reset Customization": "Reset Customisation",
  "Reset customization": "Reset customisation",
  "Save Your Favorites": "Save Your Favourites",
  "Search for Movies & Shows": "Search for Films & Programmes",
  "Season": "Series",
  "Season {seasonNumber}": "Series {seasonNumber}",
  "Seasons": "Series",
  "Select Channel": "Select channel",
  "Select Country": "Select country",
  "Select Language": "Select language",
  "Select Region": "Select region",
  "Select the other streaming services you use. Content from Plex and your selected services will be prioritized when displaying \"More Ways to Watch\" results and recommendations in Discover. You may also see recommendations from other services.": "Select the other streaming services you use. Content from Plex and your selected services will be prioritised when displaying \"More Ways to Watch\" results and recommendations in Discover. You may also see recommendations from other services.",
  "Select your favorite streaming services": "Select your favourite streaming services",
  "Share something about yourself. Try starting with some of your favorite movies, genres, and TV shows!": "Share something about yourself. Try starting with some of your favourite films, genres, and TV programmes!",
  "Show": "Programme",
  "Show Advanced": "Show advanced",
  "Show Basic": "Show basic",
  "Shows": "Programmes",
  "Similar Artist": "Similar artist",
  "Skip Ads": "Skip Adverts",
  "Start watching and your history will appear here. Or search for any movie or show you fancy to add anything manually to your watch history.": "Start watching and your history will appear here. Or search for any film or programme you fancy to add anything manually to your watch history.",
  "Still think Elton is saying “Hold me closer, Tony Danza”? With a Plex Pass, enjoy timed lyrics (when available) to your favorite songs for the ultimate sing-along… with the right words!": "Still think Elton is saying “Hold me closer, Tony Danza”? With a Plex Pass, enjoy timed lyrics (when available) to your favourite songs for the ultimate sing-along… with the right words!",
  "Subtitle Color": "Subtitle Colour",
  "TV Show Episode": "TV Programme Episode",
  "TV Show Season": "TV Show Series",
  "TV Shows": "TV Programmes",
  "The best blend of artwork, summaries, ratings, and more from all your favorite sources": "The best blend of artwork, summaries, ratings, and more from all your favourite sources",
  "The current video file has not been analyzed for voice activity data yet.": "The current video file has not been analysed for voice activity data yet.",
  "The database was optimized.": "The database was optimised.",
  "The username or password is incorrect": "The username or password is incorrect.",
  "There are no Movies in your Watchlist": "There are no Films in your Watchlist",
  "There are no Shows in your Watchlist": "There are no Programmes in your Watchlist",
  "There was a problem analyzing the library.": "There was a problem analysing the library.",
  "There was a problem analyzing this item.": "There was a problem analysing this item.",
  "There was a problem optimizing the database.": "There was a problem optimising the database.",
  "There was a problem optimizing this database.": "There was a problem optimising this database.",
  "There was a problem preparing for optimization.": "There was a problem preparing for optimisation.",
  "There was an unexpected error analyzing an item.": "There was an unexpected error analysing an item.",
  "There was an unexpected error favoriting an item.": "There was an unexpected error favouriting an item.",
  "There was an unexpected error unfavoriting an item.": "There was an unexpected error unfavouriting an item.",
  "This is an account setting that synchronizes your data across all Plex Media Servers you have access to, Plex Movies & TV, and Discover.": "This is an account setting that synchronises your data across all Plex Media Servers you have access to, Plex Films & TV, and Discover.",
  "This video needs to be converted for playback and contains High Dynamic Range (HDR) content. Colors will appear distorted on this device.": "This video needs to be converted for playback and contains High Dynamic Range (HDR) content. Colours will appear distorted on this device.",
  "Toggle FullScreen": "Toggle Full Screen",
  "Track Artist": "Track artist",
  "Unable to analyze": "Unable to analyse",
  "Unable to disable guest account": "Cannot enable guest account",
  "Unable to enable guest account": "Cannot enable guest account",
  "Unable to load seasons": "Unable to load series",
  "Unauthorized": "Unauthorised",
  "Upgrade your Movie and TV libraries to {openLink}the new improved metadata agents today{closeLink}!": "Upgrade your Film and TV libraries to {openLink}the new improved metadata agents today{closeLink}!",
  "Version Background Processing Target": "Version background processing target",
  "Video optimization may take a long time to complete on this server. You'll be able to use Plex normally while you wait.": "Video optimisation may take a long time to complete on this server. You'll be able to use Plex normally while you wait.",
  "We couldn't find any hardware we recognize, but will continue to look for available devices.": "We couldn't find any hardware we recognise, but will continue to look for available devices.",
  "We found hardware we recognize!": "We found hardware we recognise!",
  "When you watch or rate a movie or show, ": "When you watch or rate a film or programme, ",
  "With Plex Pass and a digital tuner, you can record over-the-air broadcast TV and watch your favorite shows, movies, news, and sports on any device, anywhere in the world. Cut the cord and love TV again.": "With Plex Pass and a digital tuner, you can record over-the-air broadcast TV and watch your favourite programmes, films, news, and sports on any device, anywhere in the world. Cut the cord and love TV again.",
  "With Plex, you’re just one click away from streaming virtually any movie or TV show, no matter where it lives. Just tell us your favorite streaming services and we’ll take care of the rest.": "With Plex, you’re just one click away from streaming virtually any film or TV programme, no matter where it lives. Just tell us your favourite streaming services and we’ll take care of the rest.",
  "With a Plex Pass, you can preview the new \"HDR tone mapping\" feature to correct colors during conversion!": "With a Plex Pass, you can preview the new \"HDR tone mapping\" feature to correct colours during conversion!",
  "With a TIDAL subscription you can add Albums, artists, tracks and videos to My TIDAL to keep track of your favorite music.": "With a TIDAL subscription you can add albums, artists, tracks and videos to My TIDAL to keep track of your favourite music.",
  "Your favorite sources will appear here. Any source in the MORE menu below can be saved here for quick access.": "Your favourite sources will appear here. Any source in the MORE menu below can be saved here for quick access.",
  "Your review cannot be published.": "Your review has been published.",
  "Your selected services will be prioritized within your results and recommendations throughout Plex to help customize your experience.": "Your selected services will be prioritised within your results and recommendations throughout Plex to help customise your experience.",
  "{airingsCount} airings": "{airingsCount} broadcasts",
  "{albumCount} Albums": "{albumCount} albums",
  "{dayOfWeekAbbreviated}, {monthAbbreviated} {dayNumber}": "{dayOfWeekAbbreviated}, {dayNumber} {monthAbbreviated}",
  "{dayOfWeek} {monthNumber}/{dayNumber}": "{dayOfWeek} {dayNumber}/{monthNumber}",
  "{dayOfWeek}, {monthNumber} {dayNumber}": "{dayOfWeek}, {dayNumber} {monthNumber}",
  "{itemCount} movie": "{itemCount} film",
  "{itemCount} movies": "{itemCount} films",
  "{itemCount} season": "{itemCount} series",
  "{itemCount} seasons": "{itemCount} series",
  "{itemCount} show": "{itemCount} programme",
  "{itemCount} shows": "{itemCount} programmes",
  "{monthAbbreviated} {dayNumber}": "{dayNumber} {monthAbbreviated}",
  "{monthName} {day}, {year}": "{day} {monthName} {year}",
  "{monthNumber}/{dayNumber}/{shortYear}": "{dayNumber}/{monthNumber}/{shortYear}",
  "{month} {dayNumber}": "{dayNumber} {month}",
  "{month} {dayNumber}, {year}": "{dayNumber} {month} {year}",
  "{movieCount} Movies": "{movieCount} Films",
  "{productName} settings and customization will now be used on other {productName} instances.": "{productName} settings and customisation will now be used on other {productName} instances.",
  "{seasonCount} season": "{seasonCount} series",
  "{seasonCount} seasons": "{seasonCount} series",
  "{showCount} Shows": "{showCount} Programmes",
  "{trackCount} Tracks": "{trackCount} tracks"
}