$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '7.4.0',
          'Headers' => {
                         'libyang.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libyang.so.1.8.4',
          'LibraryVersion' => '1.0.176',
          'NameSpaces' => {},
          'Needed' => {
                        'ld-linux-x86-64.so.2' => 1,
                        'libc.so.6' => 1,
                        'libdl.so.2' => 1,
                        'libpcre.so.3' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'common.c' => 1,
                         'context.c' => 1,
                         'log.c' => 1,
                         'tree_data.c' => 1
                       },
          'SymbolInfo' => {
                            '13906' => {
                                         'Header' => 'libyang.h',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'ctx',
                                                               'type' => '3714'
                                                             },
                                                      '1' => {

                                                 'lys_features_state' => 1,
                                                 'lys_find_path' => 1,
                                                 'lys_getnext' => 1,
                                                 'lys_getnext_union_type' => 1,
                                                 'lys_iffeature_free' => 1,
                                                 'lys_iffeature_value' => 1,
                                                 'lys_implemented_module' => 1,
                                                 'lys_is_disabled' => 1,
                                                 'lys_is_key' => 1,
                                                 'lys_main_module' => 1,
                                                 'lys_node_module' => 1,
                                                 'lys_node_xpath_atomize' => 1,
                                                 'lys_parent' => 1,
                                                 'lys_parse_fd' => 1,
                                                 'lys_parse_mem' => 1,
                                                 'lys_parse_path' => 1,
                                                 'lys_path' => 1,
                                                 'lys_print_clb' => 1,
                                                 'lys_print_fd' => 1,
                                                 'lys_print_file' => 1,
                                                 'lys_print_mem' => 1,
                                                 'lys_print_path' => 1,
                                                 'lys_search_localfile' => 1,
                                                 'lys_set_disabled' => 1,
                                                 'lys_set_enabled' => 1,
                                                 'lys_set_implemented' => 1,
                                                 'lys_set_private' => 1,
                                                 'lys_xpath_atomize' => 1,
                                                 'lyxml_dup' => 1,
                                                 'lyxml_free' => 1,
                                                 'lyxml_free_withsiblings' => 1,
                                                 'lyxml_get_attr' => 1,
                                                 'lyxml_get_ns' => 1,
                                                 'lyxml_parse_mem' => 1,
                                                 'lyxml_parse_path' => 1,
                                                 'lyxml_print_clb' => 1,
                                                 'lyxml_print_fd' => 1,
                                                 'lyxml_print_file' => 1,
                                                 'lyxml_print_mem' => 1,
                                                 'lyxml_unlink' => 1
                                               }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10009' => {
                                       'Header' => 'libyang.h',
                                       'Line' => '2136',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'level',
                                                            'offset' => '0',
                                                            'type' => '9433'
                                                          },
                                                   '1' => {
                                                            'name' => 'no',
                                                            'offset' => '4',
                                                            'type' => '9502'
                                                          },
                                                   '2' => {
                                                            'name' => 'vecode',
                                                            'offset' => '8',
                                                            'type' => '9997'
                                                          },
                                                   '3' => {
                                                            'name' => 'msg',
                                                            'offset' => '16',
                                                            'type' => '238'
                                                          },
                                                   '4' => {
                                                            'name' => 'path',
                                                            'offset' => '24',
                                                            'type' => '238'
                                                          },
                                                   '5' => {
                                                            'name' => 'apptag',
                                                            'offset' => '32',
                                                            'type' => '238'
                                                          },
                                                   '6' => {
                                                            'name' => 'next',
                                                            'offset' => '40',
                                                            'type' => '10126'
                                                          },
                                                   '7' => {
                                                            'name' => 'prev',
                                                            'offset' => '48',
                                                            'type' => '10126'
                                                          }
                                                 },
                                       'Name' => 'struct ly_err_item',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '10126' => {
                                       'BaseType' => '10009',
                                       'Name' => 'struct ly_err_item*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10132' => {
                                       'BaseType' => '10143',
                                       'Header' => 'hash_table.h',
                                       'Line' => '44',
                                       'Name' => 'values_equal_cb',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10143' => {
                                       'Name' => 'int(*)(void*, void*, int, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '231'
                                                           },
                                                    '1' => {
                                                             'type' => '231'
                                                           },
                                                    '2' => {
                                                             'type' => '157'
                                                           },
                                                    '3' => {
                                                             'type' => '231'
                                                           }
                                                  },
                                       'Return' => '157',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10179' => {
                                       'BaseType' => '45',
                                       'Name' => 'unsigned char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10185' => {
                                       'Header' => 'hash_table.h',
                                       'Line' => '95',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hash_tab',
                                                            'offset' => '0',
                                                            'type' => '9176'
                                                          },
                                                   '1' => {
                                                            'name' => 'lock',
                                                            'offset' => '8',
                                                            'type' => '743'
                                                          }
                                                 },
                                       'Name' => 'struct dict_table',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '10350' => {
                                       'Header' => 'extensions.h',
                                       'Line' => '67',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'LYEXT_PAR_MODULE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'LYEXT_PAR_NODE',
                                                            'value' => '1'
                                                          },
                                                   '10' => {
                                                             'name' => 'LYEXT_PAR_EXT',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'LYEXT_PAR_EXTINST',
                                                             'value' => '11'
                                                           },
                                                   '12' => {
                                                             'name' => 'LYEXT_PAR_REFINE',
                                                             'value' => '12'
                                                           },
                                                   '13' => {
                                                             'name' => 'LYEXT_PAR_DEVIATION',
                                                             'value' => '13'
                                                           },
                                                   '14' => {
                                                             'name' => 'LYEXT_PAR_DEVIATE',
                                                             'value' => '14'
                                                           },
                                                   '15' => {
                                                             'name' => 'LYEXT_PAR_IMPORT',
                                                             'value' => '15'
                                                           },
                                                   '16' => {
                                                             'name' => 'LYEXT_PAR_INCLUDE',
                                                             'value' => '16'
                                                           },
                                                   '17' => {
                                                             'name' => 'LYEXT_PAR_REVISION',
                                                             'value' => '17'
                                                           },
                                                   '18' => {
                                                             'name' => 'LYEXT_PAR_IFFEATURE',
                                                             'value' => '18'
                                                           },
                                                   '2' => {
                                                            'name' => 'LYEXT_PAR_TPDF',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'LYEXT_PAR_TYPE',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'LYEXT_PAR_TYPE_BIT',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'LYEXT_PAR_TYPE_ENUM',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'LYEXT_PAR_FEATURE',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'LYEXT_PAR_RESTR',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'LYEXT_PAR_WHEN',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'LYEXT_PAR_IDENT',
                                                            'value' => '9'
                                                          }
                                                 },
                                       'Name' => 'enum LYEXT_PAR',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10573' => {
                                       'Header' => 'extensions.h',
                                       'Line' => '127',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'LYEXT_SUBSTMT_ALL',
                                                            'value' => '-1'
                                                          },
                                                   '1' => {
                                                            'name' => 'LYEXT_SUBSTMT_SELF',
                                                            'value' => '0'
                                                          },
                                                   '10' => {
                                                             'name' => 'LYEXT_SUBSTMT_KEY',
                                                             'value' => '9'
                                                           },
                                                   '11' => {
                                                             'name' => 'LYEXT_SUBSTMT_NAMESPACE',
                                                             'value' => '10'
                                                           },
                                                   '12' => {
                                                             'name' => 'LYEXT_SUBSTMT_ORGANIZATION',
                                                             'value' => '11'
                                                           },
                                                   '13' => {
                                                             'name' => 'LYEXT_SUBSTMT_PATH',
                                                             'value' => '12'
                                                           },
                                                   '14' => {
                                                             'name' => 'LYEXT_SUBSTMT_PREFIX',
                                                             'value' => '13'
                                                           },
                                                   '15' => {
                                                             'name' => 'LYEXT_SUBSTMT_PRESENCE',
                                                             'value' => '14'
                                                           },
                                                   '16' => {
                                                             'name' => 'LYEXT_SUBSTMT_REFERENCE',
                                                             'value' => '15'
                                                           },
                                                   '17' => {
                                                             'name' => 'LYEXT_SUBSTMT_REVISIONDATE',
                                                             'value' => '16'
                                                           },
                                                   '18' => {
                                                             'name' => 'LYEXT_SUBSTMT_UNITS',
                                                             'value' => '17'
                                                           },
                                                   '19' => {
                                                             'name' => 'LYEXT_SUBSTMT_VALUE',
                                                             'value' => '18'
                                                           },
                                                   '2' => {
                                                            'name' => 'LYEXT_SUBSTMT_ARGUMENT',
                                                            'value' => '1'
                                                          },
                                                   '20' => {
                                                             'name' => 'LYEXT_SUBSTMT_VERSION',
                                                             'value' => '19'
                                                           },
                                                   '21' => {
                                                             'name' => 'LYEXT_SUBSTMT_MODIFIER',
                                                             'value' => '20'
                                                           },
                                                   '22' => {
                                                             'name' => 'LYEXT_SUBSTMT_REQINSTANCE',
                                                             'value' => '21'
                                                           },
                                                   '23' => {
                                                             'name' => 'LYEXT_SUBSTMT_YINELEM',
                                                             'value' => '22'
                                                           },
                                                   '24' => {
                                                             'name' => 'LYEXT_SUBSTMT_CONFIG',
                                                             'value' => '23'
                                                           },
                                                   '25' => {
                                                             'name' => 'LYEXT_SUBSTMT_MANDATORY',
                                                             'value' => '24'
                                                           },
                                                   '26' => {
                                                             'name' => 'LYEXT_SUBSTMT_ORDEREDBY',
                                                             'value' => '25'
                                                           },
                                                   '27' => {
                                                             'name' => 'LYEXT_SUBSTMT_STATUS',
                                                             'value' => '26'
                                                           },
                                                   '28' => {
                                                             'name' => 'LYEXT_SUBSTMT_DIGITS',
                                                             'value' => '27'
                                                           },
                                                   '29' => {
                                                             'name' => 'LYEXT_SUBSTMT_MAX',
                                                             'value' => '28'
                                                           },
                                                   '3' => {
                                                            'name' => 'LYEXT_SUBSTMT_BASE',
                                                            'value' => '2'
                                                          },
                                                   '30' => {
                                                             'name' => 'LYEXT_SUBSTMT_MIN',
                                                             'value' => '29'
                                                           },
                                                   '31' => {
                                                             'name' => 'LYEXT_SUBSTMT_POSITION',
                                                             'value' => '30'
                                                           },
                                                   '32' => {
                                                             'name' => 'LYEXT_SUBSTMT_UNIQUE',
                                                             'value' => '31'
                                                           },
                                                   '4' => {
                                                            'name' => 'LYEXT_SUBSTMT_BELONGSTO',
                                                            'value' => '3'
                                                          },
                                                   '5' => {
                                                            'name' => 'LYEXT_SUBSTMT_CONTACT',
                                                            'value' => '4'
                                                          },
                                                   '6' => {
                                                            'name' => 'LYEXT_SUBSTMT_DEFAULT',
                                                            'value' => '5'
                                                          },
                                                   '7' => {
                                                            'name' => 'LYEXT_SUBSTMT_DESCRIPTION',
                                                            'value' => '6'
                                                          },
                                                   '8' => {
                                                            'name' => 'LYEXT_SUBSTMT_ERRTAG',
                                                            'value' => '7'
                                                          },
                                                   '9' => {
                                                            'name' => 'LYEXT_SUBSTMT_ERRMSG',
                                                            'value' => '8'
                                                          }
                                                 },
                                       'Name' => 'enum LYEXT_SUBSTMT',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10584' => {
                                       'BaseType' => '10595',
                                       'Header' => 'extensions.h',
                                       'Line' => '142',
                                       'Name' => 'lyext_check_position_clb',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10595' => {
                                       'Name' => 'int(*)(void const*, LYEXT_PAR, LYEXT_SUBSTMT)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1446'
                                                           },
                                                    '1' => {
                                                             'type' => '10350'
                                                           },
                                                    '2' => {
                                                             'type' => '10573'
                                                           }
                                                  },
                                       'Return' => '157',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '106' => {
                                     'BaseType' => '45',
                                     'Header' => 'types.h',
                                     'Line' => '37',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '10626' => {
                                       'BaseType' => '10637',
                                       'Header' => 'extensions.h',
                                       'Line' => '152',
                                       'Name' => 'lyext_check_result_clb',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10637' => {
                                       'Name' => 'int(*)(struct lys_ext_instance*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2730'
                                                           }
                                                  },
                                       'Return' => '157',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10658' => {
                                       'BaseType' => '10669',
                                       'Header' => 'extensions.h',
                                       'Line' => '165',
                                       'Name' => 'lyext_check_inherit_clb',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10669' => {
                                       'Name' => 'int(*)(struct lys_ext_instance*, struct lys_node*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2730'
                                                           },
                                                    '1' => {
                                                             'type' => '5163'
                                                           }
                                                  },
                                       'Return' => '157',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10695' => {
                                       'BaseType' => '10706',
                                       'Header' => 'extensions.h',
                                       'Line' => '176',
                                       'Name' => 'lyext_valid_data_clb',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10706' => {
                                       'Name' => 'int(*)(struct lys_ext_instance*, struct lyd_node*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2730'
                                                           },
                                                    '1' => {
                                                             'type' => '8941'
                                                           }
                                                  },
                                       'Return' => '157',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10732' => {
                                       'BaseType' => '3269',
                                       'Name' => 'struct lys_module**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '117' => {
                                     'BaseType' => '128',
                                     'Header' => 'types.h',
                                     'Line' => '38',
                                     'Name' => '__int16_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '1230' => {
                                      'BaseType' => '249',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '12757' => {
                                       'Header' => 'context.h',
                                       'Line' => '25',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'search_paths',
                                                            'offset' => '0',
                                                            'type' => '1470'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '8',
                                                            'type' => '157'
                                                          },
                                                   '2' => {
                                                            'name' => 'used',
                                                            'offset' => '12',
                                                            'type' => '157'
                                                          },
                                                   '3' => {
                                                            'name' => 'list',
                                                            'offset' => '16',
                                                            'type' => '10732'
                                                          },
                                                   '4' => {
                                                            'name' => 'parsing_sub_modules',
                                                            'offset' => '24',
                                                            'type' => '10732'
                                                          },
                                                   '5' => {
                                                            'name' => 'parsed_submodules',
                                                            'offset' => '32',
                                                            'type' => '10732'
                                                          },
                                                   '6' => {
                                                            'name' => 'parsing_sub_modules_count',
                                                            'offset' => '40',
                                                            'type' => '1532'
                                                          },
                                                   '7' => {
                                                            'name' => 'parsed_submodules_count',
                                                            'offset' => '41',
                                                            'type' => '1532'
                                                          },
                                                   '8' => {
                                                            'name' => 'module_set_id',
                                                            'offset' => '42',
                                                            'type' => '1548'
                                                          },
                                                   '9' => {
                                                            'name' => 'flags',
                                                            'offset' => '44',
                                                            'type' => '157'
                                                          }
                                                 },
                                       'Name' => 'struct ly_modules_list',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '128' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '135' => {
                                     'BaseType' => '57',
                                     'Header' => 'types.h',
                                     'Line' => '39',
                                     'Name' => '__uint16_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '13900' => {
                                       'BaseType' => '5158',
                                       'Name' => 'struct lys_node const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1402' => {
                                      'BaseType' => '88',
                                      'Header' => 'stdint-intn.h',
                                      'Line' => '24',
                                      'Name' => 'int8_t',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1413' => {
                                      'BaseType' => '117',
                                      'Header' => 'stdint-intn.h',
                                      'Line' => '25',
                                      'Name' => 'int16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '1424' => {
                                      'BaseType' => '146',
                                      'Header' => 'stdint-intn.h',
                                      'Line' => '26',
                                      'Name' => 'int32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1435' => {
                                      'BaseType' => '180',
                                      'Header' => 'stdint-intn.h',
                                      'Line' => '27',
                                      'Name' => 'int64_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1446' => {
                                      'BaseType' => '1457',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1457' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '146' => {
                                     'BaseType' => '157',
                                     'Header' => 'types.h',
                                     'Line' => '40',
                                     'Name' => '__int32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '1470' => {
                                      'BaseType' => '238',
                                      'Name' => 'char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1532' => {
                                      'BaseType' => '106',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1548' => {
                                      'BaseType' => '135',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '1559' => {
                                      'BaseType' => '169',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '157' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1570' => {
                                      'BaseType' => '198',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1613' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '191',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'LYS_IN_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'LYS_IN_YANG',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'LYS_IN_YIN',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum LYS_INFORMAT',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '1624' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '229',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'LYS_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'LYS_CONTAINER',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'LYS_INPUT',
                                                            'value' => '512'
                                                          },
                                                  '11' => {
                                                            'name' => 'LYS_OUTPUT',
                                                            'value' => '1024'
                                                          },
                                                  '12' => {
                                                            'name' => 'LYS_GROUPING',
                                                            'value' => '2048'
                                                          },
                                                  '13' => {
                                                            'name' => 'LYS_USES',
                                                            'value' => '4096'
                                                          },
                                                  '14' => {
                                                            'name' => 'LYS_AUGMENT',
                                                            'value' => '8192'
                                                          },
                                                  '15' => {
                                                            'name' => 'LYS_ACTION',
                                                            'value' => '16384'
                                                          },
                                                  '16' => {
                                                            'name' => 'LYS_ANYDATA',
                                                            'value' => '32800'
                                                          },
                                                  '17' => {
                                                            'name' => 'LYS_EXT',
                                                            'value' => '65536'
                                                          },
                                                  '2' => {
                                                           'name' => 'LYS_CHOICE',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'LYS_LEAF',
                                                           'value' => '4'
                                                         },
                                                  '4' => {
                                                           'name' => 'LYS_LEAFLIST',
                                                           'value' => '8'
                                                         },
                                                  '5' => {
                                                           'name' => 'LYS_LIST',
                                                           'value' => '16'
                                                         },
                                                  '6' => {
                                                           'name' => 'LYS_ANYXML',
                                                           'value' => '32'
                                                         },
                                                  '7' => {
                                                           'name' => 'LYS_CASE',
                                                           'value' => '64'
                                                         },
                                                  '8' => {
                                                           'name' => 'LYS_NOTIF',
                                                           'value' => '128'
                                                         },
                                                  '9' => {
                                                           'name' => 'LYS_RPC',
                                                           'value' => '256'
                                                         }
                                                },
                                      'Name' => 'enum lys_nodetype',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '169' => {
                                     'BaseType' => '69',
                                     'Header' => 'types.h',
                                     'Line' => '41',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '17433' => {
                                       'BaseType' => '3709',
                                       'Name' => 'struct ly_ctx const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1761' => {
                                      'BaseType' => '1624',
                                      'Header' => 'tree_schema.h',
                                      'Line' => '248',
                                      'Name' => 'LYS_NODE',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '180' => {
                                     'BaseType' => '191',
                                     'Header' => 'types.h',
                                     'Line' => '43',
                                     'Name' => '__int64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '191' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '198' => {
                                     'BaseType' => '81',
                                     'Header' => 'types.h',
                                     'Line' => '44',
                                     'Name' => '__uint64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '19896' => {
                                       'BaseType' => '1559',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2207' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '367',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'LY_STMT_NODE',
                                                           'value' => '-1'
                                                         },
                                                  '1' => {
                                                           'name' => 'LY_STMT_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '10' => {
                                                            'name' => 'LY_STMT_KEY',
                                                            'value' => '9'
                                                          },
                                                  '11' => {
                                                            'name' => 'LY_STMT_NAMESPACE',
                                                            'value' => '10'
                                                          },
                                                  '12' => {
                                                            'name' => 'LY_STMT_ORGANIZATION',
                                                            'value' => '11'
                                                          },
                                                  '13' => {
                                                            'name' => 'LY_STMT_PATH',
                                                            'value' => '12'
                                                          },
                                                  '14' => {
                                                            'name' => 'LY_STMT_PREFIX',
                                                            'value' => '13'
                                                          },
                                                  '15' => {
                                                            'name' => 'LY_STMT_PRESENCE',
                                                            'value' => '14'
                                                          },
                                                  '16' => {
                                                            'name' => 'LY_STMT_REFERENCE',
                                                            'value' => '15'
                                                          },
                                                  '17' => {
                                                            'name' => 'LY_STMT_REVISIONDATE',
                                                            'value' => '16'
                                                          },
                                                  '18' => {
                                                            'name' => 'LY_STMT_UNITS',
                                                            'value' => '17'
                                                          },
                                                  '19' => {
                                                            'name' => 'LY_STMT_VALUE',
                                                            'value' => '18'
                                                          },
                                                  '2' => {
                                                           'name' => 'LY_STMT_ARGUMENT',
                                                           'value' => '1'
                                                         },
                                                  '20' => {
                                                            'name' => 'LY_STMT_VERSION',
                                                            'value' => '19'
                                                          },
                                                  '21' => {
                                                            'name' => 'LY_STMT_MODIFIER',
                                                            'value' => '20'
                                                          },
                                                  '22' => {
                                                            'name' => 'LY_STMT_REQINSTANCE',
                                                            'value' => '21'
                                                          },
                                                  '23' => {
                                                            'name' => 'LY_STMT_YINELEM',
                                                            'value' => '22'
                                                          },
                                                  '24' => {
                                                            'name' => 'LY_STMT_CONFIG',
                                                            'value' => '23'
                                                          },
                                                  '25' => {
                                                            'name' => 'LY_STMT_MANDATORY',
                                                            'value' => '24'
                                                          },
                                                  '26' => {
                                                            'name' => 'LY_STMT_ORDEREDBY',
                                                            'value' => '25'
                                                          },
                                                  '27' => {
                                                            'name' => 'LY_STMT_STATUS',
                                                            'value' => '26'
                                                          },
                                                  '28' => {
                                                            'name' => 'LY_STMT_DIGITS',
                                                            'value' => '27'
                                                          },
                                                  '29' => {
                                                            'name' => 'LY_STMT_MAX',
                                                            'value' => '28'
                                                          },
                                                  '3' => {
                                                           'name' => 'LY_STMT_BASE',
                                                           'value' => '2'
                                                         },
                                                  '30' => {
                                                            'name' => 'LY_STMT_MIN',
                                                            'value' => '29'
                                                          },
                                                  '31' => {
                                                            'name' => 'LY_STMT_POSITION',
                                                            'value' => '30'
                                                          },
                                                  '32' => {
                                                            'name' => 'LY_STMT_UNIQUE',
                                                            'value' => '31'
                                                          },
                                                  '33' => {
                                                            'name' => 'LY_STMT_MODULE',
                                                            'value' => '32'
                                                          },
                                                  '34' => {
                                                            'name' => 'LY_STMT_ACTION',
                                                            'value' => '33'
                                                          },
                                                  '35' => {
                                                            'name' => 'LY_STMT_ANYDATA',
                                                            'value' => '34'
                                                          },
                                                  '36' => {
                                                            'name' => 'LY_STMT_ANYXML',
                                                            'value' => '35'
                                                          },
                                                  '37' => {
                                                            'name' => 'LY_STMT_CASE',
                                                            'value' => '36'
                                                          },
                                                  '38' => {
                                                            'name' => 'LY_STMT_CHOICE',
                                                            'value' => '37'
                                                          },
                                                  '39' => {
                                                            'name' => 'LY_STMT_CONTAINER',
                                                            'value' => '38'
                                                          },
                                                  '4' => {
                                                           'name' => 'LY_STMT_BELONGSTO',
                                                           'value' => '3'
                                                         },
                                                  '40' => {
                                                            'name' => 'LY_STMT_GROUPING',
                                                            'value' => '39'
                                                          },
                                                  '41' => {
                                                            'name' => 'LY_STMT_INPUT',
                                                            'value' => '40'
                                                          },
                                                  '42' => {
                                                            'name' => 'LY_STMT_LEAF',
                                                            'value' => '41'
                                                          },
                                                  '43' => {
                                                            'name' => 'LY_STMT_LEAFLIST',
                                                            'value' => '42'
                                                          },
                                                  '44' => {
                                                            'name' => 'LY_STMT_LIST',
                                                            'value' => '43'
                                                          },
                                                  '45' => {
                                                            'name' => 'LY_STMT_NOTIFICATION',
                                                            'value' => '44'
                                                          },
                                                  '46' => {
                                                            'name' => 'LY_STMT_OUTPUT',
                                                            'value' => '45'
                                                          },
                                                  '47' => {
                                                            'name' => 'LY_STMT_USES',
                                                            'value' => '46'
                                                          },
                                                  '48' => {
                                                            'name' => 'LY_STMT_TYPEDEF',
                                                            'value' => '47'
                                                          },
                                                  '49' => {
                                                            'name' => 'LY_STMT_TYPE',
                                                            'value' => '48'
                                                          },
                                                  '5' => {
                                                           'name' => 'LY_STMT_CONTACT',
                                                           'value' => '4'
                                                         },
                                                  '50' => {
                                                            'name' => 'LY_STMT_IFFEATURE',
                                                            'value' => '49'
                                                          },
                                                  '51' => {
                                                            'name' => 'LY_STMT_LENGTH',
                                                            'value' => '50'
                                                          },
                                                  '52' => {
                                                            'name' => 'LY_STMT_MUST',
                                                            'value' => '51'
                                                          },
                                                  '53' => {
                                                            'name' => 'LY_STMT_PATTERN',
                                                            'value' => '52'
                                                          },
                                                  '54' => {
                                                            'name' => 'LY_STMT_RANGE',
                                                            'value' => '53'
                                                          },
                                                  '55' => {
                                                            'name' => 'LY_STMT_WHEN',
                                                            'value' => '54'
                                                          },
                                                  '56' => {
                                                            'name' => 'LY_STMT_REVISION',
                                                            'value' => '55'
                                                          },
                                                  '57' => {
                                                            'name' => 'LY_STMT_SUBMODULE',
                                                            'value' => '56'
                                                          },
                                                  '58' => {
                                                            'name' => 'LY_STMT_RPC',
                                                            'value' => '57'
                                                          },
                                                  '59' => {
                                                            'name' => 'LY_STMT_BIT',
                                                            'value' => '58'
                                                          },
                                                  '6' => {
                                                           'name' => 'LY_STMT_DEFAULT',
                                                           'value' => '5'
                                                         },
                                                  '60' => {
                                                            'name' => 'LY_STMT_ENUM',
                                                            'value' => '59'
                                                          },
                                                  '61' => {
                                                            'name' => 'LY_STMT_REFINE',
                                                            'value' => '60'
                                                          },
                                                  '62' => {
                                                            'name' => 'LY_STMT_AUGMENT',
                                                            'value' => '61'
                                                          },
                                                  '63' => {
                                                            'name' => 'LY_STMT_DEVIATE',
                                                            'value' => '62'
                                                          },
                                                  '64' => {
                                                            'name' => 'LY_STMT_DEVIATION',
                                                            'value' => '63'
                                                          },
                                                  '65' => {
                                                            'name' => 'LY_STMT_EXTENSION',
                                                            'value' => '64'
                                                          },
                                                  '66' => {
                                                            'name' => 'LY_STMT_FEATURE',
                                                            'value' => '65'
                                                          },
                                                  '67' => {
                                                            'name' => 'LY_STMT_IDENTITY',
                                                            'value' => '66'
                                                          },
                                                  '68' => {
                                                            'name' => 'LY_STMT_IMPORT',
                                                            'value' => '67'
                                                          },
                                                  '69' => {
                                                            'name' => 'LY_STMT_INCLUDE',
                                                            'value' => '68'
                                                          },
                                                  '7' => {
                                                           'name' => 'LY_STMT_DESCRIPTION',
                                                           'value' => '6'
                                                         },
                                                  '8' => {
                                                           'name' => 'LY_STMT_ERRTAG',
                                                           'value' => '7'
                                                         },
                                                  '9' => {
                                                           'name' => 'LY_STMT_ERRMSG',
                                                           'value' => '8'
                                                         }
                                                },
                                      'Name' => 'enum LY_STMT',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2258' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '379',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'LY_STMT_CARD_OPT',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'LY_STMT_CARD_MAND',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'LY_STMT_CARD_SOME',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'LY_STMT_CARD_ANY',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum LY_STMT_CARD',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2303' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '394',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'LYEXT_ERR',
                                                           'value' => '-1'
                                                         },
                                                  '1' => {
                                                           'name' => 'LYEXT_FLAG',
                                                           'value' => '0'
                                                         },
                                                  '2' => {
                                                           'name' => 'LYEXT_COMPLEX',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum LYEXT_TYPE',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '231' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '2315' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '435',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'stmt',
                                                           'offset' => '0',
                                                           'type' => '2207'
                                                         },
                                                  '1' => {
                                                           'name' => 'offset',
                                                           'offset' => '8',
                                                           'type' => '399'
                                                         },
                                                  '2' => {
                                                           'name' => 'cardinality',
                                                           'offset' => '16',
                                                           'type' => '2258'
                                                         }
                                                },
                                      'Name' => 'struct lyext_substmt',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '2368' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '444',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1548'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'padding',
                                                           'offset' => '27',
                                                           'type' => '2512'
                                                         },
                                                  '6' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2724'
                                                         },
                                                  '7' => {
                                                           'name' => 'argument',
                                                           'offset' => '40',
                                                           'type' => '361'
                                                         },
                                                  '8' => {
                                                           'name' => 'module',
                                                           'offset' => '48',
                                                           'type' => '3269'
                                                         },
                                                  '9' => {
                                                           'name' => 'plugin',
                                                           'offset' => '56',
                                                           'type' => '3360'
                                                         }
                                                },
                                      'Name' => 'struct lys_ext',
                                      'PrivateABI' => 1,
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '238' => {
                                     'BaseType' => '249',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '249' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '2512' => {
                                      'BaseType' => '1532',
                                      'Name' => 'uint8_t[5]',
                                      'Size' => '5',
                                      'Type' => 'Array'
                                    },
                          '2528' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '464',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'def',
                                                           'offset' => '0',
                                                           'type' => '3366'
                                                         },
                                                  '1' => {
                                                           'name' => 'parent',
                                                           'offset' => '8',
                                                           'type' => '231'
                                                         },
                                                  '10' => {
                                                            'name' => 'ext',
                                                            'offset' => '32',
                                                            'type' => '2724'
                                                          },
                                                  '11' => {
                                                            'name' => 'priv',
                                                            'offset' => '40',
                                                            'type' => '231'
                                                          },
                                                  '12' => {
                                                            'name' => 'module',
                                                            'offset' => '48',
                                                            'type' => '3269'
                                                          },
                                                  '13' => {
                                                            'name' => 'nodetype',
                                                            'offset' => '56',
                                                            'type' => '1761'
                                                          },
                                                  '2' => {
                                                           'name' => 'arg_value',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1548'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'insubstmt_index',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'insubstmt',
                                                           'offset' => '28',
                                                           'type' => '1532'
                                                         },
                                                  '7' => {
                                                           'name' => 'parent_type',
                                                           'offset' => '29',
                                                           'type' => '1532'
                                                         },
                                                  '8' => {
                                                           'name' => 'ext_type',
                                                           'offset' => '30',
                                                           'type' => '1532'
                                                         },
                                                  '9' => {
                                                           'name' => 'padding',
                                                           'offset' => '31',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct lys_ext_instance',
                                      'PrivateABI' => 1,
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '256' => {
                                     'BaseType' => '249',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '2724' => {
                                      'BaseType' => '2730',
                                      'Name' => 'struct lys_ext_instance**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2730' => {
                                      'BaseType' => '2528',
                                      'Name' => 'struct lys_ext_instance*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2736' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '666',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ctx',
                                                           'offset' => '0',
                                                           'type' => '3714'
                                                         },
                                                  '1' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '2',
                                                            'name' => 'deviated',
                                                            'offset' => '64',
                                                            'type' => '1532'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'disabled',
                                                            'offset' => '64',
                                                            'type' => '1532'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'implemented',
                                                            'offset' => '64',
                                                            'type' => '1532'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'latest_revision',
                                                            'offset' => '65',
                                                            'type' => '1532'
                                                          },
                                                  '14' => {
                                                            'bitfield' => '7',
                                                            'name' => 'padding1',
                                                            'offset' => '65',
                                                            'type' => '1532'
                                                          },
                                                  '15' => {
                                                            'name' => 'padding2',
                                                            'offset' => '66',
                                                            'type' => '3720'
                                                          },
                                                  '16' => {
                                                            'name' => 'rev_size',
                                                            'offset' => '68',
                                                            'type' => '1532'
                                                          },
                                                  '17' => {
                                                            'name' => 'imp_size',
                                                            'offset' => '69',
                                                            'type' => '1532'
                                                          },
                                                  '18' => {
                                                            'name' => 'inc_size',
                                                            'offset' => '70',
                                                            'type' => '1532'
                                                          },
                                                  '19' => {
                                                            'name' => 'ident_size',
                                                            'offset' => '72',
                                                            'type' => '1548'
                                                          },
                                                  '2' => {
                                                           'name' => 'prefix',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '20' => {
                                                            'name' => 'tpdf_size',
                                                            'offset' => '74',
                                                            'type' => '1548'
                                                          },
                                                  '21' => {
                                                            'name' => 'features_size',
                                                            'offset' => '76',
                                                            'type' => '1532'
                                                          },
                                                  '22' => {
                                                            'name' => 'augment_size',
                                                            'offset' => '77',
                                                            'type' => '1532'
                                                          },
                                                  '23' => {
                                                            'name' => 'deviation_size',
                                                            'offset' => '78',
                                                            'type' => '1532'
                                                          },
                                                  '24' => {
                                                            'name' => 'extensions_size',
                                                            'offset' => '79',
                                                            'type' => '1532'
                                                          },
                                                  '25' => {
                                                            'name' => 'ext_size',
                                                            'offset' => '80',
                                                            'type' => '1532'
                                                          },
                                                  '26' => {
                                                            'name' => 'rev',
                                                            'offset' => '88',
                                                            'type' => '3815'
                                                          },
                                                  '27' => {
                                                            'name' => 'imp',
                                                            'offset' => '96',
                                                            'type' => '3926'
                                                          },
                                                  '28' => {
                                                            'name' => 'inc',
                                                            'offset' => '104',
                                                            'type' => '4024'
                                                          },
                                                  '29' => {
                                                            'name' => 'tpdf',
                                                            'offset' => '112',
                                                            'type' => '4213'
                                                          },
                                                  '3' => {
                                                           'name' => 'dsc',
                                                           'offset' => '24',
                                                           'type' => '361'
                                                         },
                                                  '30' => {
                                                            'name' => 'ident',
                                                            'offset' => '120',
                                                            'type' => '4402'
                                                          },
                                                  '31' => {
                                                            'name' => 'features',
                                                            'offset' => '128',
                                                            'type' => '4565'
                                                          },
                                                  '32' => {
                                                            'name' => 'augment',
                                                            'offset' => '136',
                                                            'type' => '4793'
                                                          },
                                                  '33' => {
                                                            'name' => 'deviation',
                                                            'offset' => '144',
                                                            'type' => '4917'
                                                          },
                                                  '34' => {
                                                            'name' => 'extensions',
                                                            'offset' => '152',
                                                            'type' => '3366'
                                                          },
                                                  '35' => {
                                                            'name' => 'ext',
                                                            'offset' => '160',
                                                            'type' => '2724'
                                                          },
                                                  '36' => {
                                                            'name' => 'data',
                                                            'offset' => '168',
                                                            'type' => '5163'
                                                          },
                                                  '37' => {
                                                            'name' => 'ns',
                                                            'offset' => '176',
                                                            'type' => '361'
                                                          },
                                                  '4' => {
                                                           'name' => 'ref',
                                                           'offset' => '32',
                                                           'type' => '361'
                                                         },
                                                  '5' => {
                                                           'name' => 'org',
                                                           'offset' => '40',
                                                           'type' => '361'
                                                         },
                                                  '6' => {
                                                           'name' => 'contact',
                                                           'offset' => '48',
                                                           'type' => '361'
                                                         },
                                                  '7' => {
                                                           'name' => 'filepath',
                                                           'offset' => '56',
                                                           'type' => '361'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'type',
                                                           'offset' => '64',
                                                           'type' => '1532'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '3',
                                                           'name' => 'version',
                                                           'offset' => '64',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct lys_module',
                                      'PrivateABI' => 1,
                                      'Size' => '184',
                                      'Type' => 'Struct'
                                    },
                          '29469' => {
                                       'BaseType' => '9502',
                                       'Name' => 'LY_ERR*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3264' => {
                                      'BaseType' => '2736',
                                      'Name' => 'struct lys_module const',
                                      'Size' => '184',
                                      'Type' => 'Const'
                                    },
                          '3269' => {
                                      'BaseType' => '2736',
                                      'Name' => 'struct lys_module*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3275' => {
                                      'Header' => 'extensions.h',
                                      'Line' => '178',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '2303'
                                                         },
                                                  '1' => {
                                                           'name' => 'flags',
                                                           'offset' => '4',
                                                           'type' => '1548'
                                                         },
                                                  '2' => {
                                                           'name' => 'check_position',
                                                           'offset' => '8',
                                                           'type' => '10584'
                                                         },
                                                  '3' => {
                                                           'name' => 'check_result',
                                                           'offset' => '16',
                                                           'type' => '10626'
                                                         },
                                                  '4' => {
                                                           'name' => 'check_inherit',
                                                           'offset' => '24',
                                                           'type' => '10658'
                                                         },
                                                  '5' => {
                                                           'name' => 'valid_data',
                                                           'offset' => '32',
                                                           'type' => '10695'
                                                         }
                                                },
                                      'Name' => 'struct lyext_plugin',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '3360' => {
                                      'BaseType' => '3275',
                                      'Name' => 'struct lyext_plugin*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3366' => {
                                      'BaseType' => '2368',
                                      'Name' => 'struct lys_ext*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3372' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '498',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'def',
                                                           'offset' => '0',
                                                           'type' => '3366'
                                                         },
                                                  '1' => {
                                                           'name' => 'parent',
                                                           'offset' => '8',
                                                           'type' => '231'
                                                         },
                                                  '10' => {
                                                            'name' => 'ext',
                                                            'offset' => '32',
                                                            'type' => '2724'
                                                          },
                                                  '11' => {
                                                            'name' => 'priv',
                                                            'offset' => '40',
                                                            'type' => '231'
                                                          },
                                                  '12' => {
                                                            'name' => 'module',
                                                            'offset' => '48',
                                                            'type' => '3269'
                                                          },
                                                  '13' => {
                                                            'name' => 'nodetype',
                                                            'offset' => '56',
                                                            'type' => '1761'
                                                          },
                                                  '14' => {
                                                            'name' => 'substmt',
                                                            'offset' => '64',
                                                            'type' => '3594'
                                                          },
                                                  '15' => {
                                                            'name' => 'content',
                                                            'offset' => '72',
                                                            'type' => '1230'
                                                          },
                                                  '2' => {
                                                           'name' => 'arg_value',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1548'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'insubstmt_index',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'insubstmt',
                                                           'offset' => '28',
                                                           'type' => '1532'
                                                         },
                                                  '7' => {
                                                           'name' => 'parent_type',
                                                           'offset' => '29',
                                                           'type' => '1532'
                                                         },
                                                  '8' => {
                                                           'name' => 'ext_type',
                                                           'offset' => '30',
                                                           'type' => '1532'
                                                         },
                                                  '9' => {
                                                           'name' => 'padding',
                                                           'offset' => '31',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct lys_ext_instance_complex',
                                      'PrivateABI' => 1,
                                      'Size' => '80',
                                      'Type' => 'Struct'
                                    },
                          '35671' => {
                                       'BaseType' => '5169',
                                       'Name' => 'struct lys_submodule const',
                                       'Size' => '176',
                                       'Type' => 'Const'
                                     },
                          '3594' => {
                                      'BaseType' => '2315',
                                      'Name' => 'struct lyext_substmt*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3600' => {
                                      'Header' => 'context.h',
                                      'Line' => '40',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'dict',
                                                           'offset' => '0',
                                                           'type' => '10185'
                                                         },
                                                  '1' => {
                                                           'name' => 'models',
                                                           'offset' => '48',
                                                           'type' => '12757'
                                                         },
                                                  '2' => {
                                                           'name' => 'imp_clb',
                                                           'offset' => '96',
                                                           'type' => '9188'
                                                         },
                                                  '3' => {
                                                           'name' => 'imp_clb_data',
                                                           'offset' => '104',
                                                           'type' => '231'
                                                         },
                                                  '4' => {
                                                           'name' => 'data_clb',
                                                           'offset' => '112',
                                                           'type' => '9285'
                                                         },
                                                  '5' => {
                                                           'name' => 'data_clb_data',
                                                           'offset' => '120',
                                                           'type' => '231'
                                                         },
                                                  '6' => {
                                                           'name' => 'errlist_key',
                                                           'offset' => '128',
                                                           'type' => '674'
                                                         },
                                                  '7' => {
                                                           'name' => 'internal_module_count',
                                                           'offset' => '132',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct ly_ctx',
                                      'PrivateABI' => 1,
                                      'Size' => '136',
                                      'Type' => 'Struct'
                                    },
                          '361' => {
                                     'BaseType' => '256',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '367' => {
                                     'BaseType' => '361',
                                     'Name' => 'char const*const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '3709' => {
                                      'BaseType' => '3600',
                                      'Name' => 'struct ly_ctx const',
                                      'Size' => '136',
                                      'Type' => 'Const'
                                    },
                          '3714' => {
                                      'BaseType' => '3600',
                                      'Name' => 'struct ly_ctx*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3720' => {
                                      'BaseType' => '1532',
                                      'Name' => 'uint8_t[2]',
                                      'Size' => '2',
                                      'Type' => 'Array'
                                    },
                          '3736' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '1984',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'date',
                                                           'offset' => '0',
                                                           'type' => '8211'
                                                         },
                                                  '1' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '11',
                                                           'type' => '1532'
                                                         },
                                                  '2' => {
                                                           'name' => 'ext',
                                                           'offset' => '16',
                                                           'type' => '2724'
                                                         },
                                                  '3' => {
                                                           'name' => 'dsc',
                                                           'offset' => '24',
                                                           'type' => '361'
                                                         },
                                                  '4' => {
                                                           'name' => 'ref',
                                                           'offset' => '32',
                                                           'type' => '361'
                                                         }
                                                },
                                      'Name' => 'struct lys_revision',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '37910' => {
                                       'Header' => 'tree_data.h',
                                       'Line' => '45',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'LYD_UNKNOWN',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'LYD_XML',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'LYD_JSON',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'LYD_LYB',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum LYD_FORMAT',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '3815' => {
                                      'BaseType' => '3736',
                                      'Name' => 'struct lys_revision*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3821' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '1959',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'module',
                                                           'offset' => '0',
                                                           'type' => '3269'
                                                         },
                                                  '1' => {
                                                           'name' => 'prefix',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '2' => {
                                                           'name' => 'rev',
                                                           'offset' => '16',
                                                           'type' => '8211'
                                                         },
                                                  '3' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2724'
                                                         },
                                                  '5' => {
                                                           'name' => 'dsc',
                                                           'offset' => '40',
                                                           'type' => '361'
                                                         },
                                                  '6' => {
                                                           'name' => 'ref',
                                                           'offset' => '48',
                                                           'type' => '361'
                                                         }
                                                },
                                      'Name' => 'struct lys_import',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '3926' => {
                                      'BaseType' => '3821',
                                      'Name' => 'struct lys_import*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3932' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '1972',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'submodule',
                                                           'offset' => '0',
                                                           'type' => '8227'
                                                         },
                                                  '1' => {
                                                           'name' => 'rev',
                                                           'offset' => '8',
                                                           'type' => '8211'
                                                         },
                                                  '2' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '19',
                                                           'type' => '1532'
                                                         },
                                                  '3' => {
                                                           'name' => 'ext',
                                                           'offset' => '24',
                                                           'type' => '2724'
                                                         },
                                                  '4' => {
                                                           'name' => 'dsc',
                                                           'offset' => '32',
                                                           'type' => '361'
                                                         },
                                                  '5' => {
                                                           'name' => 'ref',
                                                           'offset' => '40',
                                                           'type' => '361'
                                                         }
                                                },
                                      'Name' => 'struct lys_include',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '399' => {
                                     'BaseType' => '81',
                                     'Header' => 'stddef.h',
                                     'Line' => '216',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '4024' => {
                                      'BaseType' => '3932',
                                      'Name' => 'struct lys_include*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4030' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '1995',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '10' => {
                                                            'name' => 'module',
                                                            'offset' => '48',
                                                            'type' => '3269'
                                                          },
                                                  '11' => {
                                                            'name' => 'type',
                                                            'offset' => '56',
                                                            'type' => '7049'
                                                          },
                                                  '12' => {
                                                            'name' => 'dflt',
                                                            'offset' => '120',
                                                            'type' => '361'
                                                          },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1548'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'padding_iffsize',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'has_union_leafref',
                                                           'offset' => '28',
                                                           'type' => '1532'
                                                         },
                                                  '7' => {
                                                           'name' => 'padding',
                                                           'offset' => '29',
                                                           'type' => '5653'
                                                         },
                                                  '8' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2724'
                                                         },
                                                  '9' => {
                                                           'name' => 'units',
                                                           'offset' => '40',
                                                           'type' => '361'
                                                         }
                                                },
                                      'Name' => 'struct lys_tpdf',
                                      'PrivateABI' => 1,
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '4213' => {
                                      'BaseType' => '4030',
                                      'Name' => 'struct lys_tpdf*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4219' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '2080',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '10' => {
                                                            'name' => 'module',
                                                            'offset' => '48',
                                                            'type' => '3269'
                                                          },
                                                  '11' => {
                                                            'name' => 'base',
                                                            'offset' => '56',
                                                            'type' => '6492'
                                                          },
                                                  '12' => {
                                                            'name' => 'der',
                                                            'offset' => '64',
                                                            'type' => '7473'
                                                          },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1548'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'padding',
                                                           'offset' => '28',
                                                           'type' => '5653'
                                                         },
                                                  '7' => {
                                                           'name' => 'base_size',
                                                           'offset' => '31',
                                                           'type' => '1532'
                                                         },
                                                  '8' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2724'
                                                         },
                                                  '9' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6170'
                                                         }
                                                },
                                      'Name' => 'struct lys_ident',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '4402' => {
                                      'BaseType' => '4219',
                                      'Name' => 'struct lys_ident*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4408' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '2029',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '10' => {
                                                            'name' => 'depfeatures',
                                                            'offset' => '56',
                                                            'type' => '7473'
                                                          },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1548'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'padding',
                                                           'offset' => '28',
                                                           'type' => '7306'
                                                         },
                                                  '7' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2724'
                                                         },
                                                  '8' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6170'
                                                         },
                                                  '9' => {
                                                           'name' => 'module',
                                                           'offset' => '48',
                                                           'type' => '3269'
                                                         }
                                                },
                                      'Name' => 'struct lys_feature',
                                      'PrivateABI' => 1,
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '45' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '4565' => {
                                      'BaseType' => '4408',
                                      'Name' => 'struct lys_feature*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4571' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '1823',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'target_name',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '10' => {
                                                            'name' => 'nodetype',
                                                            'offset' => '56',
                                                            'type' => '1761'
                                                          },
                                                  '11' => {
                                                            'name' => 'parent',
                                                            'offset' => '64',
                                                            'type' => '5163'
                                                          },
                                                  '12' => {
                                                            'name' => 'child',
                                                            'offset' => '72',
                                                            'type' => '5163'
                                                          },
                                                  '13' => {
                                                            'name' => 'when',
                                                            'offset' => '80',
                                                            'type' => '7414'
                                                          },
                                                  '14' => {
                                                            'name' => 'target',
                                                            'offset' => '88',
                                                            'type' => '5163'
                                                          },
                                                  '15' => {
                                                            'name' => 'priv',
                                                            'offset' => '96',
                                                            'type' => '231'
                                                          },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1548'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'padding',
                                                           'offset' => '28',
                                                           'type' => '7306'
                                                         },
                                                  '7' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2724'
                                                         },
                                                  '8' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6170'
                                                         },
                                                  '9' => {
                                                           'name' => 'module',
                                                           'offset' => '48',
                                                           'type' => '3269'
                                                         }
                                                },
                                      'Name' => 'struct lys_node_augment',
                                      'PrivateABI' => 1,
                                      'Size' => '104',
                                      'Type' => 'Struct'
                                    },
                          '46017' => {
                                       'Name' => 'void(*)(struct lys_node const*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '13900'
                                                           },
                                                    '1' => {
                                                             'type' => '231'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '4793' => {
                                      'BaseType' => '4571',
                                      'Name' => 'struct lys_node_augment*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4799' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '1943',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'target_name',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'orig_node',
                                                           'offset' => '24',
                                                           'type' => '5163'
                                                         },
                                                  '4' => {
                                                           'name' => 'deviate_size',
                                                           'offset' => '32',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '33',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'deviate',
                                                           'offset' => '40',
                                                           'type' => '8205'
                                                         },
                                                  '7' => {
                                                           'name' => 'ext',
                                                           'offset' => '48',
                                                           'type' => '2724'
                                                         }
                                                },
                                      'Name' => 'struct lys_deviation',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '4917' => {
                                      'BaseType' => '4799',
                                      'Name' => 'struct lys_deviation*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4923' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '1209',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '10' => {
                                                            'name' => 'nodetype',
                                                            'offset' => '56',
                                                            'type' => '1761'
                                                          },
                                                  '11' => {
                                                            'name' => 'parent',
                                                            'offset' => '64',
                                                            'type' => '5163'
                                                          },
                                                  '12' => {
                                                            'name' => 'child',
                                                            'offset' => '72',
                                                            'type' => '5163'
                                                          },
                                                  '13' => {
                                                            'name' => 'next',
                                                            'offset' => '80',
                                                            'type' => '5163'
                                                          },
                                                  '14' => {
                                                            'name' => 'prev',
                                                            'offset' => '88',
                                                            'type' => '5163'
                                                          },
                                                  '15' => {
                                                            'name' => 'priv',
                                                            'offset' => '96',
                                                            'type' => '231'
                                                          },
                                                  '16' => {
                                                            'name' => 'hash',
                                                            'offset' => '104',
                                                            'type' => '7306'
                                                          },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1548'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'padding',
                                                           'offset' => '28',
                                                           'type' => '7306'
                                                         },
                                                  '7' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2724'
                                                         },
                                                  '8' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6170'
                                                         },
                                                  '9' => {
                                                           'name' => 'module',
                                                           'offset' => '48',
                                                           'type' => '3269'
                                                         }
                                                },
                                      'Name' => 'struct lys_node',
                                      'PrivateABI' => 1,
                                      'Size' => '112',
                                      'Type' => 'Struct'
                                    },
                          '504' => {
                                     'Header' => 'thread-shared-types.h',
                                     'Line' => '82',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '__prev',
                                                          'offset' => '0',
                                                          'type' => '541'
                                                        },
                                                 '1' => {
                                                          'name' => '__next',
                                                          'offset' => '8',
                                                          'type' => '541'
                                                        }
                                               },
                                     'Name' => 'struct __pthread_internal_list',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '5158' => {
                                      'BaseType' => '4923',
                                      'Name' => 'struct lys_node const',
                                      'Size' => '112',
                                      'Type' => 'Const'
                                    },
                          '5163' => {
                                      'BaseType' => '4923',
                                      'Name' => 'struct lys_node*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5169' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '729',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ctx',
                                                           'offset' => '0',
                                                           'type' => '3714'
                                                         },
                                                  '1' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '2',
                                                            'name' => 'deviated',
                                                            'offset' => '64',
                                                            'type' => '1532'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'disabled',
                                                            'offset' => '64',
                                                            'type' => '1532'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'implemented',
                                                            'offset' => '64',
                                                            'type' => '1532'
                                                          },
                                                  '13' => {
                                                            'name' => 'padding',
                                                            'offset' => '65',
                                                            'type' => '5653'
                                                          },
                                                  '14' => {
                                                            'name' => 'rev_size',
                                                            'offset' => '68',
                                                            'type' => '1532'
                                                          },
                                                  '15' => {
                                                            'name' => 'imp_size',
                                                            'offset' => '69',
                                                            'type' => '1532'
                                                          },
                                                  '16' => {
                                                            'name' => 'inc_size',
                                                            'offset' => '70',
                                                            'type' => '1532'
                                                          },
                                                  '17' => {
                                                            'name' => 'ident_size',
                                                            'offset' => '72',
                                                            'type' => '1548'
                                                          },
                                                  '18' => {
                                                            'name' => 'tpdf_size',
                                                            'offset' => '74',
                                                            'type' => '1548'
                                                          },
                                                  '19' => {
                                                            'name' => 'features_size',
                                                            'offset' => '76',
                                                            'type' => '1532'
                                                          },
                                                  '2' => {
                                                           'name' => 'prefix',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '20' => {
                                                            'name' => 'augment_size',
                                                            'offset' => '77',
                                                            'type' => '1532'
                                                          },
                                                  '21' => {
                                                            'name' => 'deviation_size',
                                                            'offset' => '78',
                                                            'type' => '1532'
                                                          },
                                                  '22' => {
                                                            'name' => 'extensions_size',
                                                            'offset' => '79',
                                                            'type' => '1532'
                                                          },
                                                  '23' => {
                                                            'name' => 'ext_size',
                                                            'offset' => '80',
                                                            'type' => '1532'
                                                          },
                                                  '24' => {
                                                            'name' => 'rev',
                                                            'offset' => '88',
                                                            'type' => '3815'
                                                          },
                                                  '25' => {
                                                            'name' => 'imp',
                                                            'offset' => '96',
                                                            'type' => '3926'
                                                          },
                                                  '26' => {
                                                            'name' => 'inc',
                                                            'offset' => '104',
                                                            'type' => '4024'
                                                          },
                                                  '27' => {
                                                            'name' => 'tpdf',
                                                            'offset' => '112',
                                                            'type' => '4213'
                                                          },
                                                  '28' => {
                                                            'name' => 'ident',
                                                            'offset' => '120',
                                                            'type' => '4402'
                                                          },
                                                  '29' => {
                                                            'name' => 'features',
                                                            'offset' => '128',
                                                            'type' => '4565'
                                                          },
                                                  '3' => {
                                                           'name' => 'dsc',
                                                           'offset' => '24',
                                                           'type' => '361'
                                                         },
                                                  '30' => {
                                                            'name' => 'augment',
                                                            'offset' => '136',
                                                            'type' => '4793'
                                                          },
                                                  '31' => {
                                                            'name' => 'deviation',
                                                            'offset' => '144',
                                                            'type' => '4917'
                                                          },
                                                  '32' => {
                                                            'name' => 'extensions',
                                                            'offset' => '152',
                                                            'type' => '3366'
                                                          },
                                                  '33' => {
                                                            'name' => 'ext',
                                                            'offset' => '160',
                                                            'type' => '2724'
                                                          },
                                                  '34' => {
                                                            'name' => 'belongsto',
                                                            'offset' => '168',
                                                            'type' => '3269'
                                                          },
                                                  '4' => {
                                                           'name' => 'ref',
                                                           'offset' => '32',
                                                           'type' => '361'
                                                         },
                                                  '5' => {
                                                           'name' => 'org',
                                                           'offset' => '40',
                                                           'type' => '361'
                                                         },
                                                  '6' => {
                                                           'name' => 'contact',
                                                           'offset' => '48',
                                                           'type' => '361'
                                                         },
                                                  '7' => {
                                                           'name' => 'filepath',
                                                           'offset' => '56',
                                                           'type' => '361'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'type',
                                                           'offset' => '64',
                                                           'type' => '1532'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '3',
                                                           'name' => 'version',
                                                           'offset' => '64',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct lys_submodule',
                                      'PrivateABI' => 1,
                                      'Size' => '176',
                                      'Type' => 'Struct'
                                    },
                          '53655' => {
                                       'BaseType' => '35671',
                                       'Name' => 'struct lys_submodule const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '541' => {
                                     'BaseType' => '504',
                                     'Name' => 'struct __pthread_internal_list*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '54626' => {
                                       'BaseType' => '367',
                                       'Name' => 'char const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '547' => {
                                     'BaseType' => '504',
                                     'Header' => 'thread-shared-types.h',
                                     'Line' => '86',
                                     'Name' => '__pthread_list_t',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '558' => {
                                     'Header' => 'thread-shared-types.h',
                                     'Line' => '118',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '__lock',
                                                          'offset' => '0',
                                                          'type' => '157'
                                                        },
                                                 '1' => {
                                                          'name' => '__count',
                                                          'offset' => '4',
                                                          'type' => '69'
                                                        },
                                                 '2' => {
                                                          'name' => '__owner',
                                                          'offset' => '8',
                                                          'type' => '157'
                                                        },
                                                 '3' => {
                                                          'name' => '__nusers',
                                                          'offset' => '12',
                                                          'type' => '69'
                                                        },
                                                 '4' => {
                                                          'name' => '__kind',
                                                          'offset' => '16',
                                                          'type' => '157'
                                                        },
                                                 '5' => {
                                                          'name' => '__spins',
                                                          'offset' => '20',
                                                          'type' => '128'
                                                        },
                                                 '6' => {
                                                          'name' => '__elision',
                                                          'offset' => '22',
                                                          'type' => '128'
                                                        },
                                                 '7' => {
                                                          'name' => '__list',
                                                          'offset' => '24',
                                                          'type' => '547'
                                                        }
                                               },
                                     'Name' => 'struct __pthread_mutex_s',
                                     'PrivateABI' => 1,
                                     'Size' => '40',
                                     'Type' => 'Struct'
                                   },
                          '5653' => {
                                      'BaseType' => '1532',
                                      'Name' => 'uint8_t[3]',
                                      'Size' => '3',
                                      'Type' => 'Array'
                                    },
                          '57' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '5810' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '806',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'LY_TYPE_DER',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'LY_TYPE_BINARY',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'LY_TYPE_STRING',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'LY_TYPE_UNION',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'LY_TYPE_INT8',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'LY_TYPE_UINT8',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'LY_TYPE_INT16',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'LY_TYPE_UINT16',
                                                            'value' => '15'
                                                          },
                                                  '16' => {
                                                            'name' => 'LY_TYPE_INT32',
                                                            'value' => '16'
                                                          },
                                                  '17' => {
                                                            'name' => 'LY_TYPE_UINT32',
                                                            'value' => '17'
                                                          },
                                                  '18' => {
                                                            'name' => 'LY_TYPE_INT64',
                                                            'value' => '18'
                                                          },
                                                  '19' => {
                                                            'name' => 'LY_TYPE_UINT64',
                                                            'value' => '19'
                                                          },
                                                  '2' => {
                                                           'name' => 'LY_TYPE_BITS',
                                                           'value' => '2'
                                                         },
                                                  '20' => {
                                                            'name' => 'LY_TYPE_UNKNOWN',
                                                            'value' => '20'
                                                          },
                                                  '3' => {
                                                           'name' => 'LY_TYPE_BOOL',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'LY_TYPE_DEC64',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'LY_TYPE_EMPTY',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'LY_TYPE_ENUM',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'LY_TYPE_IDENT',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'LY_TYPE_INST',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'LY_TYPE_LEAFREF',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum LY_DATA_TYPE',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '5822' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '812',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'length',
                                                           'offset' => '0',
                                                           'type' => '5967'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_binary',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '5849' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '2050',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'expr',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'eapptag',
                                                           'offset' => '24',
                                                           'type' => '361'
                                                         },
                                                  '4' => {
                                                           'name' => 'emsg',
                                                           'offset' => '32',
                                                           'type' => '361'
                                                         },
                                                  '5' => {
                                                           'name' => 'ext',
                                                           'offset' => '40',
                                                           'type' => '2724'
                                                         },
                                                  '6' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '48',
                                                           'type' => '1532'
                                                         },
                                                  '7' => {
                                                           'name' => 'flags',
                                                           'offset' => '50',
                                                           'type' => '1548'
                                                         }
                                                },
                                      'Name' => 'struct lys_restr',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '5967' => {
                                      'BaseType' => '5849',
                                      'Name' => 'struct lys_restr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5973' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '820',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1548'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'pos',
                                                           'offset' => '28',
                                                           'type' => '1559'
                                                         },
                                                  '7' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2724'
                                                         },
                                                  '8' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6170'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_bit',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '6104' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '1070',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'expr',
                                                           'offset' => '0',
                                                           'type' => '7294'
                                                         },
                                                  '1' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '8',
                                                           'type' => '1532'
                                                         },
                                                  '2' => {
                                                           'name' => 'features',
                                                           'offset' => '16',
                                                           'type' => '7300'
                                                         },
                                                  '3' => {
                                                           'name' => 'ext',
                                                           'offset' => '24',
                                                           'type' => '2724'
                                                         }
                                                },
                                      'Name' => 'struct lys_iffeature',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '6170' => {
                                      'BaseType' => '6104',
                                      'Name' => 'struct lys_iffeature*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6176' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '839',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bit',
                                                           'offset' => '0',
                                                           'type' => '6216'
                                                         },
                                                  '1' => {
                                                           'name' => 'count',
                                                           'offset' => '8',
                                                           'type' => '69'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_bits',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6216' => {
                                      'BaseType' => '5973',
                                      'Name' => 'struct lys_type_bit*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6222' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '847',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'range',
                                                           'offset' => '0',
                                                           'type' => '5967'
                                                         },
                                                  '1' => {
                                                           'name' => 'dig',
                                                           'offset' => '8',
                                                           'type' => '1532'
                                                         },
                                                  '2' => {
                                                           'name' => 'div',
                                                           'offset' => '16',
                                                           'type' => '1570'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_dec64',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '6275' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '860',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1548'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'value',
                                                           'offset' => '28',
                                                           'type' => '1424'
                                                         },
                                                  '7' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2724'
                                                         },
                                                  '8' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6170'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_enum',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '6406' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '879',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'enm',
                                                           'offset' => '0',
                                                           'type' => '6446'
                                                         },
                                                  '1' => {
                                                           'name' => 'count',
                                                           'offset' => '8',
                                                           'type' => '69'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_enums',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6446' => {
                                      'BaseType' => '6275',
                                      'Name' => 'struct lys_type_enum*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6452' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '887',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ref',
                                                           'offset' => '0',
                                                           'type' => '6492'
                                                         },
                                                  '1' => {
                                                           'name' => 'count',
                                                           'offset' => '8',
                                                           'type' => '69'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_ident',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6492' => {
                                      'BaseType' => '4402',
                                      'Name' => 'struct lys_ident**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6498' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '895',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'req',
                                                           'offset' => '0',
                                                           'type' => '1402'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_inst',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '6525' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '906',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'range',
                                                           'offset' => '0',
                                                           'type' => '5967'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_num',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '6552' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '914',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'path',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'target',
                                                           'offset' => '8',
                                                           'type' => '6918'
                                                         },
                                                  '2' => {
                                                           'name' => 'req',
                                                           'offset' => '16',
                                                           'type' => '1402'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_lref',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '6605' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '1345',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '10' => {
                                                            'name' => 'module',
                                                            'offset' => '48',
                                                            'type' => '3269'
                                                          },
                                                  '11' => {
                                                            'name' => 'nodetype',
                                                            'offset' => '56',
                                                            'type' => '1761'
                                                          },
                                                  '12' => {
                                                            'name' => 'parent',
                                                            'offset' => '64',
                                                            'type' => '5163'
                                                          },
                                                  '13' => {
                                                            'name' => 'child',
                                                            'offset' => '72',
                                                            'type' => '231'
                                                          },
                                                  '14' => {
                                                            'name' => 'next',
                                                            'offset' => '80',
                                                            'type' => '5163'
                                                          },
                                                  '15' => {
                                                            'name' => 'prev',
                                                            'offset' => '88',
                                                            'type' => '5163'
                                                          },
                                                  '16' => {
                                                            'name' => 'priv',
                                                            'offset' => '96',
                                                            'type' => '231'
                                                          },
                                                  '17' => {
                                                            'name' => 'hash',
                                                            'offset' => '104',
                                                            'type' => '7306'
                                                          },
                                                  '18' => {
                                                            'name' => 'when',
                                                            'offset' => '112',
                                                            'type' => '7414'
                                                          },
                                                  '19' => {
                                                            'name' => 'must',
                                                            'offset' => '120',
                                                            'type' => '5967'
                                                          },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '20' => {
                                                            'name' => 'type',
                                                            'offset' => '128',
                                                            'type' => '7049'
                                                          },
                                                  '21' => {
                                                            'name' => 'units',
                                                            'offset' => '192',
                                                            'type' => '361'
                                                          },
                                                  '22' => {
                                                            'name' => 'dflt',
                                                            'offset' => '200',
                                                            'type' => '361'
                                                          },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1548'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'padding',
                                                           'offset' => '28',
                                                           'type' => '5653'
                                                         },
                                                  '7' => {
                                                           'name' => 'must_size',
                                                           'offset' => '31',
                                                           'type' => '1532'
                                                         },
                                                  '8' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2724'
                                                         },
                                                  '9' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6170'
                                                         }
                                                },
                                      'Name' => 'struct lys_node_leaf',
                                      'PrivateABI' => 1,
                                      'Size' => '208',
                                      'Type' => 'Struct'
                                    },
                          '674' => {
                                     'BaseType' => '69',
                                     'Header' => 'pthreadtypes.h',
                                     'Line' => '49',
                                     'Name' => 'pthread_key_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '69' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '6918' => {
                                      'BaseType' => '6605',
                                      'Name' => 'struct lys_node_leaf*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6924' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '927',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'length',
                                                           'offset' => '0',
                                                           'type' => '5967'
                                                         },
                                                  '1' => {
                                                           'name' => 'patterns',
                                                           'offset' => '8',
                                                           'type' => '5967'
                                                         },
                                                  '2' => {
                                                           'name' => 'pat_count',
                                                           'offset' => '16',
                                                           'type' => '69'
                                                         },
                                                  '3' => {
                                                           'name' => 'patterns_pcre',
                                                           'offset' => '24',
                                                           'type' => '6990'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_str',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '694211' => {
                                        'BaseType' => '7420',
                                        'Name' => 'struct ly_set const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '6990' => {
                                      'BaseType' => '231',
                                      'Name' => 'void**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6996' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '947',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'types',
                                                           'offset' => '0',
                                                           'type' => '7154'
                                                         },
                                                  '1' => {
                                                           'name' => 'count',
                                                           'offset' => '8',
                                                           'type' => '69'
                                                         },
                                                  '2' => {
                                                           'name' => 'has_ptr_type',
                                                           'offset' => '12',
                                                           'type' => '157'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_union',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7049' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '973',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'base',
                                                           'offset' => '0',
                                                           'type' => '5810'
                                                         },
                                                  '1' => {
                                                           'name' => 'value_flags',
                                                           'offset' => '4',
                                                           'type' => '1532'
                                                         },
                                                  '2' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '5',
                                                           'type' => '1532'
                                                         },
                                                  '3' => {
                                                           'name' => 'ext',
                                                           'offset' => '8',
                                                           'type' => '2724'
                                                         },
                                                  '4' => {
                                                           'name' => 'der',
                                                           'offset' => '16',
                                                           'type' => '4213'
                                                         },
                                                  '5' => {
                                                           'name' => 'parent',
                                                           'offset' => '24',
                                                           'type' => '4213'
                                                         },
                                                  '6' => {
                                                           'name' => 'info',
                                                           'offset' => '32',
                                                           'type' => '7160'
                                                         }
                                                },
                                      'Name' => 'struct lys_type',
                                      'PrivateABI' => 1,
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '709540' => {
                                        'BaseType' => '694211',
                                        'Name' => 'struct ly_set const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '7154' => {
                                      'BaseType' => '7049',
                                      'Name' => 'struct lys_type*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7160' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '957',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'binary',
                                                           'offset' => '0',
                                                           'type' => '5822'
                                                         },
                                                  '1' => {
                                                           'name' => 'bits',
                                                           'offset' => '0',
                                                           'type' => '6176'
                                                         },
                                                  '2' => {
                                                           'name' => 'dec64',
                                                           'offset' => '0',
                                                           'type' => '6222'
                                                         },
                                                  '3' => {
                                                           'name' => 'enums',
                                                           'offset' => '0',
                                                           'type' => '6406'
                                                         },
                                                  '4' => {
                                                           'name' => 'ident',
                                                           'offset' => '0',
                                                           'type' => '6452'
                                                         },
                                                  '5' => {
                                                           'name' => 'inst',
                                                           'offset' => '0',
                                                           'type' => '6498'
                                                         },
                                                  '6' => {
                                                           'name' => 'num',
                                                           'offset' => '0',
                                                           'type' => '6525'
                                                         },
                                                  '7' => {
                                                           'name' => 'lref',
                                                           'offset' => '0',
                                                           'type' => '6552'
                                                         },
                                                  '8' => {
                                                           'name' => 'str',
                                                           'offset' => '0',
                                                           'type' => '6924'
                                                         },
                                                  '9' => {
                                                           'name' => 'uni',
                                                           'offset' => '0',
                                                           'type' => '6996'
                                                         }
                                                },
                                      'Name' => 'union lys_type_info',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Union'
                                    },
                          '727' => {
                                     'BaseType' => '249',
                                     'Name' => 'char[40]',
                                     'Size' => '40',
                                     'Type' => 'Array'
                                   },
                          '7294' => {
                                      'BaseType' => '1532',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7300' => {
                                      'BaseType' => '4565',
                                      'Name' => 'struct lys_feature**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7306' => {
                                      'BaseType' => '1532',
                                      'Name' => 'uint8_t[4]',
                                      'Size' => '4',
                                      'Type' => 'Array'
                                    },
                          '7322' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '2066',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cond',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '361'
                                                         },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '361'
                                                         },
                                                  '3' => {
                                                           'name' => 'ext',
                                                           'offset' => '24',
                                                           'type' => '2724'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '32',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'flags',
                                                           'offset' => '34',
                                                           'type' => '1548'
                                                         }
                                                },
                                      'Name' => 'struct lys_when',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '73467' => {
                                       'Name' => 'void(*)(LY_LOG_LEVEL, char const*, char const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9433'
                                                           },
                                                    '1' => {
                                                             'type' => '361'
                                                           },
                                                    '2' => {
                                                             'type' => '361'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '7414' => {
                                      'BaseType' => '7322',
                                      'Name' => 'struct lys_when*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7420' => {
                                      'Header' => 'libyang.h',
                                      'Line' => '1708',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'size',
                                                           'offset' => '0',
                                                           'type' => '69'
                                                         },
                                                  '1' => {
                                                           'name' => 'number',
                                                           'offset' => '4',
                                                           'type' => '69'
                                                         },
                                                  '2' => {
                                                           'name' => 'set',
                                                           'offset' => '8',
                                                           'type' => '9344'
                                                         }
                                                },
                                      'Name' => 'struct ly_set',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '743' => {
                                     'Header' => 'pthreadtypes.h',
                                     'Line' => '72',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '__data',
                                                          'offset' => '0',
                                                          'type' => '558'
                                                        },
                                                 '1' => {
                                                          'name' => '__size',
                                                          'offset' => '0',
                                                          'type' => '727'
                                                        },
                                                 '2' => {
                                                          'name' => '__align',
                                                          'offset' => '0',
                                                          'type' => '191'
                                                        }
                                               },
                                     'Name' => 'union pthread_mutex_t',
                                     'PrivateABI' => 1,
                                     'Size' => '40',
                                     'Type' => 'Union'
                                   },
                          '7473' => {
                                      'BaseType' => '7420',
                                      'Name' => 'struct ly_set*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7479' => {
                                      'BaseType' => '361',
                                      'Name' => 'char const**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7869' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '2020',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'expr',
                                                           'offset' => '0',
                                                           'type' => '7479'
                                                         },
                                                  '1' => {
                                                           'name' => 'expr_size',
                                                           'offset' => '8',
                                                           'type' => '1532'
                                                         },
                                                  '2' => {
                                                           'name' => 'trg_type',
                                                           'offset' => '9',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct lys_unique',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7922' => {
                                      'BaseType' => '7869',
                                      'Name' => 'struct lys_unique*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7928' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '1906',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'LY_DEVIATE_NO',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'LY_DEVIATE_ADD',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'LY_DEVIATE_RPL',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'LY_DEVIATE_DEL',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum lys_deviate_type',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7971' => {
                                      'BaseType' => '7928',
                                      'Header' => 'tree_schema.h',
                                      'Line' => '1911',
                                      'Name' => 'LYS_DEVIATE_TYPE',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '7983' => {
                                      'Header' => 'tree_schema.h',
                                      'Line' => '1916',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mod',
                                                           'offset' => '0',
                                                           'type' => '7971'
                                                         },
                                                  '1' => {
                                                           'name' => 'flags',
                                                           'offset' => '4',
                                                           'type' => '1532'
                                                         },
                                                  '10' => {
                                                            'name' => 'must',
                                                            'offset' => '24',
                                                            'type' => '5967'
                                                          },
                                                  '11' => {
                                                            'name' => 'unique',
                                                            'offset' => '32',
                                                            'type' => '7922'
                                                          },
                                                  '12' => {
                                                            'name' => 'type',
                                                            'offset' => '40',
                                                            'type' => '7154'
                                                          },
                                                  '13' => {
                                                            'name' => 'units',
                                                            'offset' => '48',
                                                            'type' => '361'
                                                          },
                                                  '14' => {
                                                            'name' => 'dflt',
                                                            'offset' => '56',
                                                            'type' => '7479'
                                                          },
                                                  '15' => {
                                                            'name' => 'ext',
                                                            'offset' => '64',
                                                            'type' => '2724'
                                                          },
                                                  '2' => {
                                                           'name' => 'dflt_size',
                                                           'offset' => '5',
                                                           'type' => '1532'
                                                         },
                                                  '3' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '6',
                                                           'type' => '1532'
                                                         },
                                                  '4' => {
                                                           'name' => 'min_set',
                                                           'offset' => '7',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'max_set',
                                                           'offset' => '8',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'must_size',
                                                           'offset' => '9',
                                                           'type' => '1532'
                                                         },
                                                  '7' => {
                                                           'name' => 'unique_size',
                                                           'offset' => '10',
                                                           'type' => '1532'
                                                         },
                                                  '8' => {
                                                           'name' => 'min',
                                                           'offset' => '12',
                                                           'type' => '1559'
                                                         },
                                                  '9' => {
                                                           'name' => 'max',
                                                           'offset' => '16',
                                                           'type' => '1559'
                                                         }
                                                },
                                      'Name' => 'struct lys_deviate',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '81' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '8205' => {
                                      'BaseType' => '7983',
                                      'Name' => 'struct lys_deviate*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8211' => {
                                      'BaseType' => '249',
                                      'Name' => 'char[11]',
                                      'Size' => '11',
                                      'Type' => 'Array'
                                    },
                          '8227' => {
                                      'BaseType' => '5169',
                                      'Name' => 'struct lys_submodule*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8233' => {
                                      'Header' => 'xml.h',
                                      'Line' => '45',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'LYXML_ATTR_STD',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'LYXML_ATTR_NS',
                                                           'value' => '2'
                                                         },
                                                  '2' => {
                                                           'name' => 'LYXML_ATTR_STD_UNRES',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum lyxml_attr_type',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8269' => {
                                      'BaseType' => '8233',
                                      'Header' => 'xml.h',
                                      'Line' => '49',
                                      'Name' => 'LYXML_ATTR_TYPE',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8280' => {
                                      'Header' => 'xml.h',
                                      'Line' => '58',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '8269'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '8358'
                                                         },
                                                  '2' => {
                                                           'name' => 'parent',
                                                           'offset' => '16',
                                                           'type' => '8484'
                                                         },
                                                  '3' => {
                                                           'name' => 'prefix',
                                                           'offset' => '24',
                                                           'type' => '361'
                                                         },
                                                  '4' => {
                                                           'name' => 'value',
                                                           'offset' => '32',
                                                           'type' => '361'
                                                         }
                                                },
                                      'Name' => 'struct lyxml_ns',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '8353' => {
                                      'BaseType' => '8280',
                                      'Name' => 'struct lyxml_ns const',
                                      'Size' => '40',
                                      'Type' => 'Const'
                                    },
                          '8358' => {
                                      'BaseType' => '8280',
                                      'Name' => 'struct lyxml_ns*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8364' => {
                                      'Header' => 'xml.h',
                                      'Line' => '92',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'flags',
                                                           'offset' => '0',
                                                           'type' => '249'
                                                         },
                                                  '1' => {
                                                           'name' => 'parent',
                                                           'offset' => '8',
                                                           'type' => '8484'
                                                         },
                                                  '2' => {
                                                           'name' => 'attr',
                                                           'offset' => '16',
                                                           'type' => '8562'
                                                         },
                                                  '3' => {
                                                           'name' => 'child',
                                                           'offset' => '24',
                                                           'type' => '8484'
                                                         },
                                                  '4' => {
                                                           'name' => 'next',
                                                           'offset' => '32',
                                                           'type' => '8484'
                                                         },
                                                  '5' => {
                                                           'name' => 'prev',
                                                           'offset' => '40',
                                                           'type' => '8484'
                                                         },
                                                  '6' => {
                                                           'name' => 'name',
                                                           'offset' => '48',
                                                           'type' => '361'
                                                         },
                                                  '7' => {
                                                           'name' => 'ns',
                                                           'offset' => '56',
                                                           'type' => '8568'
                                                         },
                                                  '8' => {
                                                           'name' => 'content',
                                                           'offset' => '64',
                                                           'type' => '361'
                                                         }
                                                },
                                      'Name' => 'struct lyxml_elem',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '8484' => {
                                      'BaseType' => '8364',
                                      'Name' => 'struct lyxml_elem*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8490' => {
                                      'Header' => 'xml.h',
                                      'Line' => '75',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '8269'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '8562'
                                                         },
                                                  '2' => {
                                                           'name' => 'ns',
                                                           'offset' => '16',
                                                           'type' => '8568'
                                                         },
                                                  '3' => {
                                                           'name' => 'name',
                                                           'offset' => '24',
                                                           'type' => '361'
                                                         },
                                                  '4' => {
                                                           'name' => 'value',
                                                           'offset' => '32',
                                                           'type' => '361'
                                                         }
                                                },
                                      'Name' => 'struct lyxml_attr',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '8562' => {
                                      'BaseType' => '8490',
                                      'Name' => 'struct lyxml_attr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8568' => {
                                      'BaseType' => '8353',
                                      'Name' => 'struct lyxml_ns const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8574' => {
                                      'Header' => 'tree_data.h',
                                      'Line' => '94',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'binary',
                                                           'offset' => '0',
                                                           'type' => '361'
                                                         },
                                                  '1' => {
                                                           'name' => 'bit',
                                                           'offset' => '0',
                                                           'type' => '8785'
                                                         },
                                                  '10' => {
                                                            'name' => 'int64',
                                                            'offset' => '0',
                                                            'type' => '1435'
                                                          },
                                                  '11' => {
                                                            'name' => 'leafref',
                                                            'offset' => '0',
                                                            'type' => '8941'
                                                          },
                                                  '12' => {
                                                            'name' => 'string',
                                                            'offset' => '0',
                                                            'type' => '361'
                                                          },
                                                  '13' => {
                                                            'name' => 'uint8',
                                                            'offset' => '0',
                                                            'type' => '1532'
                                                          },
                                                  '14' => {
                                                            'name' => 'uint16',
                                                            'offset' => '0',
                                                            'type' => '1548'
                                                          },
                                                  '15' => {
                                                            'name' => 'uint32',
                                                            'offset' => '0',
                                                            'type' => '1559'
                                                          },
                                                  '16' => {
                                                            'name' => 'uint64',
                                                            'offset' => '0',
                                                            'type' => '1570'
                                                          },
                                                  '17' => {
                                                            'name' => 'ptr',
                                                            'offset' => '0',
                                                            'type' => '231'
                                                          },
                                                  '2' => {
                                                           'name' => 'bln',
                                                           'offset' => '0',
                                                           'type' => '1402'
                                                         },
                                                  '3' => {
                                                           'name' => 'dec64',
                                                           'offset' => '0',
                                                           'type' => '1435'
                                                         },
                                                  '4' => {
                                                           'name' => 'enm',
                                                           'offset' => '0',
                                                           'type' => '6446'
                                                         },
                                                  '5' => {
                                                           'name' => 'ident',
                                                           'offset' => '0',
                                                           'type' => '4402'
                                                         },
                                                  '6' => {
                                                           'name' => 'instance',
                                                           'offset' => '0',
                                                           'type' => '8941'
                                                         },
                                                  '7' => {
                                                           'name' => 'int8',
                                                           'offset' => '0',
                                                           'type' => '1402'
                                                         },
                                                  '8' => {
                                                           'name' => 'int16',
                                                           'offset' => '0',
                                                           'type' => '1413'
                                                         },
                                                  '9' => {
                                                           'name' => 'int32',
                                                           'offset' => '0',
                                                           'type' => '1424'
                                                         }
                                                },
                                      'Name' => 'union lyd_value_u',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '8785' => {
                                      'BaseType' => '6216',
                                      'Name' => 'struct lys_type_bit**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8791' => {
                                      'Header' => 'tree_data.h',
                                      'Line' => '176',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'schema',
                                                           'offset' => '0',
                                                           'type' => '5163'
                                                         },
                                                  '1' => {
                                                           'name' => 'validity',
                                                           'offset' => '8',
                                                           'type' => '1532'
                                                         },
                                                  '10' => {
                                                            'name' => 'child',
                                                            'offset' => '64',
                                                            'type' => '8941'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'dflt',
                                                           'offset' => '9',
                                                           'type' => '1532'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '3',
                                                           'name' => 'when_status',
                                                           'offset' => '9',
                                                           'type' => '1532'
                                                         },
                                                  '4' => {
                                                           'name' => 'attr',
                                                           'offset' => '16',
                                                           'type' => '9067'
                                                         },
                                                  '5' => {
                                                           'name' => 'next',
                                                           'offset' => '24',
                                                           'type' => '8941'
                                                         },
                                                  '6' => {
                                                           'name' => 'prev',
                                                           'offset' => '32',
                                                           'type' => '8941'
                                                         },
                                                  '7' => {
                                                           'name' => 'parent',
                                                           'offset' => '40',
                                                           'type' => '8941'
                                                         },
                                                  '8' => {
                                                           'name' => 'hash',
                                                           'offset' => '48',
                                                           'type' => '1559'
                                                         },
                                                  '9' => {
                                                           'name' => 'ht',
                                                           'offset' => '56',
                                                           'type' => '9176'
                                                         }
                                                },
                                      'Name' => 'struct lyd_node',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '88' => {
                                    'BaseType' => '99',
                                    'Header' => 'types.h',
                                    'Line' => '36',
                                    'Name' => '__int8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '8941' => {
                                      'BaseType' => '8791',
                                      'Name' => 'struct lyd_node*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8947' => {
                                      'BaseType' => '8574',
                                      'Header' => 'tree_data.h',
                                      'Line' => '116',
                                      'Name' => 'lyd_val',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8958' => {
                                      'Header' => 'tree_data.h',
                                      'Line' => '128',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'parent',
                                                           'offset' => '0',
                                                           'type' => '8941'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '9067'
                                                         },
                                                  '2' => {
                                                           'name' => 'annotation',
                                                           'offset' => '16',
                                                           'type' => '9073'
                                                         },
                                                  '3' => {
                                                           'name' => 'name',
                                                           'offset' => '24',
                                                           'type' => '361'
                                                         },
                                                  '4' => {
                                                           'name' => 'value_str',
                                                           'offset' => '32',
                                                           'type' => '361'
                                                         },
                                                  '5' => {
                                                           'name' => 'value',
                                                           'offset' => '40',
                                                           'type' => '8947'
                                                         },
                                                  '6' => {
                                                           'name' => 'value_type',
                                                           'offset' => '48',
                                                           'type' => '5810'
                                                         },
                                                  '7' => {
                                                           'name' => 'value_flags',
                                                           'offset' => '52',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct lyd_attr',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '9067' => {
                                      'BaseType' => '8958',
                                      'Name' => 'struct lyd_attr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9073' => {
                                      'BaseType' => '3372',
                                      'Name' => 'struct lys_ext_instance_complex*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9079' => {
                                      'Header' => 'hash_table.h',
                                      'Line' => '75',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'used',
                                                           'offset' => '0',
                                                           'type' => '1559'
                                                         },
                                                  '1' => {
                                                           'name' => 'size',
                                                           'offset' => '4',
                                                           'type' => '1559'
                                                         },
                                                  '2' => {
                                                           'name' => 'val_equal',
                                                           'offset' => '8',
                                                           'type' => '10132'
                                                         },
                                                  '3' => {
                                                           'name' => 'cb_data',
                                                           'offset' => '16',
                                                           'type' => '231'
                                                         },
                                                  '4' => {
                                                           'name' => 'resize',
                                                           'offset' => '24',
                                                           'type' => '1548'
                                                         },
                                                  '5' => {
                                                           'name' => 'rec_size',
                                                           'offset' => '26',
                                                           'type' => '1548'
                                                         },
                                                  '6' => {
                                                           'name' => 'recs',
                                                           'offset' => '32',
                                                           'type' => '10179'
                                                         }
                                                },
                                      'Name' => 'struct hash_table',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '9176' => {
                                      'BaseType' => '9079',
                                      'Name' => 'struct hash_table*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9182' => {
                                      'BaseType' => '8941',
                                      'Name' => 'struct lyd_node**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9188' => {
                                      'BaseType' => '9200',
                                      'Header' => 'libyang.h',
                                      'Line' => '1469',
                                      'Name' => 'ly_module_imp_clb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '9200' => {
                                      'Name' => 'char const*(*)(char const*, char const*, char const*, char const*, void*, LYS_INFORMAT*, void(**)(void*, void*))',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '361'
                                                          },
                                                   '1' => {
                                                            'type' => '361'
                                                          },
                                                   '2' => {
                                                            'type' => '361'
                                                          },
                                                   '3' => {
                                                            'type' => '361'
                                                          },
                                                   '4' => {
                                                            'type' => '231'
                                                          },
                                                   '5' => {
                                                            'type' => '9251'
                                                          },
                                                   '6' => {
                                                            'type' => '9257'
                                                          }
                                                 },
                                      'Return' => '361',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '9251' => {
                                      'BaseType' => '1613',
                                      'Name' => 'LYS_INFORMAT*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9257' => {
                                      'BaseType' => '9263',
                                      'Name' => 'void(**)(void*, void*)',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9263' => {
                                      'Name' => 'void(*)(void*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '231'
                                                          },
                                                   '1' => {
                                                            'type' => '231'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '9285' => {
                                      'BaseType' => '9297',
                                      'Header' => 'libyang.h',
                                      'Line' => '1504',
                                      'Name' => 'ly_module_data_clb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '9297' => {
                                      'Name' => 'struct lys_module const*(*)(struct ly_ctx*, char const*, char const*, int, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3714'
                                                          },
                                                   '1' => {
                                                            'type' => '361'
                                                          },
                                                   '2' => {
                                                            'type' => '361'
                                                          },
                                                   '3' => {
                                                            'type' => '157'
                                                          },
                                                   '4' => {
                                                            'type' => '231'
                                                          }
                                                 },
                                      'Return' => '9338',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '9338' => {
                                      'BaseType' => '3264',
                                      'Name' => 'struct lys_module const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9344' => {
                                      'Header' => 'libyang.h',
                                      'Line' => '1691',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 's',
                                                           'offset' => '0',
                                                           'type' => '9388'
                                                         },
                                                  '1' => {
                                                           'name' => 'd',
                                                           'offset' => '0',
                                                           'type' => '9182'
                                                         },
                                                  '2' => {
                                                           'name' => 'g',
                                                           'offset' => '0',
                                                           'type' => '6990'
                                                         }
                                                },
                                      'Name' => 'union ly_set_set',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '9388' => {
                                      'BaseType' => '5163',
                                      'Name' => 'struct lys_node**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9433' => {
                                      'Header' => 'libyang.h',
